src/java核心技术.org
* java基本的程序设计结构
** 注释
#+BEGIN_SRC java
// comment

/*
comment
*/

/** 
comment
*/
#+END_SRC
** java基本数据类型
| 类型    | 存储(字节) |
|---------+------------|
| int     |          4 |
| short   |          8 |
| long    |          8 |
| byte    |          1 |
|---------+------------|
| float   |          4 |
| double  |          8 |
|---------+------------|
| char    |            |
|---------+------------|
| boolean |            |
+ java中整型的范围与运行java代码的机器无关
+ 长整型有一个后缀L,float类型有一个后缀F
+ 十六进制有一个前缀0x,八进制有一个前缀0
+ 在很多情况下,float类型的精度很难满足需求
+ 强烈建议不在程序中使用char类型(编码的原因)
+ 整型值和布尔值之间不能相互转换
#+END_SRC
** 变量
#+BEGIN_SRC java
double salary;
int i,j;
final double CONS
#+END_SRC
+ 在java中,使用关键字final声明常量
** 运算符
| 类型          | 运算符                |
|---------------+-----------------------|
| 算术运算符    | + - * / %             |
| 自增/减运算符 | ++ --                 |
| 关系运算符    | == != < <= > >=       |
| 布尔运算符    | && \vert\vert !       |
| 三元运算符    | :?                    |
| 位运算符      | & \vert ~ ^ >> << >>> |
+ 自动类型转换
  1. 如果两个操作数中有一个是double类型的,把另一个也转换为double类型
  2. 否则,如果两个操作数中有一个是float类型的,把另一个也转换为float类型
  3. 否则,如果两个操作数中有一个是long类型的,把另一个也转换为long类型
  4. 否则,两个操作数都将被转换为int类型
+ 强制类型转换
#+BEGIN_SRC java
double x = 3.14;
int nx = (int)x;
#+END_SRC
** 字符串
+ java没有内置的字符串类型,而是在标准库中提供了一个预定义类String
+ 每个用双引号括起来的字符串都是String类的一个实例
+ String类没有提供用于修改字符串的方法,String类对象也称为不可变字符串,其好处是可以让字符串共享
+ 实际上某些情况下字符串常量是不共享的,因此 *不要* 使用==运算符测试字符串的相等性
