html/java核心技术.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>java核心技术</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="java核心技术"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-07T20:28+0800"/>
<meta name="author" content="王超"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">java核心技术</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 java基本的程序设计结构</a>
<ul>
<li><a href="#sec-1-1">1.1 注释</a></li>
<li><a href="#sec-1-2">1.2 java基本数据类型</a></li>
<li><a href="#sec-1-3">1.3 变量</a></li>
<li><a href="#sec-1-4">1.4 运算符</a></li>
<li><a href="#sec-1-5">1.5 字符串</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 String重要方法方法</a></li>
<li><a href="#sec-1-5-2">1.5.2 构建字符串</a></li>
<li><a href="#sec-1-5-3">1.5.3 StringBuilder重要方法</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 输入输出</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 标准输出</a></li>
<li><a href="#sec-1-6-2">1.6.2 格式化输出</a></li>
<li><a href="#sec-1-6-3">1.6.3 标准输入</a></li>
<li><a href="#sec-1-6-4">1.6.4 读文件</a></li>
<li><a href="#sec-1-6-5">1.6.5 写文件</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 控制流程</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 条件语句</a></li>
<li><a href="#sec-1-7-2">1.7.2 循环语句</a></li>
<li><a href="#sec-1-7-3">1.7.3 switch语句</a></li>
<li><a href="#sec-1-7-4">1.7.4 break和continue</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8 数组</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1 初始化数组</a></li>
<li><a href="#sec-1-8-2">1.8.2 Arrays重要方法</a></li>
<li><a href="#sec-1-8-3">1.8.3 多维数组</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 对象与类</a>
<ul>
<li><a href="#sec-2-1">2.1 使用现有类</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 java.util.GregorianCalendar</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 用户自定义类</a></li>
<li><a href="#sec-2-3">2.3 静态域与静态方法</a></li>
<li><a href="#sec-2-4">2.4 方法参数</a></li>
<li><a href="#sec-2-5">2.5 对象构造</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 对象初始化步骤</a></li>
<li><a href="#sec-2-5-2">2.5.2 域初始化</a></li>
<li><a href="#sec-2-5-3">2.5.3 初始化块</a></li>
<li><a href="#sec-2-5-4">2.5.4 构造器</a></li>
<li><a href="#sec-2-5-5">2.5.5 调用另一个构造器</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6 包</a></li>
<li><a href="#sec-2-7">2.7 类路径</a></li>
<li><a href="#sec-2-8">2.8 小结</a></li>
</ul>
</li>
<li><a href="#sec-3">3 继承</a>
<ul>
<li><a href="#sec-3-1">3.1 类,超类和子类</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 多态</a></li>
<li><a href="#sec-3-1-2">3.1.2 动态绑定</a></li>
<li><a href="#sec-3-1-3">3.1.3 阻止继承</a></li>
<li><a href="#sec-3-1-4">3.1.4 强制类型转换</a></li>
<li><a href="#sec-3-1-5">3.1.5 抽象类</a></li>
<li><a href="#sec-3-1-6">3.1.6 受保护的访问</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 object 所有类的超类</a></li>
<li><a href="#sec-3-3">3.3 泛型数组列表</a></li>
<li><a href="#sec-3-4">3.4 对象包装器</a></li>
<li><a href="#sec-3-5">3.5 参数数量可变的方法</a></li>
<li><a href="#sec-3-6">3.6 枚举类</a></li>
<li><a href="#sec-3-7">3.7 反射</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1 利用反射分析类的能力</a></li>
<li><a href="#sec-3-7-2">3.7.2 在运行时使用反射分析对象</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 接口与内部类</a>
<ul>
<li><a href="#sec-4-1">4.1 接口</a></li>
<li><a href="#sec-4-2">4.2 对象克隆</a></li>
<li><a href="#sec-4-3">4.3 接口与回调</a></li>
<li><a href="#sec-4-4">4.4 内部类</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 内部类</a></li>
<li><a href="#sec-4-4-2">4.4.2 局部内部类</a></li>
<li><a href="#sec-4-4-3">4.4.3 匿名内部类</a></li>
<li><a href="#sec-4-4-4">4.4.4 静态内部类</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 代理</a></li>
</ul>
</li>
<li><a href="#sec-5">5 异常,日志,断言和调试</a>
<ul>
<li><a href="#sec-5-1">5.1 处理异常</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 异常结构</a></li>
<li><a href="#sec-5-1-2">5.1.2 声明已检查异常</a></li>
<li><a href="#sec-5-1-3">5.1.3 抛出异常</a></li>
<li><a href="#sec-5-1-4">5.1.4 捕获异常</a></li>
<li><a href="#sec-5-1-5">5.1.5 分析堆栈跟踪(stack trace)元素</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2 断言</a></li>
<li><a href="#sec-5-3">5.3 记录日志</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1 日志记录器</a></li>
<li><a href="#sec-5-3-2">5.3.2 修改日志管理器配置</a></li>
<li><a href="#sec-5-3-3">5.3.3 处理器</a></li>
<li><a href="#sec-5-3-4">5.3.4 过滤器</a></li>
<li><a href="#sec-5-3-5">5.3.5 格式化器</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 泛型程序设计</a>
<ul>
<li><a href="#sec-6-1">6.1 泛型类</a></li>
<li><a href="#sec-6-2">6.2 泛型方法</a></li>
<li><a href="#sec-6-3">6.3 限定类型变量</a></li>
<li><a href="#sec-6-4">6.4 类型擦除</a></li>
<li><a href="#sec-6-5">6.5 约束与局限</a></li>
<li><a href="#sec-6-6">6.6 泛型类型的继承规则</a></li>
<li><a href="#sec-6-7">6.7 通配符类型</a></li>
</ul>
</li>
<li><a href="#sec-7">7 集合</a>
<ul>
<li><a href="#sec-7-1">7.1 集合接口</a></li>
<li><a href="#sec-7-2">7.2 具体的集合</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 链表</a></li>
<li><a href="#sec-7-2-2">7.2.2 数组列表</a></li>
<li><a href="#sec-7-2-3">7.2.3 散列集</a></li>
<li><a href="#sec-7-2-4">7.2.4 树集</a></li>
<li><a href="#sec-7-2-5">7.2.5 队列与双端队列</a></li>
<li><a href="#sec-7-2-6">7.2.6 优先级队列</a></li>
<li><a href="#sec-7-2-7">7.2.7 映射表</a></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3 集合框架</a>
<ul>
<li><a href="#sec-7-3-1">7.3.1 集合框架的接口</a></li>
<li><a href="#sec-7-3-2">7.3.2 集合框架的类</a></li>
<li><a href="#sec-7-3-3">7.3.3 视图</a></li>
<li><a href="#sec-7-3-4">7.3.4 集合与数组之间的转换</a></li>
</ul>
</li>
<li><a href="#sec-7-4">7.4 算法</a>
<ul>
<li><a href="#sec-7-4-1">7.4.1 排序和混排</a></li>
<li><a href="#sec-7-4-2">7.4.2 二分查找</a></li>
<li><a href="#sec-7-4-3">7.4.3 简单算法</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 多线程</a>
<ul>
<li><a href="#sec-8-1">8.1 线程概念</a></li>
<li><a href="#sec-8-2">8.2 中断线程</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1 interrupt方法</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3 线程状态</a></li>
<li><a href="#sec-8-4">8.4 线程属性</a>
<ul>
<li><a href="#sec-8-4-1">8.4.1 线程优先级</a></li>
<li><a href="#sec-8-4-2">8.4.2 守护线程</a></li>
</ul>
</li>
<li><a href="#sec-8-5">8.5 同步</a>
<ul>
<li><a href="#sec-8-5-1">8.5.1 锁对象</a></li>
<li><a href="#sec-8-5-2">8.5.2 条件对象</a></li>
<li><a href="#sec-8-5-3">8.5.3 synchronized关键字</a></li>
<li><a href="#sec-8-5-4">8.5.4 同步阻塞</a></li>
<li><a href="#sec-8-5-5">8.5.5 valatile域</a></li>
<li><a href="#sec-8-5-6">8.5.6 锁测试与超时</a></li>
<li><a href="#sec-8-5-7">8.5.7 读写锁</a></li>
</ul>
</li>
<li><a href="#sec-8-6">8.6 阻塞队列</a></li>
<li><a href="#sec-8-7">8.7 线程安全的集合</a>
<ul>
<li><a href="#sec-8-7-1">8.7.1 映射,集合和队列</a></li>
<li><a href="#sec-8-7-2">8.7.2 写数组的拷贝</a></li>
</ul>
</li>
<li><a href="#sec-8-8">8.8 Callable与Future</a></li>
<li><a href="#sec-8-9">8.9 执行器</a>
<ul>
<li><a href="#sec-8-9-1">8.9.1 线程池</a></li>
<li><a href="#sec-8-9-2">8.9.2 预订执行</a></li>
<li><a href="#sec-8-9-3">8.9.3 控制任务组</a></li>
</ul>
</li>
<li><a href="#sec-8-10">8.10 同步器</a>
<ul>
<li><a href="#sec-8-10-1">8.10.1 信号量</a></li>
<li><a href="#sec-8-10-2">8.10.2 倒计时门栓</a></li>
<li><a href="#sec-8-10-3">8.10.3 障栅</a></li>
<li><a href="#sec-8-10-4">8.10.4 交换器</a></li>
<li><a href="#sec-8-10-5">8.10.5 同步队列</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> java基本的程序设计结构</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 注释</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-java"><span style="color: #b22222;">// </span><span style="color: #b22222;">comment</span>

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;">comment</span>
<span style="color: #b22222;">*/</span>

<span style="color: #8b2252;">/** </span>
<span style="color: #8b2252;">comment</span>
<span style="color: #8b2252;">*/</span>
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> java基本数据类型</h3>
<div class="outline-text-3" id="text-1-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">类型</th><th scope="col" class="right">存储(字节)</th></tr>
</thead>
<tbody>
<tr><td class="left">int</td><td class="right">4</td></tr>
<tr><td class="left">short</td><td class="right">2</td></tr>
<tr><td class="left">long</td><td class="right">8</td></tr>
<tr><td class="left">byte</td><td class="right">1</td></tr>
</tbody>
<tbody>
<tr><td class="left">float</td><td class="right">4</td></tr>
<tr><td class="left">double</td><td class="right">8</td></tr>
</tbody>
<tbody>
<tr><td class="left">char</td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">boolean</td><td class="right"></td></tr>
</tbody>
</table>

<ul>
<li>java中整型的范围与运行java代码的机器无关
</li>
<li>长整型有一个后缀L,float类型有一个后缀F
</li>
<li>十六进制有一个前缀0x,八进制有一个前缀0
</li>
<li>在很多情况下,float类型的精度很难满足需求
</li>
<li>强烈建议不在程序中使用char类型(编码的原因)
</li>
<li>整型值和布尔值之间不能相互转换
</li>
</ul>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 变量</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-java"><span style="color: #228b22;">double</span> <span style="color: #a0522d;">salary</span>;
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">j</span>;
<span style="color: #a020f0;">final</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">CONS</span>
</pre>

<ul>
<li>在java中,使用关键字final声明常量
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 运算符</h3>
<div class="outline-text-3" id="text-1-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">类型</th><th scope="col" class="left">运算符</th></tr>
</thead>
<tbody>
<tr><td class="left">算术运算符</td><td class="left">+ - * / %</td></tr>
<tr><td class="left">自增/减运算符</td><td class="left">++ &ndash;</td></tr>
<tr><td class="left">关系运算符</td><td class="left">== != &lt; &lt;= &gt; &gt;=</td></tr>
<tr><td class="left">布尔运算符</td><td class="left">&amp;&amp; &#124;&#124; !</td></tr>
<tr><td class="left">三元运算符</td><td class="left">:?</td></tr>
<tr><td class="left">位运算符</td><td class="left">&amp; &#124; ~ ^ &gt;&gt; <a name="" class="target"> </a></td></tr>
</tbody>
</table>

<ul>
<li>自动类型转换
<ol>
<li>如果两个操作数中有一个是double类型的,把另一个也转换为double类型
</li>
<li>否则,如果两个操作数中有一个是float类型的,把另一个也转换为float类型
</li>
<li>否则,如果两个操作数中有一个是long类型的,把另一个也转换为long类型
</li>
<li>否则,两个操作数都将被转换为int类型
</li>
</ol>

</li>
<li>强制类型转换
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span> = 3.14;
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">nx</span> = (<span style="color: #228b22;">int</span>)x;
</pre>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 字符串</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>java没有内置的字符串类型,而是在标准库中提供了一个预定义类String
</li>
<li>每个用双引号括起来的字符串都是String类的一个实例
</li>
<li>String类没有提供用于修改字符串的方法,String类对象也称为不可变字符串,其好处是可以让字符串共享
</li>
<li>实际上某些情况下字符串常量是不共享的,因此 <b>不要</b> 使用==运算符测试字符串的相等性
</li>
</ul>


</div>
