src/java核心技术.org
*** String重要方法方法
#+BEGIN_SRC java
java.lang.String

//返回给定位置的代码单元
char charAt(int index)                            

//按字典序比较,若字符串位于other之前,返回负数,之后返回正数,相等返回0
int compareTo(String other)

//如果字符串以suffix结尾,返回true
boolean endsWith(String suffix)

//如果字符串与other相等,返回true
boolean equals(Object other)

//如果字符串与other相等(忽略大小写),返回true
boolean equalsIgnoreCase(Object other)

//返回字符串长度
int length()

//用new代替原始字符串中的old,可以用String或StringBuilder对象作为CharSequence参数
String replace(CharSequence old,CharSequence new)

//返回子串
String substring(int beg)
String substring(int beg, int end)

//将原始字符串中所有大小写字母改成小(大)写字母
String toLowerCase()
String toUpperCase()

//删除原始字符串头部和尾部的空格
String trim()
#+END_SRC
*** 构建字符串
+ 采用字符串连接的方式构建字符串效率低,每次连接字符串都会构建一个新的String对象,既耗时由浪费空间
+ StringBuilder可以避免这个问题
#+BEGIN_SRC java
StringBuilder builder = new StringBuilder();
builder.append(str1);
builder.append(str2);
String completeString = builder.toString();
#+END_SRC
*** StringBuilder重要方法
#+BEGIN_SRC java
java.lang.StringBuilder

int length()                                 //返回构建器中字符数量       
StringBuilder append(String str)             //追加一个字符串             
StringBuilder append(char c)                 //追加一个字符               
void setCharAt(int i, char c)                //将第i个字符设置为c         
StringBuilder insert(int offset, String str) //在offset位置插入一个字符串 
StringBuilder insert(int offset, char c)     //在offset位置插入一个字符   
StringBuilder delete(int beg, int end)       //删除偏移量从beg到end-1的字符 
String toString()                            //返回一个与构建器内容相同的字符串
#+END_SRC

** 输入输出
*** 标准输出
#+BEGIN_SRC java
System.out.println("sth");
#+END_SRC
*** 格式化输出
#+BEGIN_SRC java
System.out.printf("hello %s, next year you'll be%s",name,age);
#+END_SRC
*** 标准输入
**** 使用Scanner
#+BEGIN_SRC java
import java.util.Scanner;
Scanner in = new Scanner(System.in);
String s1 = in.nextLine();//读取一行
String s2 = in.next();    //读取一个单词
int i = in.nextInt();     //读取一个整数
double= in.nextDouble();  //读取一个浮点数
#+END_SRC
**** 使用Console
#+BEGIN_SRC java
Console cons = System.console();
String str = cons.readLine("prompt");
char[] passwd = cons.readPassword("password");
#+END_SRC
*** 读文件
#+BEGIN_SRC java
import java.util.Scanner;
Scanner in = new Scanner(new File("filename.ext"));
#+END_SRC
*** 写文件
#+BEGIN_SRC java
PrintWriter out = new PrintWriter("filename.ext")
out.print("sth");
out.println("sth");
out.printf("%s","sth");
#+END_SRC
** 控制流程
*** 条件语句
#+BEGIN_SRC java
if(condition)
    ...
else if(conditon)
    ...
else
    ...
#+END_SRC
*** 循环语句
**** while循环
#+BEGIN_SRC java
while(conditon)
    ...
#+END_SRC
**** do-while循环
#+BEGIN_SRC java
do
    ...
while(condition);
#+END_SRC
**** for循环
#+BEGIN_SRC java
for(int i=0; i<10; i++)
    ...
#+END_SRC
#+BEGIN_SRC java
for (variable: collection)
    ...
//collection必须是一个数组或者是一个实现了Iterable接口的对象
#+END_SRC
