html/java核心技术.html

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> String重要方法方法</h4>
<div class="outline-text-4" id="text-1-5-1">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.String

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#32473;&#23450;&#20301;&#32622;&#30340;&#20195;&#30721;&#21333;&#20803;</span>
<span style="color: #228b22;">char</span> <span style="color: #0000ff;">charAt</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>)                            

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25353;&#23383;&#20856;&#24207;&#27604;&#36739;,&#33509;&#23383;&#31526;&#20018;&#20301;&#20110;other&#20043;&#21069;,&#36820;&#22238;&#36127;&#25968;,&#20043;&#21518;&#36820;&#22238;&#27491;&#25968;,&#30456;&#31561;&#36820;&#22238;0</span>
<span style="color: #228b22;">int</span> compareTo(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">other</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#23383;&#31526;&#20018;&#20197;suffix&#32467;&#23614;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> endsWith(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">suffix</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#23383;&#31526;&#20018;&#19982;other&#30456;&#31561;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> equals(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">other</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#23383;&#31526;&#20018;&#19982;other&#30456;&#31561;(&#24573;&#30053;&#22823;&#23567;&#20889;),&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> equalsIgnoreCase(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">other</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23383;&#31526;&#20018;&#38271;&#24230;</span>
<span style="color: #228b22;">int</span> length()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;new&#20195;&#26367;&#21407;&#22987;&#23383;&#31526;&#20018;&#20013;&#30340;old,&#21487;&#20197;&#29992;String&#25110;StringBuilder&#23545;&#35937;&#20316;&#20026;CharSequence&#21442;&#25968;</span>
String replace(<span style="color: #228b22;">CharSequence</span> <span style="color: #a0522d;">old</span>,CharSequence <span style="color: #a020f0;">new</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23376;&#20018;</span>
String substring(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">beg</span>)
String substring(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">beg</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">end</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#21407;&#22987;&#23383;&#31526;&#20018;&#20013;&#25152;&#26377;&#22823;&#23567;&#20889;&#23383;&#27597;&#25913;&#25104;&#23567;(&#22823;)&#20889;&#23383;&#27597;</span>
String toLowerCase()
String toUpperCase()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#21407;&#22987;&#23383;&#31526;&#20018;&#22836;&#37096;&#21644;&#23614;&#37096;&#30340;&#31354;&#26684;</span>
String trim()
</pre>

</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 构建字符串</h4>
<div class="outline-text-4" id="text-1-5-2">

<ul>
<li>采用字符串连接的方式构建字符串效率低,每次连接字符串都会构建一个新的String对象,既耗时由浪费空间
</li>
<li>StringBuilder可以避免这个问题
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">StringBuilder</span> <span style="color: #a0522d;">builder</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">StringBuilder</span>();
builder.append(str1);
builder.append(str2);
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">completeString</span> = builder.toString();
</pre>

</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> StringBuilder重要方法</h4>
<div class="outline-text-4" id="text-1-5-3">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.StringBuilder

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">length</span>()                                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26500;&#24314;&#22120;&#20013;&#23383;&#31526;&#25968;&#37327;       </span>
StringBuilder append(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">str</span>)             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36861;&#21152;&#19968;&#20010;&#23383;&#31526;&#20018;             </span>
StringBuilder append(<span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>)                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36861;&#21152;&#19968;&#20010;&#23383;&#31526;               </span>
<span style="color: #228b22;">void</span> setCharAt(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>)                <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#31532;i&#20010;&#23383;&#31526;&#35774;&#32622;&#20026;c         </span>
StringBuilder insert(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">offset</span>, <span style="color: #228b22;">String</span> <span style="color: #a0522d;">str</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;offset&#20301;&#32622;&#25554;&#20837;&#19968;&#20010;&#23383;&#31526;&#20018; </span>
StringBuilder insert(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">offset</span>, <span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span>)     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;offset&#20301;&#32622;&#25554;&#20837;&#19968;&#20010;&#23383;&#31526;   </span>
StringBuilder delete(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">beg</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">end</span>)       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#20559;&#31227;&#37327;&#20174;beg&#21040;end-1&#30340;&#23383;&#31526; </span>
String toString()                            <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#19982;&#26500;&#24314;&#22120;&#20869;&#23481;&#30456;&#21516;&#30340;&#23383;&#31526;&#20018;</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 输入输出</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> 标准输出</h4>
<div class="outline-text-4" id="text-1-6-1">




<pre class="src src-java">System.out.println(<span style="color: #8b2252;">"sth"</span>);
</pre>

</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> 格式化输出</h4>
<div class="outline-text-4" id="text-1-6-2">




<pre class="src src-java">System.out.printf(<span style="color: #8b2252;">"hello %s, next year you'll be%s"</span>,name,age);
</pre>

</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> 标准输入</h4>
<div class="outline-text-4" id="text-1-6-3">

<ul>
<li id="sec-1-6-3-1">使用Scanner<br/>



<pre class="src src-java"><span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Scanner</span>;
<span style="color: #228b22;">Scanner</span> <span style="color: #a0522d;">in</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Scanner</span>(System.in);
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s1</span> = in.nextLine();<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35835;&#21462;&#19968;&#34892;</span>
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s2</span> = in.next();    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35835;&#21462;&#19968;&#20010;&#21333;&#35789;</span>
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = in.nextInt();     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35835;&#21462;&#19968;&#20010;&#25972;&#25968;</span>
<span style="color: #228b22;">double</span>= in.nextDouble();  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35835;&#21462;&#19968;&#20010;&#28014;&#28857;&#25968;</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-1-6-3-2">使用Console<br/>



<pre class="src src-java"><span style="color: #228b22;">Console</span> <span style="color: #a0522d;">cons</span> = System.console();
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">str</span> = cons.readLine(<span style="color: #8b2252;">"prompt"</span>);
<span style="color: #228b22;">char</span>[] <span style="color: #a0522d;">passwd</span> = cons.readPassword(<span style="color: #8b2252;">"password"</span>);
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> 读文件</h4>
<div class="outline-text-4" id="text-1-6-4">




<pre class="src src-java"><span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Scanner</span>;
<span style="color: #228b22;">Scanner</span> <span style="color: #a0522d;">in</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Scanner</span>(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">File</span>(<span style="color: #8b2252;">"filename.ext"</span>));
</pre>

</div>

</div>

<div id="outline-container-1-6-5" class="outline-4">
<h4 id="sec-1-6-5"><span class="section-number-4">1.6.5</span> 写文件</h4>
<div class="outline-text-4" id="text-1-6-5">




<pre class="src src-java"><span style="color: #228b22;">PrintWriter</span> <span style="color: #a0522d;">out</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">PrintWriter</span>(<span style="color: #8b2252;">"filename.ext"</span>)
out.print(<span style="color: #8b2252;">"sth"</span>);
out.println(<span style="color: #8b2252;">"sth"</span>);
out.printf(<span style="color: #8b2252;">"%s"</span>,<span style="color: #8b2252;">"sth"</span>);
</pre>

</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 控制流程</h3>
<div class="outline-text-3" id="text-1-7">


</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> 条件语句</h4>
<div class="outline-text-4" id="text-1-7-1">




<pre class="src src-java"><span style="color: #a020f0;">if</span>(condition)
    ...
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(conditon)
    ...
<span style="color: #a020f0;">else</span>
    ...
</pre>

</div>

</div>

<div id="outline-container-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> 循环语句</h4>
<div class="outline-text-4" id="text-1-7-2">

<ul>
<li id="sec-1-7-2-1">while循环<br/>



<pre class="src src-java"><span style="color: #a020f0;">while</span>(conditon)
    ...
</pre>

</li>
</ul>
<ul>
<li id="sec-1-7-2-2">do-while循环<br/>



<pre class="src src-java"><span style="color: #a020f0;">do</span>
    ...
<span style="color: #a020f0;">while</span>(condition);
</pre>

</li>
</ul>
<ul>
<li id="sec-1-7-2-3">for循环<br/>



<pre class="src src-java"><span style="color: #a020f0;">for</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt;10; i++)
    ...
</pre>


<pre class="src src-java"><span style="color: #a020f0;">for</span> (variable: collection)
    ...
<span style="color: #b22222;">//</span><span style="color: #b22222;">collection&#24517;&#39035;&#26159;&#19968;&#20010;&#25968;&#32452;&#25110;&#32773;&#26159;&#19968;&#20010;&#23454;&#29616;&#20102;Iterable&#25509;&#21475;&#30340;&#23545;&#35937;</span>
</pre>

</li>
</ul>
</div>

</div>
