src/java核心技术.org
*** switch语句
#+BEGIN_SRC java
switch(var){
    case case1:
        ...
        break;
    case case2:
        ...
        break;
    default:
        ...
}
#+END_SRC
+ case标签必须是整数或枚举常量,不能测试字符串
*** break和continue
**** 带标签的break
+ 用于跳出多重嵌套循环
+ 标签必须放在希望跳出的最外层循环之前,紧跟一个冒号
+ 执行带标签的break将跳转到带标签语句块末尾
**** 带标签的continue
+ 执行带标签的break将跳转到带标签语句块首部
** 数组
*** 初始化数组
#+BEGIN_SRC java
int[] a = new int[100];
int[] a = {1,2,3,4,5};
new int[]{1,2,3,4,5};     #匿名数组
#+END_SRC
+ 使用a.length获取数组长度
*** Arrays重要方法
#+BEGIN_SRC java
java.util.Arrays

/*返回与a类型相同的数组,如果length值大于a.length,结果为0或false,
如果length值小于a.length,数组中将只有前面length个数据元素的拷贝*/
static type copyOf(type[] a, int length)

//结果为a中[beg,end-1)的拷贝,如果end大于a.length,结果为0或false
static type copyOf(type[] a, int beg, int end)

//返回数组的字符串表示,括号包围,逗号分隔
static String toString(type[[] a)

//用优化的快速排序算法对数组进行排序
static void sort(type[] a)

//用二分搜索算法查找值v
static int binarySearch(type[] a, type v)

//用二分搜索算法查找值v
static int binarySearch(type[] a, int beg, int end, type v)

//将数组所有元素设置为v
static void fill(type[] a, type v)

//如果两个数组大小相同,且下标相同的元素都对应相等,返回true
static boolean equals(type[] a, type[] b)
#+END_SRC
*** 多维数组
#+BEGIN_SRC java
int[][] multiArray = new int[2][2];
int[][] multiArray = {{1,2},{3,4}};
#+END_SRC
+ java实际上没有多维数组,只有一维数组,多为数组被解释为"数组的数组"
+ 因此,可以方便地构造不规则数组
* 对象与类
** 使用现有类
*** java.util.GregorianCalendar
#+BEGIN_SRC java
java.util.GregorianCalendar

//构造一个日历对象,用来表示默认地区默认时区的当前时间
GregorianCalendar()
//用给定的日期和时间构造一个Gregorian日历对象
GregorianCalendar(int year,
                  int month,
                  int day)
GregorianCalendar(int year,
                  int month,
                  int day,
                  int hour,
                  int minutes,
                  int seconds)

int get(int field)                     //返回给定域的值,如Calendar.YEAR(MONTH)
void set(int field, int value)         //设置特定域的值
void set(int year, int month, int day) //将日期域设为新值
void add(int field, int amount)        //对特定域进行增加制定数量的时间
int getFirstDayOfWeek()                //获得当前用户所在地区一个星期中的第一天
void setTime(Date time)                //将日历设置为指定时间点
Date getTime()                         //获得这个日历对象当前值所表达的时间点
void set(int year, int month, int day, int hour, int minutes, int seconds)
//将日期域和时间域设为新值
#+END_SRC
** 用户自定义类
#+BEGIN_SRC java
class ClassName{
    constructor1
    constructor2
    ...
    method1
    method2
    ...
    field1
    field2
    ...
}
#+END_SRC
+ 可以认为java编译器内置了make功能,当java编译器发现a.java使用了b类时会查找b.class文件,如果没有找到,会自动搜索b.java并对其进行编译,如果b.java版本比已有的b.class新,java编译器会自动重新编译这个文件.
+ 在每一个方法中,关键字this表示隐式参数.
+ 为了封装实例域,应该提供三项内容:一个私有的实例域,一个公有的访问器,一个公有的更改器.
+ 一个方法可以访问所属类的 *所有对象* 的私有数据,即不仅可以访问所绑定对象的私有域,还可以访问其他对象的私有域.
+ 可以将实例域定义为final,在构造器执行之后,这个域的值被设置,并在后面的操作中不能在进行修改.
