html/java核心技术.html

<div id="outline-container-1-7-3" class="outline-4">
<h4 id="sec-1-7-3"><span class="section-number-4">1.7.3</span> switch语句</h4>
<div class="outline-text-4" id="text-1-7-3">




<pre class="src src-java"><span style="color: #a020f0;">switch</span>(var){
    <span style="color: #a020f0;">case</span> case1:
        ...
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> case2:
        ...
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">default</span>:
        ...
}
</pre>

<ul>
<li>case标签必须是整数或枚举常量,不能测试字符串
</li>
</ul>

</div>

</div>

<div id="outline-container-1-7-4" class="outline-4">
<h4 id="sec-1-7-4"><span class="section-number-4">1.7.4</span> break和continue</h4>
<div class="outline-text-4" id="text-1-7-4">

<ul>
<li id="sec-1-7-4-1">带标签的break<br/>
<ul>
<li>用于跳出多重嵌套循环
</li>
<li>标签必须放在希望跳出的最外层循环之前,紧跟一个冒号
</li>
<li>执行带标签的break将跳转到带标签语句块末尾
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-7-4-2">带标签的continue<br/>
<ul>
<li>执行带标签的break将跳转到带标签语句块首部
</li>
</ul>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 数组</h3>
<div class="outline-text-3" id="text-1-8">


</div>

<div id="outline-container-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> 初始化数组</h4>
<div class="outline-text-4" id="text-1-8-1">




<pre class="src src-java"><span style="color: #228b22;">int</span>[] <span style="color: #a0522d;">a</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">int</span>[100];
<span style="color: #228b22;">int</span>[] <span style="color: #a0522d;">a</span> = {1,2,3,4,5};
<span style="color: #a020f0;">new</span> <span style="color: #228b22;">int</span>[]{1,2,3,4,5};     #&#21311;&#21517;&#25968;&#32452;
</pre>

<ul>
<li>使用a.length获取数组长度
</li>
</ul>

</div>

</div>

<div id="outline-container-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> Arrays重要方法</h4>
<div class="outline-text-4" id="text-1-8-2">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.Arrays

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#36820;&#22238;&#19982;a&#31867;&#22411;&#30456;&#21516;&#30340;&#25968;&#32452;,&#22914;&#26524;length&#20540;&#22823;&#20110;a.length,&#32467;&#26524;&#20026;0&#25110;false,</span>
<span style="color: #b22222;">&#22914;&#26524;length&#20540;&#23567;&#20110;a.length,&#25968;&#32452;&#20013;&#23558;&#21482;&#26377;&#21069;&#38754;length&#20010;&#25968;&#25454;&#20803;&#32032;&#30340;&#25335;&#36125;*/</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">type</span> <span style="color: #0000ff;">copyOf</span>(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">length</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#32467;&#26524;&#20026;a&#20013;[beg,end-1)&#30340;&#25335;&#36125;,&#22914;&#26524;end&#22823;&#20110;a.length,&#32467;&#26524;&#20026;0&#25110;false</span>
<span style="color: #a020f0;">static</span> type copyOf(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">beg</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">end</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25968;&#32452;&#30340;&#23383;&#31526;&#20018;&#34920;&#31034;,&#25324;&#21495;&#21253;&#22260;,&#36887;&#21495;&#20998;&#38548;</span>
<span style="color: #a020f0;">static</span> String toString(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#20248;&#21270;&#30340;&#24555;&#36895;&#25490;&#24207;&#31639;&#27861;&#23545;&#25968;&#32452;&#36827;&#34892;&#25490;&#24207;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> sort(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#20108;&#20998;&#25628;&#32034;&#31639;&#27861;&#26597;&#25214;&#20540;v</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> binarySearch(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">type</span> <span style="color: #a0522d;">v</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#20108;&#20998;&#25628;&#32034;&#31639;&#27861;&#26597;&#25214;&#20540;v</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> binarySearch(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">beg</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">end</span>, <span style="color: #228b22;">type</span> <span style="color: #a0522d;">v</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#25968;&#32452;&#25152;&#26377;&#20803;&#32032;&#35774;&#32622;&#20026;v</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> fill(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">type</span> <span style="color: #a0522d;">v</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#20004;&#20010;&#25968;&#32452;&#22823;&#23567;&#30456;&#21516;,&#19988;&#19979;&#26631;&#30456;&#21516;&#30340;&#20803;&#32032;&#37117;&#23545;&#24212;&#30456;&#31561;,&#36820;&#22238;true</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">boolean</span> equals(<span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">type</span>[] <span style="color: #a0522d;">b</span>)
</pre>

</div>

</div>

<div id="outline-container-1-8-3" class="outline-4">
<h4 id="sec-1-8-3"><span class="section-number-4">1.8.3</span> 多维数组</h4>
<div class="outline-text-4" id="text-1-8-3">




<pre class="src src-java"><span style="color: #228b22;">int</span>[][] <span style="color: #a0522d;">multiArray</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">int</span>[2][2];
<span style="color: #228b22;">int</span>[][] <span style="color: #a0522d;">multiArray</span> = {{1,2},{3,4}};
</pre>

<ul>
<li>java实际上没有多维数组,只有一维数组,多为数组被解释为"数组的数组"
</li>
<li>因此,可以方便地构造不规则数组
</li>
</ul>

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 对象与类</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 使用现有类</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> java.util.GregorianCalendar</h4>
<div class="outline-text-4" id="text-2-1-1">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">GregorianCalendar</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#26085;&#21382;&#23545;&#35937;,&#29992;&#26469;&#34920;&#31034;&#40664;&#35748;&#22320;&#21306;&#40664;&#35748;&#26102;&#21306;&#30340;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #0000ff;">GregorianCalendar</span>()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#32473;&#23450;&#30340;&#26085;&#26399;&#21644;&#26102;&#38388;&#26500;&#36896;&#19968;&#20010;Gregorian&#26085;&#21382;&#23545;&#35937;</span>
GregorianCalendar(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>)
GregorianCalendar(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">hour</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">minutes</span>,
                  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">seconds</span>)

<span style="color: #228b22;">int</span> get(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">field</span>)                     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#32473;&#23450;&#22495;&#30340;&#20540;,&#22914;Calendar.YEAR(MONTH)</span>
Date getTime()                         <span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#24471;&#36825;&#20010;&#26085;&#21382;&#23545;&#35937;&#24403;&#21069;&#20540;&#25152;&#34920;&#36798;&#30340;&#26102;&#38388;&#28857;</span>
<span style="color: #228b22;">int</span> getFirstDayOfWeek()                <span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#24471;&#24403;&#21069;&#29992;&#25143;&#25152;&#22312;&#22320;&#21306;&#19968;&#20010;&#26143;&#26399;&#20013;&#30340;&#31532;&#19968;&#22825;</span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">field</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">value</span>)         <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35774;&#32622;&#29305;&#23450;&#22495;&#30340;&#20540;</span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#26085;&#26399;&#22495;&#35774;&#20026;&#26032;&#20540;</span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">hour</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">minutes</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">seconds</span>)
<span style="color: #228b22;">void</span> setTime(<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">time</span>)                <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#26085;&#21382;&#35774;&#32622;&#20026;&#25351;&#23450;&#26102;&#38388;&#28857;</span>
<span style="color: #228b22;">void</span> add(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">field</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">amount</span>)        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23545;&#29305;&#23450;&#22495;&#36827;&#34892;&#22686;&#21152;&#21046;&#23450;&#25968;&#37327;&#30340;&#26102;&#38388;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#26085;&#26399;&#22495;&#21644;&#26102;&#38388;&#22495;&#35774;&#20026;&#26032;&#20540;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 用户自定义类</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">ClassName</span>{
    constructor1
    constructor2
    ...
    method1
    method2
    ...
    <span style="color: #228b22;">field1</span>
    <span style="color: #a0522d;">field2</span>
    ...
}
</pre>

<ul>
<li>可以认为java编译器内置了make功能,当java编译器发现a.java使用了b类时会查找b.class文件,如果没有找到,会自动搜索b.java并对其进行编译,如果b.java版本比已有的b.class新,java编译器会自动重新编译这个文件.
</li>
<li>在每一个方法中,关键字this表示隐式参数.
</li>
<li>为了封装实例域,应该提供三项内容:一个私有的实例域,一个公有的 <b>访问器</b>,一个公有的 <b>更改器</b>.
</li>
<li>一个方法可以访问所属类的 <b>所有对象</b> 的私有数据,即不仅可以访问所绑定对象的私有域,还可以访问其他对象的私有域.
</li>
<li>可以将实例域定义为final,在构造器执行之后,这个域的值被设置,并在后面的操作中不能在进行修改.
</li>
</ul>

</div>

</div>
