src/java核心技术.org
** 静态域与静态方法
使用static修饰符
+ 静态域:类的所有实例共享一个静态域,即使没有对象实例,静态域也存在,它属于类而不属于任何独立对象
+ 静态方法:可以认为静态方法是没有this参数的方法,因此静态方法不能操作对象,因此不能在静态方法中访问实例域.
+ 在以下两种情况下使用静态方法
  1. 一个方法不需要访问对象状态,所需参数都是通过显示参数提供
  2. 一个方法只需要访问类的静态域
+ 静态方法常用于factory方法,产生不同风格的格式对象.
** 方法参数
+ java程序设计语言总是采用值调用,即方法所得到的是参数值的一个拷贝
+ 方法参数公有两种类型:基本数据类型 对象引用
+ 一个方法不能修改一个基本数据类型的实参
#+BEGIN_SRC java
public static void tripleValue(double x){  //并不会改变参数的值
    x = 3*x;
}
#+END_SRC
+ 一个方法可以改变一个对象实参的状态
#+BEGIN_SRC java
public static void tripleSalary(Employee x){
    //x是Employee类型的对象,可以在方法中改变该对象的状态
    x.raiseSalary(200)
}
#+END_SRC
+ 一个方法不能实现让对象实参引用一个新对象
#+BEGIN_SRC java
public static void swap(Employee x, Employee y){  //实参所引用的对象并没有得到交换
    Employee tmp = x;
    x = y;
    y = tmp;
}
#+END_SRC
** 对象构造
*** 对象初始化步骤
1. 所有数据被初始化为默认值(0,false,null)
2. 按照在类声明中出现的顺序,依次执行所有[[域初始化][域初始化语句]]和[[初始化块][初始化块]]
3. 如果构造器第一行[[调用另一个构造器][调用了第二个构造器]],则执行第二个构造器主体
4. 执行这个[[构造器][构造器]]主体
*** 域初始化
可以在类定义中,直接将一个值赋给任何域
#+BEGIN_SRC java
class Employee{
    ...
    private String name = "";
}
#+END_SRC
*** 初始化块
在一个类声明中,可以包含多个代码块,只要构造类的对象,这些块就会被执行
#+BEGIN_SRC java
class Employee{
    constructor
    ...
    method
    ...
    {
        id = nextID;
        ...
    }
}
#+END_SRC
*** 构造器
+ 构造器可以重载,如果编译器找不到匹配的参数或找出多个可能的匹配,会产生编译时错误
+ 默认构造器是指没有参数的构造器,如果在类中没有编写构造器,系统会提供一个默认构造器,如果类中至少编写了一个构造器,系统就不会在提供默认构造器.
*** 调用另一个构造器
如果构造器的第一个语句形如this(...),这个构造器将调用同一个类的另一个构造器
#+BEGIN_SRC java
public Employee(double s){
    this("Employee #" + nextId, s);
    nextId++;
}
#+END_SRC
** 包
+ 一个类可以使用所属包中的所有类,以及其他包中的公有类
+ 访问另一个包中公有类的方式
  1. 在每个类名之前添加完整的包名
  2. 使用import语句导入一个特定的类或者整个包
#+BEGIN_SRC java
//在每个类名之前添加完整的包名
java.util.Date today = new java.util.Date();

//使用import语句导入整个包,注意只能使用*号导入一个包,不能同时导入多个包
import java.util.*;

//使用import语句导入一个特定的类
import java.util.Date;
#+END_SRC
+ 如果导入的两个或多个包中的类有名字冲突,会出现一个编译错误.有两种解决方式
  1. 增加一个特定的import语句来解决
  2. 在每个类名前加上完整包名
#+BEGIN_SRC java
import java.util.*;
import java.sql.*;      //都含有Date类,出现编译异常

解决1:
import java.util.*;
import java.sql.*;
import java.util.Date;  //增加一个特定的import语句来解决

解决2:
java.util.Date deadline = new java.util.Date();
java.sql.Date today = new java.sql.Date(..);   //在每个类名前加上完整包名
#+END_SRC
+ 可以通过静态导入来导入静态方法和静态域
#+BEGIN_SRC java
import static java.lang.System.out;
#+END_SRC
+ 想要将一个类放入包中,必须将包名放在源文件的开头,包中定义类的代码之前.
+ 将包中的文件放到与完整包名匹配的子目录中
#+BEGIN_SRC java
package com.horstmann.corejava;
...
#+END_SRC
+ 如果没有在源文件中放置package语句,这个源文件中的类就被放置在一个默认包中
+ 没有制定public或private的方法或者域可以被同一个包中的所有方法访问,称包作用域.
** 类路径
为了使类能够被多个程序共享,需要做到以下几点
1. 把类放到一个目录中
2. 把jar文件放到一个目录中
3. 设置类路径,类路径是所有包含类文件的路径的集合
   + 用-classpath指定类路径
   + 通过设置CLASSPATH环境变量指定类路径
#+BEGIN_SRC bash
java -classpath ... prog.java
export CLASSPATH=...:..:...
#+END_SRC

** 小结
实例域是实例拥有数据,静态域是类拥有的数据;所有方法都属于类:普通方法与特定实例绑定,并且由实例调用;静态方法不与任何实例绑定,可以由类或实例调用.
* 继承
** 类,超类和子类
#+BEGIN_SRC java
class Manager extends Employee{
    添加方法和域
}
#+END_SRC
+ extends表示正在构造的新类派生于一个已经存在的类,已存在的类称为超类,新类称为子类
+ 可以在子类中定义方法覆盖超类中的同名方法
+ 在子类中定义方法覆盖超类中的同名方法时,子类依然继承了超类中的同名方法,只是超类中的方法被子类中的方法覆盖了,若要访问超类中的同名方法,使用super.method()
+ 子类虽然继承了超类的私有域,但是子类的方法不能直接访问超类的私有域,只有超类的方法才能访问私有部分
+ 在子类构造器中调用超类的构造器super(...),使用super调用构造器的语句必须是子类构造器的第一条语句
+ 如果子类构造器没有显式调用超类的构造器,则将自动地调用超类默认构造器,如果超类没有不带参数的构造器且在在子类中没有显式调用超类的其他构造器,则java编译器将报错
*** 多态
+ 在java中,对象变量是多态的,一个Employee变量既可以引用一个Employee类对象,也可以引用一个Employee类的任何子类对象.
#+BEGIN_SRC java
Employee e;
e = new Employee(...);
e = new Manager(...);
#+END_SRC
+ 然而,不能将一个超类的引用赋给子类的变量
