html/java核心技术.html

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 静态域与静态方法</h3>
<div class="outline-text-3" id="text-2-3">

<p>使用static修饰符
</p><ul>
<li>静态域:类的所有实例共享一个静态域,即使没有对象实例,静态域也存在,它属于类而不属于任何独立对象
</li>
<li>静态方法:可以认为静态方法是没有this参数的方法,因此静态方法不能操作对象,因此不能在静态方法中访问实例域.
</li>
<li>在以下两种情况下使用静态方法
<ol>
<li>一个方法不需要访问对象状态,所需参数都是通过显示参数提供
</li>
<li>一个方法只需要访问类的静态域
</li>
</ol>

</li>
<li>静态方法常用于factory方法,产生不同风格的格式对象.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 方法参数</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>java程序设计语言总是采用值调用,即方法所得到的是参数值的一个拷贝
</li>
<li>方法参数公有两种类型:基本数据类型 对象引用
</li>
<li>一个方法不能修改一个基本数据类型的实参
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">tripleValue</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span>){  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#24182;&#19981;&#20250;&#25913;&#21464;&#21442;&#25968;&#30340;&#20540;</span>
    x = 3*x;
}
</pre>

<ul>
<li>一个方法可以改变一个对象实参的状态
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">tripleSalary</span>(<span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">x</span>){
    <span style="color: #b22222;">//</span><span style="color: #b22222;">x&#26159;Employee&#31867;&#22411;&#30340;&#23545;&#35937;,&#21487;&#20197;&#22312;&#26041;&#27861;&#20013;&#25913;&#21464;&#35813;&#23545;&#35937;&#30340;&#29366;&#24577;</span>
    x.raiseSalary(200)
}
</pre>

<ul>
<li>一个方法不能实现让对象实参引用一个新对象
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">swap</span>(<span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">x</span>, <span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">y</span>){  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23454;&#21442;&#25152;&#24341;&#29992;&#30340;&#23545;&#35937;&#24182;&#27809;&#26377;&#24471;&#21040;&#20132;&#25442;</span>
    <span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">tmp</span> = x;
    x = y;
    y = tmp;
}
</pre>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 对象构造</h3>
<div class="outline-text-3" id="text-2-5">


</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> 对象初始化步骤</h4>
<div class="outline-text-4" id="text-2-5-1">

<ol>
<li>所有数据被初始化为默认值(0,false,null)
</li>
<li>按照在类声明中出现的顺序,依次执行所有<a href="#sec-2-5-2">域初始化语句</a>和<a href="#sec-2-5-3">初始化块</a>
</li>
<li>如果构造器第一行<a href="#sec-2-5-5">调用了第二个构造器</a>,则执行第二个构造器主体
</li>
<li>执行这个<a href="#sec-2-5-4">构造器</a>主体
</li>
</ol>

</div>

</div>

<div id="outline-container-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> 域初始化</h4>
<div class="outline-text-4" id="text-2-5-2">

<p>可以在类定义中,直接将一个值赋给任何域
</p>


<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Employee</span>{
    ...
    <span style="color: #a020f0;">private</span> String name = <span style="color: #8b2252;">""</span>;
}
</pre>

</div>

</div>

<div id="outline-container-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> 初始化块</h4>
<div class="outline-text-4" id="text-2-5-3">

<p>在一个类声明中,可以包含多个代码块,只要构造类的对象,这些块就会被执行
</p>


<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Employee</span>{
    <span style="color: #228b22;">constructor</span>
    ...
    <span style="color: #a0522d;">method</span>
    ...
    {
        id = nextID;
        ...
    }
}
</pre>

</div>

</div>

<div id="outline-container-2-5-4" class="outline-4">
<h4 id="sec-2-5-4"><span class="section-number-4">2.5.4</span> 构造器</h4>
<div class="outline-text-4" id="text-2-5-4">

<ul>
<li>构造器可以重载,如果编译器找不到匹配的参数或找出多个可能的匹配,会产生编译时错误
</li>
<li>默认构造器是指没有参数的构造器,如果在类中没有编写构造器,系统会提供一个默认构造器,如果类中至少编写了一个构造器,系统就不会再提供默认构造器.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><span class="section-number-4">2.5.5</span> 调用另一个构造器</h4>
<div class="outline-text-4" id="text-2-5-5">

<p>如果构造器的第一个语句形如this(&hellip;),这个构造器将调用同一个类的另一个构造器
</p>


<pre class="src src-java"><span style="color: #a020f0;">public</span> Employee(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">s</span>){
    <span style="color: #a020f0;">this</span>(<span style="color: #8b2252;">"Employee #"</span> + nextId, s);
    nextId++;
}
</pre>

</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 包</h3>
<div class="outline-text-3" id="text-2-6">

<ul>
<li>一个类可以使用所属包中的所有类,以及其他包中的公有类
</li>
<li>访问另一个包中公有类的方式
<ol>
<li>在每个类名之前添加完整的包名
</li>
<li>使用import语句导入一个特定的类或者整个包
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#27599;&#20010;&#31867;&#21517;&#20043;&#21069;&#28155;&#21152;&#23436;&#25972;&#30340;&#21253;&#21517;</span>
<span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">today</span> = <span style="color: #a020f0;">new</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Date</span>();

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20351;&#29992;import&#35821;&#21477;&#23548;&#20837;&#25972;&#20010;&#21253;,&#27880;&#24847;&#21482;&#33021;&#20351;&#29992;*&#21495;&#23548;&#20837;&#19968;&#20010;&#21253;,&#19981;&#33021;&#21516;&#26102;&#23548;&#20837;&#22810;&#20010;&#21253;</span>
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.*;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20351;&#29992;import&#35821;&#21477;&#23548;&#20837;&#19968;&#20010;&#29305;&#23450;&#30340;&#31867;</span>
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Date</span>;
</pre>

<ul>
<li>如果导入的两个或多个包中的类有名字冲突,会出现一个编译错误.有两种解决方式
<ol>
<li>增加一个特定的import语句来解决
</li>
<li>在每个类名前加上完整包名
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.*;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">sql</span>.*;      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#37117;&#21547;&#26377;Date&#31867;,&#20986;&#29616;&#32534;&#35793;&#24322;&#24120;</span>

<span style="color: #008b8b;">&#35299;&#20915;1</span>:
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.*;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">sql</span>.*;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Date</span>;  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22686;&#21152;&#19968;&#20010;&#29305;&#23450;&#30340;import&#35821;&#21477;&#26469;&#35299;&#20915;</span>

<span style="color: #008b8b;">&#35299;&#20915;2</span>:
<span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">u</span><span style="color: #228b22;">til.Date</span> <span style="color: #a0522d;">deadline</span> = <span style="color: #a020f0;">new</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Date</span>();
<span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">sql</span>.<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">today</span> = <span style="color: #a020f0;">new</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">sql</span>.<span style="color: #228b22;">Date</span>(..);   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#27599;&#20010;&#31867;&#21517;&#21069;&#21152;&#19978;&#23436;&#25972;&#21253;&#21517;</span>
</pre>

<ul>
<li>可以通过静态导入来导入静态方法和静态域
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">import</span> <span style="color: #a020f0;">static</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.System.<span style="color: #228b22;">out</span>;
</pre>

<ul>
<li>想要将一个类放入包中,必须将包名放在源文件的开头,包中定义类的代码之前.
</li>
<li>将包中的文件放到与完整包名匹配的子目录中
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">package</span> com.horstmann.<span style="color: #008b8b;">corejava</span>;
...
</pre>

<ul>
<li>如果没有在源文件中放置package语句,这个源文件中的类就被放置在一个默认包中
</li>
<li>没有指定public或private的方法或者域可以被同一个包中的所有方法访问,称包作用域.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 类路径</h3>
<div class="outline-text-3" id="text-2-7">

<p>为了使类能够被多个程序共享,需要做到以下几点
</p><ol>
<li>把类放到一个目录中
</li>
<li>把jar文件放到一个目录中
</li>
<li>设置类路径,类路径是所有包含类文件的路径的集合
<ul>
<li>用-classpath指定类路径
</li>
<li>通过设置CLASSPATH环境变量指定类路径
</li>
</ul>

</li>
</ol>




<pre class="src src-bash">java -classpath ... prog.java
export CLASSPATH=...:..:...
</pre>


</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 小结</h3>
<div class="outline-text-3" id="text-2-8">

<p>实例域是实例拥有数据,静态域是类拥有的数据;所有方法都属于类:普通方法与特定实例绑定,并且由实例调用;静态方法不与任何实例绑定,可以由类或实例调用.
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 继承</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 类,超类和子类</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Manager</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Employee</span>{
    &#28155;&#21152;&#26041;&#27861;&#21644;&#22495;
}
</pre>

<ul>
<li>extends表示正在构造的新类派生于一个已经存在的类,已存在的类称为超类,新类称为子类
</li>
<li>可以在子类中定义方法覆盖超类中的同名方法
</li>
<li>在子类中定义方法覆盖超类中的同名方法时,子类依然继承了超类中的同名方法,只是超类中的方法被子类中的方法覆盖了,若要访问超类中的同名方法,使用super.method()
</li>
<li>子类虽然继承了超类的私有域,但是子类的方法不能直接访问超类的私有域,只有超类的方法才能访问私有部分
</li>
<li>在子类构造器中调用超类的构造器super(&hellip;),使用super调用构造器的语句必须是子类构造器的第一条语句
</li>
<li>如果子类构造器没有显式调用超类的构造器,则将自动地调用超类默认构造器,如果超类没有不带参数的构造器且在在子类中没有显式调用超类的其他构造器,则java编译器将报错
</li>
</ul>


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 多态</h4>
<div class="outline-text-4" id="text-3-1-1">

<ul>
<li>在java中,对象变量是多态的,一个Employee变量既可以引用一个Employee类对象,也可以引用一个Employee类的任何子类对象.
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">e</span>;
e = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Employee</span>(...);
e = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Manager</span>(...);
</pre>

<ul>
<li>然而,不能将一个超类的引用赋给子类的变量
</li>
</ul>

</div>

</div>
