src/java核心技术.org
*** 动态绑定
调用对象方法的执行过程
1. 编译器查看对象的 *声明类型* 和方法名
2. 编译器查看调用方法时提供的参数类型(重载解析)
3. 如果是private方法,static方法,final方法或构造器,编译器将可以确定调用哪个方法(静态绑定)
4. 如果调用的方法依赖于隐式参数的实际类型,在运行时实现动态绑定,虚拟机调用对象 *实际类型* 中的方法(如果实际类型中没有定义这个方法,将在其超类中寻找)
*** 阻止继承
+ 如果在定义类的时候使用了final修饰符,表明这个类是final类,该类不能被继承
+ 类中的方法也可以被声明为final,这样做,子类就不能覆盖这个方法
*** 强制类型转换
#+BEGIN_SRC java
Employee boss = new Manager(...);
Manager boss = (Manager)boss;
#+END_SRC
+ 强制类型转换的唯一原因是:在暂时护士对象的实际类型之后,使用对象的全部功能
+ 只能在继承层次内进行类型转换
+ 在将超类转换成子类之前,应该使用instanceof进行检查
+ 如果试图在继承链上进行向下的类型转换,并且"谎报"有关对象包含的内容,将产生ClassCastException异常
*** 抽象类
从某种角度看,祖先类更加通用,人们只将它作为派生其他类的积累,而不想作为想使用的特定的实例类
#+BEGIN_SRC java
abstract class Person{
    public abstract String getDescription();
}
#+END_SRC
+ 使用abstract关键字将一个方法变为抽象方法,就不需要实现这个方法了
+ 抽象方法充当着占位的角色,它们的具体实现在子类中.
+ 包含抽象方法的类本身必须被声明为抽象方法
+ 除了抽象方法,抽象类还可以包含具体数据和具体方法
+ 类即使不含有抽象方法,也可以将类声明为抽象类
+ 抽象类不能被实例化,但可以定义一个抽象类的对象变量,引用非抽象子类的对象
*** 受保护的访问
使用protected关键字声明的方法或域,对本包和所有子类可见
#+BEGIN_EXAMPLE
将超类Employee中的hireDay声明为protected,而不是私有的,Manager中的方法就可以直接访问它

不过,Manager类中的方法只能够访问Manager对象中的hireDay域,
而不能访问其他Employee对象中的这个域
#+END_EXAMPLE
java中用于控制可见性的4个访问修饰符:
1. 仅对本类可见 private
2. 对所有类可见 public
3. 对本包和所有子类可见 protected
4. 对本包可见 默认

** object 所有类的超类
#+BEGIN_SRC java
java.lang.Object

//返回包含对象信息的类对象
Class getClass()

/*比较两个对象是否相等,如果两个对象指向同一块存储区域,
方法返回true,否则返回flase,在自定义类中,应该覆盖这个*/
boolean equals(Object otherObject)

//返回描述该对象值的字符串,在自定义类中,应该覆盖这个方法
String toString()

/*创建一个对象的副本,java运行时将为新实例分配存储空间,
并将当前对象复制到这块存储区域中*/
Object clone()
#+END_SRC
#+BEGIN_SRC java
java.lang.Class

String getName()      //返回这个类的名字
Class getSuperclass() //以Class对象的形式返回这个类的超类信息
#+END_SRC
** 泛型数组列表
#+BEGIN_SRC java
java.util.ArrayList<T>

ArrayList<T>()                    //构造一个空数组列表
ArrayList<T>(int initialCapacity) //用指定容量构造一个空数组列表
boolean add(T obj)                //在数组列表的尾端添加一个元素,永远返回true
int size()                        //返回存储在数组列表中的当前元素数量
void trimToSize()                 //将数组列表的存储容量削减到当前尺寸
T get(int index)                  //获得指定位置的元素值
void add(int index, T obj)        //在指定位置插入元素
T remove(int index)               //删除一个元素,返回被删除的元素
void set(int index, T obj)
//设置数组列表指定位置的元素值,这个操作将覆盖这个位置原有的内容
void ensureCapacity(int capacity)
//确保数组列表在不重新分配存储空间的情况下就能保存给定数量的元

#+END_SRC
