html/java核心技术.html

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 动态绑定</h4>
<div class="outline-text-4" id="text-3-1-2">

<p>调用对象方法的执行过程
</p><ol>
<li>编译器查看对象的 <b>声明类型</b> 和方法名
</li>
<li>编译器查看调用方法时提供的参数类型(重载解析)
</li>
<li>如果是private方法,static方法,final方法或构造器,编译器将可以确定调用哪个方法(静态绑定)
</li>
<li>如果调用的方法依赖于隐式参数的实际类型,在运行时实现动态绑定,虚拟机调用对象 <b>实际类型</b> 中的方法(如果实际类型中没有定义这个方法,将在其超类中寻找)
</li>
</ol>

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> 阻止继承</h4>
<div class="outline-text-4" id="text-3-1-3">

<ul>
<li>如果在定义类的时候使用了final修饰符,表明这个类是final类,该类不能被继承
</li>
<li>类中的方法也可以被声明为final,这样做,子类就不能覆盖这个方法
</li>
</ul>

<ul>
<li id="sec-3-1-3-1">final用法总结<br/>
<ol>
<li>final+局部变量
<blockquote>

<p>表示常量   
</p>
</blockquote>


</li>
<li>final+实例域
<blockquote>

<p>在构造器执行之后,这个域的值被设置,并在后面的操作中不能在进行修改
</p>
</blockquote>


</li>
<li>final+方法
<blockquote>

<p>子类不能覆盖此方法
</p>
</blockquote>


</li>
<li>final+类
<blockquote>

<p>此类不能被继承
</p>
</blockquote>


</li>
</ol>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> 强制类型转换</h4>
<div class="outline-text-4" id="text-3-1-4">




<pre class="src src-java"><span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">boss</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Manager</span>(...);
<span style="color: #228b22;">Manager</span> <span style="color: #a0522d;">boss</span> = (<span style="color: #228b22;">Manager</span>)boss;
</pre>

<ul>
<li>强制类型转换的唯一原因是:在暂时忽视对象的实际类型之后,使用对象的全部功能
</li>
<li>只能在继承层次内进行类型转换
</li>
<li>在将超类转换成子类之前,应该使用instanceof进行检查
</li>
<li>如果试图在继承链上进行向下的类型转换,并且"谎报"有关对象包含的内容,将产生ClassCastException异常
</li>
</ul>

</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> 抽象类</h4>
<div class="outline-text-4" id="text-3-1-5">

<p>从某种角度看,祖先类更加通用,人们只将它作为派生其他类的积累,而不想作为想使用的特定的实例类
</p>


<pre class="src src-java"><span style="color: #a020f0;">abstract</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Person</span>{
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">abstract</span> <span style="color: #228b22;">String</span> <span style="color: #0000ff;">getDescription</span>();
}
</pre>

<ul>
<li>使用abstract关键字将一个方法变为抽象方法,就不需要实现这个方法了
</li>
<li>抽象方法充当着占位的角色,它们的具体实现在子类中.
</li>
<li>包含抽象方法的类本身必须被声明为抽象方法
</li>
<li>除了抽象方法,抽象类还可以包含具体数据和具体方法
</li>
<li>类即使不含有抽象方法,也可以将类声明为抽象类
</li>
<li>抽象类不能被实例化,但可以定义一个抽象类的对象变量,引用非抽象子类的对象
</li>
</ul>

</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> 受保护的访问</h4>
<div class="outline-text-4" id="text-3-1-6">

<p>使用protected关键字声明的方法或域,对本包和所有子类可见
</p>


<pre class="example">将超类Employee中的hireDay声明为protected,而不是私有的,Manager中的方法就可以直接访问它

不过,Manager类中的方法只能够访问Manager对象中的hireDay域,
而不能访问其他Employee对象中的这个域
</pre>

<ul>
<li id="sec-3-1-6-1">访问修饰符总结:<br/>
<ol>
<li>仅对本类可见 private
</li>
<li>对所有类可见 public
</li>
<li>对本包和所有子类可见 protected
</li>
<li>对本包可见 默认
</li>
</ol>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> object 所有类的超类</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Object

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21253;&#21547;&#23545;&#35937;&#20449;&#24687;&#30340;&#31867;&#23545;&#35937;</span>
<span style="color: #228b22;">Class</span> <span style="color: #0000ff;">getClass</span>()

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#27604;&#36739;&#20004;&#20010;&#23545;&#35937;&#26159;&#21542;&#30456;&#31561;,&#22914;&#26524;&#20004;&#20010;&#23545;&#35937;&#25351;&#21521;&#21516;&#19968;&#22359;&#23384;&#20648;&#21306;&#22495;,</span>
<span style="color: #b22222;">&#26041;&#27861;&#36820;&#22238;true,&#21542;&#21017;&#36820;&#22238;flase,&#22312;&#33258;&#23450;&#20041;&#31867;&#20013;,&#24212;&#35813;&#35206;&#30422;&#36825;&#20010;*/</span>
<span style="color: #228b22;">boolean</span> equals(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">otherObject</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25551;&#36848;&#35813;&#23545;&#35937;&#20540;&#30340;&#23383;&#31526;&#20018;,&#22312;&#33258;&#23450;&#20041;&#31867;&#20013;,&#24212;&#35813;&#35206;&#30422;&#36825;&#20010;&#26041;&#27861;</span>
String toString()

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#21019;&#24314;&#19968;&#20010;&#23545;&#35937;&#30340;&#21103;&#26412;,java&#36816;&#34892;&#26102;&#23558;&#20026;&#26032;&#23454;&#20363;&#20998;&#37197;&#23384;&#20648;&#31354;&#38388;,</span>
<span style="color: #b22222;">&#24182;&#23558;&#24403;&#21069;&#23545;&#35937;&#22797;&#21046;&#21040;&#36825;&#22359;&#23384;&#20648;&#21306;&#22495;&#20013;*/</span>
Object clone()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Class

<span style="color: #228b22;">String</span> <span style="color: #0000ff;">getName</span>()      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#31867;&#30340;&#21517;&#23383;</span>
Class getSuperclass() <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20197;Class&#23545;&#35937;&#30340;&#24418;&#24335;&#36820;&#22238;&#36825;&#20010;&#31867;&#30340;&#36229;&#31867;&#20449;&#24687;</span>
</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 泛型数组列表</h3>
<div class="outline-text-3" id="text-3-3">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.ArrayList&lt;T&gt;

ArrayList&lt;T&gt;()                    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#31354;&#25968;&#32452;&#21015;&#34920;</span>
ArrayList&lt;T&gt;(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#25351;&#23450;&#23481;&#37327;&#26500;&#36896;&#19968;&#20010;&#31354;&#25968;&#32452;&#21015;&#34920;</span>
<span style="color: #228b22;">boolean</span> add(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">obj</span>)                <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#25968;&#32452;&#21015;&#34920;&#30340;&#23614;&#31471;&#28155;&#21152;&#19968;&#20010;&#20803;&#32032;,&#27704;&#36828;&#36820;&#22238;true</span>
<span style="color: #228b22;">int</span> size()                        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23384;&#20648;&#22312;&#25968;&#32452;&#21015;&#34920;&#20013;&#30340;&#24403;&#21069;&#20803;&#32032;&#25968;&#37327;</span>
<span style="color: #228b22;">void</span> trimToSize()                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#25968;&#32452;&#21015;&#34920;&#30340;&#23384;&#20648;&#23481;&#37327;&#21066;&#20943;&#21040;&#24403;&#21069;&#23610;&#23544;</span>
T get(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>)                  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#24471;&#25351;&#23450;&#20301;&#32622;&#30340;&#20803;&#32032;&#20540;</span>
<span style="color: #228b22;">void</span> add(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">obj</span>)        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#25351;&#23450;&#20301;&#32622;&#25554;&#20837;&#20803;&#32032;</span>
T remove(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>)               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#19968;&#20010;&#20803;&#32032;,&#36820;&#22238;&#34987;&#21024;&#38500;&#30340;&#20803;&#32032;</span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">obj</span>)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35774;&#32622;&#25968;&#32452;&#21015;&#34920;&#25351;&#23450;&#20301;&#32622;&#30340;&#20803;&#32032;&#20540;,&#36825;&#20010;&#25805;&#20316;&#23558;&#35206;&#30422;&#36825;&#20010;&#20301;&#32622;&#21407;&#26377;&#30340;&#20869;&#23481;</span>
<span style="color: #228b22;">void</span> ensureCapacity(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">capacity</span>)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#30830;&#20445;&#25968;&#32452;&#21015;&#34920;&#22312;&#19981;&#37325;&#26032;&#20998;&#37197;&#23384;&#20648;&#31354;&#38388;&#30340;&#24773;&#20917;&#19979;&#23601;&#33021;&#20445;&#23384;&#32473;&#23450;&#25968;&#37327;&#30340;&#20803;</span>

</pre>

</div>

</div>
