src/java核心技术.org
** 对象包装器
+ 有时,需要将int这样的基本类型转换为对象,所有基本类型都有一个与之对应的类,通常这些类称为包装器.
+ 包装器在很多情况下可以自动打包,拆包
#+BEGIN_SRC java
list.add(3) 将自动变换成 list.add(new Integer(3))
int n = list.get(i) 将自动变换成 int n = list.get(i).intValue()

在算数表达式中也能够自动打包和拆包:
Integer n = 3;
n++;
#+END_SRC
#+BEGIN_SRC java
java.lang.Integer

int intValue()                              //回Integer对象的int值
static String toString(int i)               //返回数值i的十进制字符串表示
static String toString(int i,int radix)     //返回数值i的radix进制字符串表示
static int parseInt(String s)               //返回字符串s表示的整数值
static int parseInt(String s, int radix)    //返回字符串s表示的整数值
static Integer valueOf(String s)            //返回字符串s表示的整型数值对应的包装器对象
static Integer valueOf(String s, int radix) //返回字符串s表示的整型数值对应的包装器对象
#+END_SRC
** 参数数量可变的方法
#+BEGIN_SRC java
//定义:
public static double max(double... values){
    double largest = Double.MIN_VALUE;
    for (double v : values)
        if(v>largest)
            largest = v;
    return largest;
}
//调用:
double m = max(3.1,40.4,-5);

/*实际上,max接收的是一个values[]数组,其中保存着所有的参数
编译器需要对max的每次调用进行转换,将参数绑定的数组上,
此处是将new double[]{3.1,40.4,5}传递给max方法
相当于*/
double m = max(new double[]{3.1,40.4,5})
#+END_SRC
** 枚举类
#+BEGIN_SRC java
pubic enum Size {SMALL, MEDIUM, LARGE, EXTRA_LARGE};
#+END_SRC
实际上,这个声明定义的类型是一个类,它刚好有4个实例.
如果需要的话,可以在枚举类型中添加一些构造器,方法或域
#+BEGIN_SRC java
enum Size{
    SMALL("S"), MEDIUM("M"), LARGE("L"), EXTRA_LAREGE("XL");
    private Size(String abbreviation) {this.abbreviation = abbreviation;}
    public String getAbbreviation(){return abbreviation;}
    private String abbreviation;
}

String abbrev = Size.SMALL.getAbbreviation();
#+END_SRC
所有枚举类型都是Emnum类的子类
#+BEGIN_SRC java
java.lang.Enum

//返回枚举常量名
String toString()

//返回枚举常量在enum声明中的位置,从0开始计数
int ordinal()

//如果枚举常量出现在other之前,返回一个负值,若this==other,返回0,否则,返回正值
int compareTo(E other)

//返回指定名字,给定类的枚举常量
static Enum valueOf(Class enumClass, String name)
#+END_SRC
** 反射
能够分析类的能力的程序被称为反射
