html/java核心技术.html

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 对象包装器</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>有时,需要将int这样的基本类型转换为对象,所有基本类型都有一个与之对应的类,通常这些类称为包装器.
</li>
<li>包装器在很多情况下可以自动打包,拆包
</li>
</ul>




<pre class="src src-java">list.add(3) &#23558;&#33258;&#21160;&#21464;&#25442;&#25104; list.add(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Integer</span>(3))
<span style="color: #228b22;">int</span> n = list.get(i) &#23558;&#33258;&#21160;&#21464;&#25442;&#25104; <span style="color: #228b22;">int</span> n = list.get(i).intValue()

&#22312;&#31639;&#25968;&#34920;&#36798;&#24335;&#20013;&#20063;&#33021;&#22815;&#33258;&#21160;&#25171;&#21253;&#21644;&#25286;&#21253;:
Integer n = 3;
n++;
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Integer

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">intValue</span>()                              <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22238;Integer&#23545;&#35937;&#30340;int&#20540;</span>
<span style="color: #a020f0;">static</span> String toString(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>)               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25968;&#20540;i&#30340;&#21313;&#36827;&#21046;&#23383;&#31526;&#20018;&#34920;&#31034;</span>
<span style="color: #a020f0;">static</span> String toString(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>,<span style="color: #228b22;">int</span> <span style="color: #a0522d;">radix</span>)     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25968;&#20540;i&#30340;radix&#36827;&#21046;&#23383;&#31526;&#20018;&#34920;&#31034;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> parseInt(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>)               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23383;&#31526;&#20018;s&#34920;&#31034;&#30340;&#25972;&#25968;&#20540;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> parseInt(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">radix</span>)    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23383;&#31526;&#20018;s&#34920;&#31034;&#30340;&#25972;&#25968;&#20540;</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23383;&#31526;&#20018;s&#34920;&#31034;&#30340;&#25972;&#22411;&#25968;&#20540;&#23545;&#24212;&#30340;&#21253;&#35013;&#22120;&#23545;&#35937;</span>
<span style="color: #a020f0;">static</span> Integer valueOf(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23383;&#31526;&#20018;s&#34920;&#31034;&#30340;&#25972;&#22411;&#25968;&#20540;&#23545;&#24212;&#30340;&#21253;&#35013;&#22120;&#23545;&#35937;</span>
<span style="color: #a020f0;">static</span> Integer valueOf(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">radix</span>) 
</pre>

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 参数数量可变的方法</h3>
<div class="outline-text-3" id="text-3-5">




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;:</span>
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">double</span> <span style="color: #0000ff;">max</span>(<span style="color: #228b22;">double</span>... <span style="color: #a0522d;">values</span>){
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">largest</span> = <span style="color: #008b8b;">Double</span>.MIN_VALUE;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">double</span> <span style="color: #a0522d;">v</span> : values)
        <span style="color: #a020f0;">if</span>(v&gt;largest)
            largest = v;
    <span style="color: #a020f0;">return</span> largest;
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35843;&#29992;:</span>
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">m</span> = max(3.1,40.4,-5);

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#23454;&#38469;&#19978;,max&#25509;&#25910;&#30340;&#26159;&#19968;&#20010;values[]&#25968;&#32452;,&#20854;&#20013;&#20445;&#23384;&#30528;&#25152;&#26377;&#30340;&#21442;&#25968;</span>
<span style="color: #b22222;">&#32534;&#35793;&#22120;&#38656;&#35201;&#23545;max&#30340;&#27599;&#27425;&#35843;&#29992;&#36827;&#34892;&#36716;&#25442;,&#23558;&#21442;&#25968;&#32465;&#23450;&#30340;&#25968;&#32452;&#19978;,</span>
<span style="color: #b22222;">&#27492;&#22788;&#26159;&#23558;new double[]{3.1,40.4,5}&#20256;&#36882;&#32473;max&#26041;&#27861;</span>
<span style="color: #b22222;">&#30456;&#24403;&#20110;*/</span>
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">m</span> = max(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">double</span>[]{3.1,40.4,5})
</pre>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 枚举类</h3>
<div class="outline-text-3" id="text-3-6">




<pre class="src src-java"><span style="color: #228b22;">pubic</span> <span style="color: #a020f0;">enum</span> Size {<span style="color: #a0522d;">SMALL</span>, <span style="color: #a0522d;">MEDIUM</span>, <span style="color: #a0522d;">LARGE</span>, <span style="color: #a0522d;">EXTRA_LARGE</span>};
</pre>

<p>
实际上,这个声明定义的类型是一个类,它刚好有4个实例.
如果需要的话,可以在枚举类型中添加一些构造器,方法或域
</p>


<pre class="src src-java"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Size</span>{
    <span style="color: #a0522d;">SMALL</span>(<span style="color: #8b2252;">"S"</span>), <span style="color: #a0522d;">MEDIUM</span>(<span style="color: #8b2252;">"M"</span>), <span style="color: #a0522d;">LARGE</span>(<span style="color: #8b2252;">"L"</span>), <span style="color: #a0522d;">EXTRA_LAREGE</span>(<span style="color: #8b2252;">"XL"</span>);
    <span style="color: #a020f0;">private</span> Size(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">abbreviation</span>) {<span style="color: #a020f0;">this</span>.abbreviation = abbreviation;}
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">getAbbreviation</span>(){<span style="color: #a020f0;">return</span> abbreviation;}
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">abbreviation</span>;
}

<span style="color: #228b22;">String</span> <span style="color: #a0522d;">abbrev</span> = <span style="color: #008b8b;">Size</span>.SMALL.getAbbreviation();
</pre>

<p>
所有枚举类型都是Emnum类的子类
</p>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Enum

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26522;&#20030;&#24120;&#37327;&#21517;</span>
<span style="color: #228b22;">String</span> <span style="color: #0000ff;">toString</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26522;&#20030;&#24120;&#37327;&#22312;enum&#22768;&#26126;&#20013;&#30340;&#20301;&#32622;,&#20174;0&#24320;&#22987;&#35745;&#25968;</span>
<span style="color: #228b22;">int</span> ordinal()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#26522;&#20030;&#24120;&#37327;&#20986;&#29616;&#22312;other&#20043;&#21069;,&#36820;&#22238;&#19968;&#20010;&#36127;&#20540;,&#33509;this==other,&#36820;&#22238;0,&#21542;&#21017;,&#36820;&#22238;&#27491;&#20540;</span>
<span style="color: #228b22;">int</span> compareTo(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">other</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25351;&#23450;&#21517;&#23383;,&#32473;&#23450;&#31867;&#30340;&#26522;&#20030;&#24120;&#37327;</span>
<span style="color: #a020f0;">static</span> Enum valueOf(<span style="color: #228b22;">Class</span> <span style="color: #a0522d;">enumClass</span>, <span style="color: #228b22;">String</span> <span style="color: #a0522d;">name</span>)
</pre>

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 反射</h3>
<div class="outline-text-3" id="text-3-7">

<p>能够分析类的能力的程序被称为反射
</p>
</div>
