src/java核心技术.org
*** 利用反射分析类的能力
#+BEGIN_SRC java
java.lang.Class

static Class forName(String className)  //返回描述类名为className的Class对象        
Object newInstance()                    //返回这个类的新实例                        
Field[] getFields()                     //返回此类和超类的的公有域                  
Field[] getDeclaredFields()             //返回此类的全部域                          
Method[] getMethods()                   //返回所有公有方法,包括从超类继承来的公有方法
Method[] getDeclaredMethods()           //返回全部方法,但不包括从曹磊继承的方法     
Constructor[] getConstructors()         //返回此类的公有构造器                      
Constructor[] getDeclaredConstructors() //返回此类的所有构造器                      
#+END_SRC
#+BEGIN_SRC java
java.lang.reflect.Constructor(Method Field)

//构造一个这个构造器所属类的新实例
Object newInstance(Object[] args)

//返回构造器(方法 域名)的Class对象
Class getDeclaringClass()

//返回一个用于描述构造器(方法 域名)修饰符的整型数值
int getModifiers()

//返回描述构造器(方法 域名)的字符转
String getName()

//用在Constructor和Method类中,返回一个描述参数类型的Class对象数组
Class[] getParameterTypes()

//用在Method类中,返回一个用于描述返回类型的Class对象
Class getReturnType()
#+END_SRC
#+BEGIN_SRC java
java.lang.reflect.Modifier

static boolean isAbstract(int modifiers)
static boolean isFinal(int modifiers)   
...                                     
#+END_SRC
*** 在运行时使用反射分析对象
#+BEGIN_SRC java
java.lang.reflect.AccessibleObject

/*为反射对象设置可访问标志,flag为true表明屏蔽java语言的访问检查,
使得对象的私有属性也可以被查询和设置*/
void setAccessible(boolean flag)

//返回反射对象的可访问标志的值
boolean isAccessible()

//设置对象数组可访问标志的快捷方法
static void setAccessible(AccessibleObject[] array, boolean flag)
#+END_SRC
#+BEGIN_SRC java
java.lang.Class

Field getField(String name)         //返回指定名称的公有域
Field getDeclaredField(String name) //返回指定名称的域    
#+END_SRC
#+BEGIN_SRC java
java.lang.reflect.Field

Object get(Object obj)               //返回obj对象中Field对象表示的值            
void set(Object obj,Object newValue) //用newValue设置obj对象中用Field对象表示的域
#+END_SRC
* 接口与内部类
** 接口
java不允许多继承,因为多继承会让语言本身变得非常复杂,效率也会降低,java利用接口机制来实现多继承的大部分功能
#+BEGIN_SRC java
public interface Comparable{
    int compareTo(Object other);
}
#+END_SRC
+ 接口中的所有方法自动属于public,因此在接口中声明方法时,不必提供关键字public
+ 接口中不能含有实例域,静态方法,可以包含常量
+ 不能在接口中实现方法
+ 不能使用new实例化一个接口
+ 可以声明接口类型的变量,用于引用实现了接口的类对象
+ 接口可以继承
+ 每个类可以实现多个接口
** 对象克隆
+ 当拷贝一个变量时,原始变量与拷贝变量引用同一个对象(浅拷贝)
+ 如果原始对象与浅克隆对象共享的子对象是不可变的,将不会产生任何问题
+ clone方法是Object类的protected方法,用户在代码中无法直接调用,只有Employee类才能克隆Employee对象
+ 可以重新定义public访问修饰符的clone方法,并实现Cloneable接口
+ Cloneable接口是java提供的几个标记接口之一,标记接口中没有定义任何方法,使用它的唯一目的是可以用instanceof进行类型检查
** 接口与回调
+ 回调是一种常见的程序设计模式,可以指出某个特定事件发生时应该采取的动作(比如各种Listener)
+ 很多程序设计语言中通过提供一个函数表示要采取的动作,java是通过提供一个对象来表示要采取的动作
+ 由于对象可以携带附加信息,所以传递一个对象比传递一个函数灵活
+ 当然,程序需要知道调用对象的哪一个方法,因此通常所传递的对象需要实现某个特定的接口
** 内部类
使用内部类的主要原因
1. 内部类方法可以访问该类定义所在作用域中的数据,包括私有数据
2. 内部类可以对同一个包中的其他类隐藏起来
3. 想要定义一个回调函数又不想编写大量代码时,使用匿名内部类比较便捷
