html/java核心技术.html

<div id="outline-container-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> 利用反射分析类的能力</h4>
<div class="outline-text-4" id="text-3-7-1">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Class

<span style="color: #a020f0;">static</span> <span style="color: #228b22;">Class</span> <span style="color: #0000ff;">forName</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">className</span>)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25551;&#36848;&#31867;&#21517;&#20026;className&#30340;Class&#23545;&#35937;</span>
Object newInstance()                    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#31867;&#30340;&#26032;&#23454;&#20363;</span>
Field[] getFields()                     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#27492;&#31867;&#21644;&#36229;&#31867;&#30340;&#30340;&#20844;&#26377;&#22495;</span>
Field[] getDeclaredFields()             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#27492;&#31867;&#30340;&#20840;&#37096;&#22495;</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25152;&#26377;&#20844;&#26377;&#26041;&#27861;,&#21253;&#25324;&#20174;&#36229;&#31867;&#32487;&#25215;&#26469;&#30340;&#20844;&#26377;&#26041;&#27861;</span>
Method[] getMethods()                   
Method[] getDeclaredMethods()           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#20840;&#37096;&#26041;&#27861;,&#20294;&#19981;&#21253;&#25324;&#20174;&#36229;&#31867;&#32487;&#25215;&#30340;&#26041;&#27861;</span>
Constructor[] getConstructors()         <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#27492;&#31867;&#30340;&#20844;&#26377;&#26500;&#36896;&#22120;</span>
Constructor[] getDeclaredConstructors() <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#27492;&#31867;&#30340;&#25152;&#26377;&#26500;&#36896;&#22120;</span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.Constructor(<span style="color: #228b22;">Method</span> <span style="color: #a0522d;">Field</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#36825;&#20010;&#26500;&#36896;&#22120;&#25152;&#23646;&#31867;&#30340;&#26032;&#23454;&#20363;</span>
Object newInstance(<span style="color: #228b22;">Object</span>[] <span style="color: #a0522d;">args</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26500;&#36896;&#22120;(&#26041;&#27861; &#22495;&#21517;)&#30340;Class&#23545;&#35937;</span>
Class getDeclaringClass()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#29992;&#20110;&#25551;&#36848;&#26500;&#36896;&#22120;(&#26041;&#27861; &#22495;&#21517;)&#20462;&#39280;&#31526;&#30340;&#25972;&#22411;&#25968;&#20540;</span>
<span style="color: #228b22;">int</span> getModifiers()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25551;&#36848;&#26500;&#36896;&#22120;(&#26041;&#27861; &#22495;&#21517;)&#30340;&#23383;&#31526;&#20018;</span>
String getName()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#22312;Constructor&#21644;Method&#31867;&#20013;,&#36820;&#22238;&#19968;&#20010;&#25551;&#36848;&#21442;&#25968;&#31867;&#22411;&#30340;Class&#23545;&#35937;&#25968;&#32452;</span>
Class[] getParameterTypes()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#22312;Method&#31867;&#20013;,&#36820;&#22238;&#19968;&#20010;&#29992;&#20110;&#25551;&#36848;&#36820;&#22238;&#31867;&#22411;&#30340;Class&#23545;&#35937;</span>
Class getReturnType()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.Modifier

<span style="color: #a020f0;">static</span> <span style="color: #228b22;">boolean</span> <span style="color: #0000ff;">isAbstract</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">modifiers</span>)
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">boolean</span> isFinal(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">modifiers</span>)   
...                                     
</pre>

</div>

</div>

<div id="outline-container-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> 在运行时使用反射分析对象</h4>
<div class="outline-text-4" id="text-3-7-2">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.AccessibleObject

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#20026;&#21453;&#23556;&#23545;&#35937;&#35774;&#32622;&#21487;&#35775;&#38382;&#26631;&#24535;,flag&#20026;true&#34920;&#26126;&#23631;&#34109;java&#35821;&#35328;&#30340;&#35775;&#38382;&#26816;&#26597;,</span>
<span style="color: #b22222;">&#20351;&#24471;&#23545;&#35937;&#30340;&#31169;&#26377;&#23646;&#24615;&#20063;&#21487;&#20197;&#34987;&#26597;&#35810;&#21644;&#35774;&#32622;*/</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">setAccessible</span>(<span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">flag</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21453;&#23556;&#23545;&#35937;&#30340;&#21487;&#35775;&#38382;&#26631;&#24535;&#30340;&#20540;</span>
<span style="color: #228b22;">boolean</span> isAccessible()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35774;&#32622;&#23545;&#35937;&#25968;&#32452;&#21487;&#35775;&#38382;&#26631;&#24535;&#30340;&#24555;&#25463;&#26041;&#27861;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> setAccessible(<span style="color: #228b22;">AccessibleObject</span>[] <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">flag</span>)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Class

<span style="color: #228b22;">Field</span> <span style="color: #0000ff;">getField</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">name</span>)         <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25351;&#23450;&#21517;&#31216;&#30340;&#20844;&#26377;&#22495;</span>
Field getDeclaredField(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">name</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#25351;&#23450;&#21517;&#31216;&#30340;&#22495;    </span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.Field

<span style="color: #228b22;">Object</span> <span style="color: #0000ff;">get</span>(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">obj</span>)               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;obj&#23545;&#35937;&#20013;Field&#23545;&#35937;&#34920;&#31034;&#30340;&#20540;            </span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">obj</span>,<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">newValue</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;newValue&#35774;&#32622;obj&#23545;&#35937;&#20013;&#29992;Field&#23545;&#35937;&#34920;&#31034;&#30340;&#22495;</span>
</pre>

</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 接口与内部类</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 接口</h3>
<div class="outline-text-3" id="text-4-1">

<p>java不允许多继承,因为多继承会让语言本身变得非常复杂,效率也会降低,java利用接口机制来实现多继承的大部分功能
</p>


<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Comparable</span>{
    <span style="color: #228b22;">int</span> <span style="color: #0000ff;">compareTo</span>(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">other</span>);
}
</pre>

<ul>
<li>接口中的所有方法自动属于public,因此在接口中声明方法时,不必提供关键字public
</li>
<li>接口中不能含有实例域,静态方法,可以包含常量
</li>
<li>不能在接口中实现方法
</li>
<li>不能使用new实例化一个接口
</li>
<li>可以声明接口类型的变量,用于引用实现了接口的类对象
</li>
<li>接口可以继承
</li>
<li>每个类可以实现多个接口
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 对象克隆</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>当拷贝一个变量时,原始变量与拷贝变量引用同一个对象(浅拷贝)
</li>
<li>如果原始对象与浅克隆对象共享的子对象是不可变的,将不会产生任何问题
</li>
<li>clone方法是Object类的protected方法,用户在代码中无法直接调用,只有Employee类才能克隆Employee对象
</li>
<li>可以重新定义public访问修饰符的clone方法,并实现Cloneable接口
</li>
<li>Cloneable接口是java提供的几个标记接口之一,标记接口中没有定义任何方法,使用它的唯一目的是可以用instanceof进行类型检查
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 接口与回调</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>回调是一种常见的程序设计模式,可以指出某个特定事件发生时应该采取的动作(比如各种Listener)
</li>
<li>很多程序设计语言中通过提供一个函数表示要采取的动作,java是通过提供一个对象来表示要采取的动作
</li>
<li>由于对象可以携带附加信息,所以传递一个对象比传递一个函数灵活
</li>
<li>当然,程序需要知道调用对象的哪一个方法,因此通常所传递的对象需要实现某个特定的接口
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 内部类</h3>
<div class="outline-text-3" id="text-4-4">

<p>使用内部类的主要原因
</p><ol>
<li>内部类方法可以访问该类定义所在作用域中的数据,包括私有数据
</li>
<li>内部类可以对同一个包中的其他类隐藏起来
</li>
<li>想要定义一个回调函数又不想编写大量代码时,使用匿名内部类比较便捷
</li>
</ol>


</div>
