src/java核心技术.org
*** 内部类
#+BEGIN_SRC java
public class TalkingClock{
    public TalkingClock(int interval, boolean beep){..}

    private int interval;
    private int beep;

    public class TimePrinter implements ActionListener{...}  //内部类
}
#+END_SRC
+ 内部类既可以访问自身的数据域,也可以访问创建它的外围对象的数据域
+ 在内部类中使用OuterClass.this引用外围类
#+BEGIN_SRC java
if(beep) Toolkit.getDefaultToolkit().beep();
等价于
if(TalkingClock.this.beep) Toolkit.getDefaultToolkit().beep();
#+END_SRC
+ 在外部类中定义内部类的对象
#+BEGIN_SRC java
new TimePrinter();
等价于
this.new TimePrinter();
#+END_SRC
+ 在外部类的外部定义公有内部类的对象
#+BEGIN_SRC java
TalkingClock jabberer = new TalkingClock(1000,true);
TalkingClock.TimerPrinter listener = jabberer.new TimePrinter();
#+END_SRC
*** 局部内部类
+ 在一个局部的块(比如方法)中定义的内部类称局部内部类,局部内部类不能用public或private访问修饰符,块之外的方法不能访问到这个内部类
+ 局部内部类不仅可以访问外部类,还可以访问final局部变量
+ 由于局部变量在生命周期结束后会被销毁,因此内部类会建立一份局部变量的拷贝.为了使得局部变量和局部内部类中建立的拷贝保持一致,所以局部内部类可以访问的局部变量必须是final类型的
+ 如果需要在局部内部类中访问一个可变的局部变量,可以使用一个长度为1的final数组
*** 匿名内部类
#+BEGIN_SRC java
public void start(){
    ActionListener listener = new ActionListener(){
        ...
    }
    ...
}
#+END_SRC
+ 如果new后面跟的是接口的名字,其含义是创建一个实现该接口的类的对象
+ 如果new后面跟的是类的名字,其含义是创建一个继承了该类的派生类的对象
+ 由于构造器的名字必须与类名相同,而匿名类没有类名,所以匿名类没有构造器,构造器参数将传递给超类
*** 静态内部类
声明为static,静态内部类的对象除了不能访问外部类对象,与其他内部类完全一样
** 代理
#+BEGIN_SRC java
java.lang.reflect.InvocationHandler   //调用处理器

//定义了代理对象调用方法时希望执行的动作
Object invoke(Object proxy, Method method, Object[] args)
#+END_SRC
#+BEGIN_SRC java
java.lang.reflect.Proxy   //代理

//构造一个实现指定接口的代理类的实例,所有方法都将调用给定处理器对象的invoke方法
static Object getProxyInstance(ClassLoader loader, Class[] interfaces, 
                               InvocationHandler handler)

//返回实现指定接口的代理类
static Class getProxyClass(ClassLoader loader, Class[] interfaces)

//如果c是一个代理类,返回true
static boolean isProxyClass(Class c)
#+END_SRC
+ 首先获得代理对象,传入类加载器,接口的类,以及调用处理器
+ 由代理对象调用某方法时,会调用调用处理器的invoke方法,并向其传递Method对象和原始的调用参数,可以在invoke方法中实现调用前的预处理,调用,调用后的善后,即所谓的代理
+ 常见形式
#+BEGIN_SRC java
public interface I{...} //定义接口

public class C implements I{...} //定义实现接口的类,其对象需要被代理

public class MyProxy implements InvocationHandler{
    private Object target; 
    public Object bind(Object target){  //传入被代理的对象
        this.target = target;
        //生成代理对象
        proxy = Proxy.newProxyInstance(target.getClass().getClassLoader(), 
                target.getClass().getInterfaces(), this);
        return proxy;
    }

    public Object invoke(Object proxy, Method method, Object[] args) 
        throws Throwable
    {
        //在这里预处理
        Object result = method.invoke(target,args); //调用方法
        //在这里善后
        return result;
    }
}

MyProxy proxy = new MyProxy();  
I i = (I)proxy.bind(new C());
I.method();  //调用方法时,将调用调用处理器的invoke方法
#+END_SRC
* 异常,日志,断言和调试
** 处理异常
*** 异常结构
#+BEGIN_EXAMPLE
+ Throwable
  - Error
  - Exception
    + Runtime Exception
    + 其他异常
#+END_EXAMPLE
+ Error层次结构描述了java运行时系统的内部错误和资源耗尽错误
+ Exception层次结构中
  1. 由程序错误导致的异常属于RuntimeException 常见的RuntimeException异常:
     - 错误的类型转换
     - 数组访问越界
     - 访问空指针
  2. 程序本身没有问题,但由于像IO错误这类问题导致的异常属于其他异常 常见的其他异常:
     - 试图在文件尾部后读取数据
     - 试图打开一个错误的URL
+ 将派生于Error类或RuntimeException类的所有异常称为未检查异常
+ 将所有其他的异常称为已检查异常
