html/java核心技术.html

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> 内部类</h4>
<div class="outline-text-4" id="text-4-4-1">




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">TalkingClock</span>{
    <span style="color: #a020f0;">public</span> TalkingClock(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">interval</span>, <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">beep</span>){..}

    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">interval</span>;
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">beep</span>;

    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">TimePrinter</span> <span style="color: #a020f0;">implements</span> <span style="color: #228b22;">ActionListener</span>{...}  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20869;&#37096;&#31867;</span>
}
</pre>

<ul>
<li>内部类既可以访问自身的数据域,也可以访问创建它的外围对象的数据域
</li>
<li>在内部类中使用OuterClass.this引用外围类
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">if</span>(beep) Toolkit.getDefaultToolkit().beep();
&#31561;&#20215;&#20110;
<span style="color: #a020f0;">if</span>(TalkingClock.<span style="color: #a020f0;">this</span>.beep) Toolkit.getDefaultToolkit().beep();
</pre>

<ul>
<li>在外部类中定义内部类的对象
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">new</span> <span style="color: #228b22;">TimePrinter</span>();
&#31561;&#20215;&#20110;
<span style="color: #a020f0;">this</span>.<span style="color: #a020f0;">new</span> <span style="color: #228b22;">TimePrinter</span>();
</pre>

<ul>
<li>在外部类的外部定义公有内部类的对象
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">TalkingClock</span> <span style="color: #a0522d;">jabberer</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">TalkingClock</span>(1000,<span style="color: #008b8b;">true</span>);
<span style="color: #008b8b;">TalkingClock</span>.<span style="color: #228b22;">TimerPrinter</span> <span style="color: #a0522d;">listener</span> = jabberer.<span style="color: #a020f0;">new</span> <span style="color: #228b22;">TimePrinter</span>();
</pre>

</div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 局部内部类</h4>
<div class="outline-text-4" id="text-4-4-2">

<ul>
<li>在一个局部的块(比如方法)中定义的内部类称局部内部类,局部内部类不能用public或private访问修饰符,块之外的方法不能访问到这个内部类
</li>
<li>局部内部类不仅可以访问外部类,还可以访问final局部变量
</li>
<li>由于局部变量在生命周期结束后会被销毁,因此内部类会建立一份局部变量的拷贝.为了使得局部变量和局部内部类中建立的拷贝保持一致,所以局部内部类可以访问的局部变量必须是final类型的
</li>
<li>如果需要在局部内部类中访问一个可变的局部变量,可以使用一个长度为1的final数组
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> 匿名内部类</h4>
<div class="outline-text-4" id="text-4-4-3">




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">start</span>(){
    <span style="color: #228b22;">ActionListener</span> <span style="color: #a0522d;">listener</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ActionListener</span>(){
        ...
    }
    ...
}
</pre>

<ul>
<li>如果new后面跟的是接口的名字,其含义是创建一个实现该接口的类的对象
</li>
<li>如果new后面跟的是类的名字,其含义是创建一个继承了该类的派生类的对象
</li>
<li>由于构造器的名字必须与类名相同,而匿名类没有类名,所以匿名类没有构造器,构造器参数将传递给超类
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> 静态内部类</h4>
<div class="outline-text-4" id="text-4-4-4">

<p>声明为static,静态内部类的对象除了不能访问外部类对象,与其他内部类完全一样
</p><ul>
<li id="sec-4-4-4-1">static用法总结<br/>
<ol>
<li>static+域
<blockquote>

<p>静态域.该域只有一份拷贝,所有实例共享.
</p>
</blockquote>


</li>
<li>static+方法
<blockquote>

<p>静态方法.该方法不与实例绑定,通过类名或实例来调用.
</p>
</blockquote>


</li>
<li>static+内部类
<blockquote>

<p>静态内部类.静态内部类的方法不能访问外部类.
</p>
</blockquote>


</li>
</ol>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 代理</h3>
<div class="outline-text-3" id="text-4-5">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.InvocationHandler   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35843;&#29992;&#22788;&#29702;&#22120;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;&#20102;&#20195;&#29702;&#23545;&#35937;&#35843;&#29992;&#26041;&#27861;&#26102;&#24076;&#26395;&#25191;&#34892;&#30340;&#21160;&#20316;</span>
<span style="color: #228b22;">Object</span> <span style="color: #0000ff;">invoke</span>(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">proxy</span>, <span style="color: #228b22;">Method</span> <span style="color: #a0522d;">method</span>, <span style="color: #228b22;">Object</span>[] <span style="color: #a0522d;">args</span>)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.<span style="color: #008b8b;">reflect</span>.Proxy   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20195;&#29702;</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#23454;&#29616;&#25351;&#23450;&#25509;&#21475;&#30340;&#20195;&#29702;&#31867;&#30340;&#23454;&#20363;,&#25152;&#26377;&#26041;&#27861;&#37117;&#23558;&#35843;&#29992;&#32473;&#23450;&#22788;&#29702;&#22120;&#23545;&#35937;&#30340;invoke&#26041;&#27861;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">Object</span> <span style="color: #0000ff;">getProxyInstance</span>(<span style="color: #228b22;">ClassLoader</span> <span style="color: #a0522d;">loader</span>, <span style="color: #228b22;">Class</span>[] <span style="color: #a0522d;">interfaces</span>, 
                               <span style="color: #228b22;">InvocationHandler</span> <span style="color: #a0522d;">handler</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#23454;&#29616;&#25351;&#23450;&#25509;&#21475;&#30340;&#20195;&#29702;&#31867;</span>
<span style="color: #a020f0;">static</span> Class getProxyClass(<span style="color: #228b22;">ClassLoader</span> <span style="color: #a0522d;">loader</span>, <span style="color: #228b22;">Class</span>[] <span style="color: #a0522d;">interfaces</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;c&#26159;&#19968;&#20010;&#20195;&#29702;&#31867;,&#36820;&#22238;true</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">boolean</span> isProxyClass(<span style="color: #228b22;">Class</span> <span style="color: #a0522d;">c</span>)
</pre>

<ul>
<li>首先获得代理对象,传入类加载器,接口的类,以及调用处理器
</li>
<li>由代理对象调用某方法时,会调用调用处理器的invoke方法,并向其传递Method对象和原始的调用参数,可以在invoke方法中实现调用前的预处理,调用,调用后的善后,即所谓的代理
</li>
<li>常见形式
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">I</span>{...} <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;&#25509;&#21475;</span>

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span> <span style="color: #a020f0;">implements</span> <span style="color: #228b22;">I</span>{...} <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23450;&#20041;&#23454;&#29616;&#25509;&#21475;&#30340;&#31867;,&#20854;&#23545;&#35937;&#38656;&#35201;&#34987;&#20195;&#29702;</span>

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyProxy</span> <span style="color: #a020f0;">implements</span> <span style="color: #228b22;">InvocationHandler</span>{
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">Object</span> <span style="color: #a0522d;">target</span>; 
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Object</span> <span style="color: #0000ff;">bind</span>(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">target</span>){  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20256;&#20837;&#34987;&#20195;&#29702;&#30340;&#23545;&#35937;</span>
        <span style="color: #a020f0;">this</span>.target = target;
        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29983;&#25104;&#20195;&#29702;&#23545;&#35937;</span>
        proxy = Proxy.newProxyInstance(target.getClass().getClassLoader(), 
                target.getClass().getInterfaces(), <span style="color: #a020f0;">this</span>);
        <span style="color: #a020f0;">return</span> proxy;
    }

    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Object</span> <span style="color: #0000ff;">invoke</span>(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">proxy</span>, <span style="color: #228b22;">Method</span> <span style="color: #a0522d;">method</span>, <span style="color: #228b22;">Object</span>[] <span style="color: #a0522d;">args</span>) 
        <span style="color: #a020f0;">throws</span> <span style="color: #228b22;">Throwable</span>
    {
        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#36825;&#37324;&#39044;&#22788;&#29702;</span>
        <span style="color: #228b22;">Object</span> <span style="color: #a0522d;">result</span> = method.invoke(target,args); <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35843;&#29992;&#26041;&#27861;</span>
        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#36825;&#37324;&#21892;&#21518;</span>
        <span style="color: #a020f0;">return</span> result;
    }
}

<span style="color: #228b22;">MyProxy</span> <span style="color: #a0522d;">proxy</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">MyProxy</span>();  
<span style="color: #228b22;">I</span> <span style="color: #a0522d;">i</span> = (<span style="color: #228b22;">I</span>)proxy.bind(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">C</span>());
I.method();  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35843;&#29992;&#26041;&#27861;&#26102;,&#23558;&#35843;&#29992;&#35843;&#29992;&#22788;&#29702;&#22120;&#30340;invoke&#26041;&#27861;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 异常,日志,断言和调试</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 处理异常</h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> 异常结构</h4>
<div class="outline-text-4" id="text-5-1-1">




<pre class="example">+ Throwable
  - Error
  - Exception
    + Runtime Exception
    + 其他异常
</pre>

<ul>
<li>Error层次结构描述了java运行时系统的内部错误和资源耗尽错误
</li>
<li>Exception层次结构中
<ol>
<li>由程序错误导致的异常属于RuntimeException 常见的RuntimeException异常:
<ul>
<li>错误的类型转换
</li>
<li>数组访问越界
</li>
<li>访问空指针
</li>
</ul>

</li>
<li>程序本身没有问题,但由于像IO错误这类问题导致的异常属于其他异常 常见的其他异常:
<ul>
<li>试图在文件尾部后读取数据
</li>
<li>试图打开一个错误的URL
</li>
</ul>

</li>
</ol>

</li>
<li>将派生于Error类或RuntimeException类的所有异常称为未检查异常
</li>
<li>将所有其他的异常称为已检查异常
</li>
</ul>

</div>

</div>
