src/java核心技术.org
*** 声明已检查异常
+ 方法应该在其首部声明所有可能抛出的异常
#+BEGIN_SRC java
public Image loadImage(String s) throws IOException,MalformURLException
{
    ...
}
#+END_SRC
+ 需要声明异常的情况
  1. 调用一个抛出已检查异常的方法
  2. 程序运行时发现错误,且利用throw语句抛出一个已检查异常
+ 总之,一个方法必须声明所有可能抛出的已检查异常,而未检查异常要么不可控制,要么就应该避免发生.
+ 如果方法没有声明所有可能发生的已检查异常,编译器就会给出一个错误消息
*** 抛出异常
+ 对于已存在的异常类
  1. 找到一个合适的异常类
  2. 创建这个类的一个对象
  3. 将对象抛出
#+BEGIN_SRC java
throw new EOFException();
//或
EOFException e = new EOFException();
throw e;

//如
while(...){
    if(!in.hasNext()){
        if(n<len)
            throw new EOFException();
    }
}
#+END_SRC
+ 如果任何标准异常类都没有充分描述清除问题,需要创建自己的异常类,定义一个派生于Exception或派生于Exception子类的类.习惯上,定义的类应该包含两个构造器,一个默认构造器,一个带有详细描述信息的构造器
*** 捕获异常
#+BEGIN_SRC java
try{
    //需要执行的代码
}
catch(Exception1 e1){
    //对Exception1的处理
}
catch(Exception2 e2){
    //对Exception2的处理
}
...
finally{
    //不管是否有异常被捕获,这里的代码都会被执行
}
#+END_SRC
+ 如果在try语句块中的代码抛出了一个在catch子句中说明的异常类,那么
  1. 程序将跳过try语句块的其余代码
  2. 程序将执行catch子句中的处理器代码
+ 如果在try语句块中的代码没有抛出异常,那么程序将跳过catch子句
+ 如果方法中任何代码抛出了一个在catch子句中没有声明的异常类型,这个方法就会立刻退出
+ 强烈建议独立使用try/catch和try/finally语句块,内层的try语句确保善后工作,外层的try语句确保报告错误
#+BEGIN_SRC java
try{
    try{
        ...
    }
    finally{
        in.close();
    }
}
catch(IOException e){
    ...
}
#+END_SRC
*** 分析堆栈跟踪(stack trace)元素
+ 可以调用Throwable类的printStackTrace方法访问堆栈跟踪的文本描述信息
+ 可以调用getStackTrace方法获得一个StackTraceElement对象的数组,并在程序中进行分析
#+BEGIN_SRC java
Throwable t = new Throwable();
StackTraceElement[] frames = t.getStackTrace();
for(StackTraceElement frame:frames){
    ...
}
#+END_SRC
#+BEGIN_SRC java
java.lang.StackTraceElement

String getFileName()     //返回源文件名                                    
int getLineNumber()      //返回这个元素运行时对应的源文件行数              
String getClassName()    //返回这个元素运行时对应的类的全名                
String getMethodName()   //返回这个元素运行时对应的方法名                  
boolean isNativeMethod() //如果这个元素运行时在一个本地方法中,返回true     
String toString()        //返回一个包含类名,方法名,文件名和行数的格式化字符
#+END_SRC
** 断言
+ 断言机制允许在测试期间向代码中插入一些检查语句,当代码发布时,这些检查语句将被自动地移走
#+BEGIN_SRC java
assert x>= 0;
#+END_SRC
+ 对条件进行检测,如果结果为false,则抛出AssertionError异常
+ 默认情况下,断言被禁用.可以在运行程序时使用-enableassertions或-ea选项启用
#+BEGIN_SRC bash
java -enableassertions MyApp
#可以在某个类或者包中使用断言
java -ea:MyClass -ea:com.mycompany.mylib ... MyApp
#可以用-disableassertions或-da禁用某个特定类和包的断言
java -ea:... -da:MyClasss MyApp
#+END_SRC
+ 在启用或禁用断言时不必重新编译程序
** 记录日志
*** 日志记录器
+ 创建日志记录器
#+BEGIN_SRC java
Logger mylogger = Logger.getLogger("com.mycompany.myapp");
#+END_SRC
+ 通常,有以下7个日志记录器级别
  1. SEVERE
  2. WARNING
  3. INFO
  4. CONFIG
  5. FINE
  6. FINER
  7. FINEST
+ 默认情况下,只记录前三个级别,可以设置其他的级别
#+BEGIN_SRC java
logger.setLevel(Level.FINE);  //开启FINE和更高级别的记录
logger.setLevel(Level.ALL)    //开启所有级别的记录
logger.setLevel(Level.OFF)    //关闭所有级别的记录
#+END_SRC
+ 记录日志
#+BEGIN_SRC java
logger.warning(message);
logger.log(Level.FINE,message);
#+END_SRC
+ 默认日志记录将显示类名,方法名
*** 修改日志管理器配置
+ 配置文件存在于jre/lib/logging.properties
+ 要想使用另一个配置文件,使用下列命令
#+BEGIN_SRC bash
java -Djava.util.logging.config.file=configFile MainClass
#+END_SRC
*** 处理器
+ 与日志记录器一样,处理器也有日志记录级别,对于一条要被记录的日志,它的日志级别必须高于日志记录器和处理器的阈值
+ 在默认情况下,日志记录其将记录发送到自己的处理器和父处理器.如果不想两次看到这些记录,应该将useParentHandlers属性设为false
#+BEGIN_SRC java
logger.setUseParentHandlers(false);
Handler handler = new ConsoleHandler();
handler.setLevel(Level.FINE);
logger.addHandler(handler);
#+END_SRC
+ 可以通过扩展Handler类或StreamHandler类自定义处理器
*** 过滤器
+ 默认情况下,过滤器根据日志级别进行过滤,每个日志记录器和处理器都可以有一个可选的过滤器来完成附加的过滤
+ 想要将一个过滤器安装到一个日志记录器或处理器中,只要调用setFilter方法
+ 每个日志记录器和处理器同一时刻最多只能有一个过滤器
+ 可以通过实现Filter接口自定义过滤器
*** 格式化器
+ ConsoleHandler类和FileHandler类可以生成文本和XML格式的日志记录
+ 可以自定义格式,需要扩展Formatter类并覆盖String format(LogRecord record)方法
+ 调用setFormatter方法就爱那个格式化器安装到处理器中
* 泛型程序设计
+ 泛型程序设计意味着编写的代码可以被很多不同类型的对象所重用
+ 在泛型出现之前,使用Object变量,对具体类型进行操作时需要进行强制类型转换,且没有类型错误检查
+ 泛型使用类型参数来指示元素的类型,编译器可以很好地利用这个参数,get的时候不需要进行强制类型转换,add的时候可以进行类型检查,避免插入错误类型的对象
+ 类型参数使得程序具有更好的可读性和安全性
