html/java核心技术.html

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> 声明已检查异常</h4>
<div class="outline-text-4" id="text-5-1-2">

<ul>
<li>方法应该在其首部声明所有可能抛出的异常
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #228b22;">Image</span> <span style="color: #0000ff;">loadImage</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>) <span style="color: #a020f0;">throws</span> <span style="color: #228b22;">IOException</span>,<span style="color: #228b22;">MalformURLException</span>
{
    ...
}
</pre>

<ul>
<li>需要声明异常的情况
<ol>
<li>调用一个抛出已检查异常的方法
</li>
<li>程序运行时发现错误,且利用throw语句抛出一个已检查异常
</li>
</ol>

</li>
<li>总之,一个方法必须声明所有可能抛出的已检查异常,而未检查异常要么不可控制,要么就应该避免发生.
</li>
<li>如果方法没有声明所有可能发生的已检查异常,编译器就会给出一个错误消息
</li>
</ul>

</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> 抛出异常</h4>
<div class="outline-text-4" id="text-5-1-3">

<ul>
<li>对于已存在的异常类
<ol>
<li>找到一个合适的异常类
</li>
<li>创建这个类的一个对象
</li>
<li>将对象抛出
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">throw</span> <span style="color: #a020f0;">new</span> <span style="color: #228b22;">EOFException</span>();
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25110;</span>
<span style="color: #228b22;">EOFException</span> <span style="color: #a0522d;">e</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">EOFException</span>();
<span style="color: #a020f0;">throw</span> e;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;</span>
<span style="color: #a020f0;">while</span>(...){
    <span style="color: #a020f0;">if</span>(!in.hasNext()){
        <span style="color: #a020f0;">if</span>(n&lt;len)
            <span style="color: #a020f0;">throw</span> <span style="color: #a020f0;">new</span> <span style="color: #228b22;">EOFException</span>();
    }
}
</pre>

<ul>
<li>如果任何标准异常类都没有充分描述清除问题,需要创建自己的异常类,定义一个派生于Exception或派生于Exception子类的类.习惯上,定义的类应该包含两个构造器,一个默认构造器,一个带有详细描述信息的构造器
</li>
</ul>

</div>

</div>

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> 捕获异常</h4>
<div class="outline-text-4" id="text-5-1-4">




<pre class="src src-java"><span style="color: #a020f0;">try</span>{
    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38656;&#35201;&#25191;&#34892;&#30340;&#20195;&#30721;</span>
}
<span style="color: #a020f0;">catch</span>(<span style="color: #228b22;">Exception1</span> <span style="color: #a0522d;">e1</span>){
    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23545;Exception1&#30340;&#22788;&#29702;</span>
}
<span style="color: #a020f0;">catch</span>(<span style="color: #228b22;">Exception2</span> <span style="color: #a0522d;">e2</span>){
    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23545;Exception2&#30340;&#22788;&#29702;</span>
}
...
<span style="color: #a020f0;">finally</span>{
    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#19981;&#31649;&#26159;&#21542;&#26377;&#24322;&#24120;&#34987;&#25429;&#33719;,&#36825;&#37324;&#30340;&#20195;&#30721;&#37117;&#20250;&#34987;&#25191;&#34892;</span>
}
</pre>

<ul>
<li>如果在try语句块中的代码抛出了一个在catch子句中说明的异常类,那么
<ol>
<li>程序将跳过try语句块的其余代码
</li>
<li>程序将执行catch子句中的处理器代码
</li>
</ol>

</li>
<li>如果在try语句块中的代码没有抛出异常,那么程序将跳过catch子句
</li>
<li>如果方法中任何代码抛出了一个在catch子句中没有声明的异常类型,这个方法就会立刻退出
</li>
<li>强烈建议独立使用try/catch和try/finally语句块,内层的try语句确保善后工作,外层的try语句确保报告错误
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">try</span>{
    <span style="color: #a020f0;">try</span>{
        ...
    }
    <span style="color: #a020f0;">finally</span>{
        in.close();
    }
}
<span style="color: #a020f0;">catch</span>(<span style="color: #228b22;">IOException</span> <span style="color: #a0522d;">e</span>){
    ...
}
</pre>

</div>

</div>

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="section-number-4">5.1.5</span> 分析堆栈跟踪(stack trace)元素</h4>
<div class="outline-text-4" id="text-5-1-5">

<ul>
<li>可以调用Throwable类的printStackTrace方法访问堆栈跟踪的文本描述信息
</li>
<li>可以调用getStackTrace方法获得一个StackTraceElement对象的数组,并在程序中进行分析
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">Throwable</span> <span style="color: #a0522d;">t</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Throwable</span>();
<span style="color: #228b22;">StackTraceElement</span>[] <span style="color: #a0522d;">frames</span> = t.getStackTrace();
<span style="color: #a020f0;">for</span>(<span style="color: #228b22;">StackTraceElement</span> <span style="color: #a0522d;">frame</span>:frames){
    ...
}
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.StackTraceElement

<span style="color: #228b22;">String</span> <span style="color: #0000ff;">getFileName</span>()     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#28304;&#25991;&#20214;&#21517;                                    </span>
<span style="color: #228b22;">int</span> getLineNumber()      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#20803;&#32032;&#36816;&#34892;&#26102;&#23545;&#24212;&#30340;&#28304;&#25991;&#20214;&#34892;&#25968;              </span>
String getClassName()    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#20803;&#32032;&#36816;&#34892;&#26102;&#23545;&#24212;&#30340;&#31867;&#30340;&#20840;&#21517;                </span>
String getMethodName()   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#20803;&#32032;&#36816;&#34892;&#26102;&#23545;&#24212;&#30340;&#26041;&#27861;&#21517;                  </span>
<span style="color: #228b22;">boolean</span> isNativeMethod() <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#36825;&#20010;&#20803;&#32032;&#36816;&#34892;&#26102;&#22312;&#19968;&#20010;&#26412;&#22320;&#26041;&#27861;&#20013;,&#36820;&#22238;true     </span>
String toString()        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#21253;&#21547;&#31867;&#21517;,&#26041;&#27861;&#21517;,&#25991;&#20214;&#21517;&#21644;&#34892;&#25968;&#30340;&#26684;&#24335;&#21270;&#23383;&#31526;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 断言</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>断言机制允许在测试期间向代码中插入一些检查语句,当代码发布时,这些检查语句将被自动地移走
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">assert</span> <span style="color: #a0522d;">x</span>&gt;= 0;
</pre>

<ul>
<li>对条件进行检测,如果结果为false,则抛出AssertionError异常
</li>
<li>默认情况下,断言被禁用.可以在运行程序时使用-enableassertions或-ea选项启用
</li>
</ul>




<pre class="src src-bash">java -enableassertions MyApp
#&#21487;&#20197;&#22312;&#26576;&#20010;&#31867;&#25110;&#32773;&#21253;&#20013;&#20351;&#29992;&#26029;&#35328;
java -ea:MyClass -ea:com.mycompany.mylib ... MyApp
#&#21487;&#20197;&#29992;-disableassertions&#25110;-da&#31105;&#29992;&#26576;&#20010;&#29305;&#23450;&#31867;&#21644;&#21253;&#30340;&#26029;&#35328;
java -ea:... -da:MyClasss MyApp
</pre>

<ul>
<li>在启用或禁用断言时不必重新编译程序
</li>
</ul>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 记录日志</h3>
<div class="outline-text-3" id="text-5-3">


</div>

<div id="outline-container-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> 日志记录器</h4>
<div class="outline-text-4" id="text-5-3-1">

<ul>
<li>创建日志记录器
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">Logger</span> <span style="color: #a0522d;">mylogger</span> = Logger.getLogger(<span style="color: #8b2252;">"com.mycompany.myapp"</span>);
</pre>

<ul>
<li>通常,有以下7个日志记录器级别
<ol>
<li>SEVERE
</li>
<li>WARNING
</li>
<li>INFO
</li>
<li>CONFIG
</li>
<li>FINE
</li>
<li>FINER
</li>
<li>FINEST
</li>
</ol>

</li>
<li>默认情况下,只记录前三个级别,可以设置其他的级别
</li>
</ul>




<pre class="src src-java">logger.setLevel(<span style="color: #008b8b;">Level</span>.FINE);  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#24320;&#21551;FINE&#21644;&#26356;&#39640;&#32423;&#21035;&#30340;&#35760;&#24405;</span>
logger.setLevel(<span style="color: #008b8b;">Level</span>.ALL)    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#24320;&#21551;&#25152;&#26377;&#32423;&#21035;&#30340;&#35760;&#24405;</span>
logger.setLevel(<span style="color: #008b8b;">Level</span>.OFF)    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20851;&#38381;&#25152;&#26377;&#32423;&#21035;&#30340;&#35760;&#24405;</span>
</pre>

<ul>
<li>记录日志
</li>
</ul>




<pre class="src src-java">logger.warning(message);
logger.log(<span style="color: #008b8b;">Level</span>.FINE,message);
</pre>

<ul>
<li>默认日志记录将显示类名,方法名
</li>
</ul>

</div>

</div>

<div id="outline-container-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> 修改日志管理器配置</h4>
<div class="outline-text-4" id="text-5-3-2">

<ul>
<li>配置文件存在于jre/lib/logging.properties
</li>
<li>要想使用另一个配置文件,使用下列命令
</li>
</ul>




<pre class="src src-bash">java -Djava.util.logging.config.file=configFile MainClass
</pre>

</div>

</div>

<div id="outline-container-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> 处理器</h4>
<div class="outline-text-4" id="text-5-3-3">

<ul>
<li>与日志记录器一样,处理器也有日志记录级别,对于一条要被记录的日志,它的日志级别必须高于日志记录器和处理器的阈值
</li>
<li>在默认情况下,日志记录器将记录发送到自己的处理器和父处理器.如果不想两次看到这些记录,应该将useParentHandlers属性设为false
</li>
</ul>




<pre class="src src-java">logger.setUseParentHandlers(<span style="color: #008b8b;">false</span>);
<span style="color: #228b22;">Handler</span> <span style="color: #a0522d;">handler</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ConsoleHandler</span>();
handler.setLevel(<span style="color: #008b8b;">Level</span>.FINE);
logger.addHandler(handler);
</pre>

<ul>
<li>可以通过扩展Handler类或StreamHandler类自定义处理器
</li>
</ul>

</div>

</div>

<div id="outline-container-5-3-4" class="outline-4">
<h4 id="sec-5-3-4"><span class="section-number-4">5.3.4</span> 过滤器</h4>
<div class="outline-text-4" id="text-5-3-4">

<ul>
<li>默认情况下,过滤器根据日志级别进行过滤,每个日志记录器和处理器都可以有一个可选的过滤器来完成附加的过滤
</li>
<li>想要将一个过滤器安装到一个日志记录器或处理器中,只要调用setFilter方法
</li>
<li>每个日志记录器和处理器同一时刻最多只能有一个过滤器
</li>
<li>可以通过实现Filter接口自定义过滤器
</li>
</ul>

</div>

</div>

<div id="outline-container-5-3-5" class="outline-4">
<h4 id="sec-5-3-5"><span class="section-number-4">5.3.5</span> 格式化器</h4>
<div class="outline-text-4" id="text-5-3-5">

<ul>
<li>ConsoleHandler类和FileHandler类可以生成文本和XML格式的日志记录
</li>
<li>可以自定义格式,需要扩展Formatter类并覆盖String format(LogRecord record)方法
</li>
<li>调用setFormatter方法将格式化器安装到处理器中
</li>
</ul>

</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 泛型程序设计</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>泛型程序设计意味着编写的代码可以被很多不同类型的对象所重用
</li>
<li>在泛型出现之前,使用Object变量,对具体类型进行操作时需要进行强制类型转换,且没有类型错误检查
</li>
<li>泛型使用类型参数来指示元素的类型,编译器可以很好地利用这个参数,get的时候不需要进行强制类型转换,add的时候可以进行类型检查,避免插入错误类型的对象
</li>
<li>类型参数使得程序具有更好的可读性和安全性
</li>
</ul>


</div>
