src/java核心技术.org
** 泛型类
#+BEGIN_SRC java
public class MyClass<T,U>{
    ...
}
#+END_SRC
用具体的类型替换类型变量,就可以实例化泛型类型
#+BEGIN_SRC java
MyClass<String,String>()
#+END_SRC
泛型类可以看做普通类的工厂
** 泛型方法
#+BEGIN_SRC java
class MyClass{
    public static <T> T getMiddle(T[] a){
        ...
    }
}
#+END_SRC
+ 类型变量放在修饰符后,返回类型前
+ 调用一个泛型方法,在方法名前的尖括号中放入具体类型
#+BEGIN_SRC java
String[] names={"zoe","chao"};
String middle = MyClass.<String>getMiddle(names);
#+END_SRC
** 限定类型变量
#+BEGIN_SRC java
//将T限定为实现了Comparable接口和Serializable接口
public static <T extends Comparable & Serializable> T min(T[] a){
    ...
}
#+END_SRC
+ 用逗号分隔类型变量,用&分隔限定类型
+ 限定中最多有一个类,可以有多个接口
+ 如果限定中有一个类,它必须是限定类表中的第一个
** 类型擦除
虚拟机没有泛型类型对象,所有对象都属于普通类.因此在程序编译是需要对泛型类型对象进行转换,即类型擦除.
+ 无论何时定义一个泛型类型,都自动提供了一个相应的原始类型
+ 原始类型的名字就是删去类型参数后的泛型类型名
+ 擦除类型变量,并替换为限定类型(无限定类型的变量用Object)
#+BEGIN_SRC java
//源代码
public class MyClass<T,U,W extends Comparable,V extends Comparable&Serializable>{
    public T first;
    public U second;
    public W third;
    public V fourth;
}
//转换后
public class MyClass{           //原始类型名就是MyClass
    public Object first;        //擦除了类型变量T,替换为了Object
    public Object second;       //擦除了类型变量U,替换为了Object
    public Comparable third;    //擦除了类型变量W,替换为了限定类型Comparable
    public Comparable fourth;   //擦除了类型变量V,替换为了第一个限定类型Comparable
}
#+END_SRC
+ 当程序调用泛型方法时,编译器插入强制类型转换
#+BEGIN_SRC java
Pair<Employee> buddies = ...;
/*类型擦除后,getFirst的返回类型将是Object,编译器自动插入Employee强制类型转换
  编译器把这个方法调用翻译为两条虚拟机指令
  1. 对原始方法Pair.getFirst的调用
  2. 将返回的Object类型强制转换为Employee类型
*/
Employee buddy = buddies.getFirst();   //方法返回类型强制转换
Employee buddy = buddies.first;        //属性类型强制转换
#+END_SRC
** 约束与局限
以下的限制大都是由类型擦除引起的
+ 不能用基本类型实例化类型参数
+ 运行时类型查询只适用于原始类型
#+BEGIN_SRC java
if(a instanceof Pair<String>)
//等效于
if(a instanceof Pair)  //Pair是Pair<String>的原始类型
#+END_SRC
+ 不能抛出也不能捕获泛型类型实例
#+BEGIN_SRC java
public static <T extends Throwable> void doWork(T t)
{
    try{
        ...
    }
    catch(T e){    //错误!!
        ...
    }
}
/* 可以在异常声明中使用限定类型 */
public static <T extends Throwable> void doWork(T t)
{
    try{
        ...
    }
    catch(Throwable e){
        ...
    }
}
#+END_SRC
+ 参数类型的数组不合法
+ 不能实例化类型变量
#+BEGIN_SRC java
new T(...)  //错误!!
new T[...]  //错误!!
#+END_SRC
+ 不能在静态域或方法中引用类型变量
** 泛型类型的继承规则
+ 假设Manager类继承了Employee类
+ ArrayList<T>实现了List<T>
+ ArrayList<Manager>与ArrayList<Employee>没有任何继承关系
+ ArrayList<Manager>类型的对象可以被List<Manager>类型引用
** 通配符类型
+ <? extends Class/Interface> 表示类型参数是Class/Interface的子类
+ <? super Class/Interface> 表示类型参数是Class/Interface的超类
+ 带有超类型限定的通配符可以向泛型对象写入
+ 带有子类型限定的通配符可以从泛型对象读取
#+BEGIN_SRC java
/*Pair<? extends Employee>的setFirst方法不能被调用
  因为编译器只知道需要某个Employee的子类型,但不知道具体是什么类型
*/
? extends Employee getFirst()
void setFirst(? extends Employee)

/*编译器不知道setFirst方法的确切类型,但是可以传入任意Manager的对象及子类的对象
  这样可以保证一个更具体的对象赋值给了一个更抽象的对象
  如果调用getFirst,返回对象将不会得到保证,只能把它赋给一个Object类型
*/
void setFirst(? super Manager)
? super Manager getFirst()
#+END_SRC
* 集合
