html/java核心技术.html

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 泛型类</h3>
<div class="outline-text-3" id="text-6-1">




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>&lt;T,<span style="color: #228b22;">U</span>&gt;{
    ...
}
</pre>

<p>
用具体的类型替换类型变量,就可以实例化泛型类型
</p>


<pre class="src src-java">MyClass&lt;String,String&gt;()
</pre>

<p>
泛型类可以看做普通类的工厂
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 泛型方法</h3>
<div class="outline-text-3" id="text-6-2">




<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>{
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> &lt;T&gt; T getMiddle(<span style="color: #228b22;">T</span>[] <span style="color: #a0522d;">a</span>){
        ...
    }
}
</pre>

<ul>
<li>类型变量放在修饰符后,返回类型前
</li>
<li>调用一个泛型方法,在方法名前的尖括号中放入具体类型
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">names</span>={<span style="color: #8b2252;">"zoe"</span>,<span style="color: #8b2252;">"chao"</span>};
<span style="color: #228b22;">String</span> <span style="color: #a0522d;">middle</span> = MyClass.&lt;String&gt;getMiddle(names);
</pre>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 限定类型变量</h3>
<div class="outline-text-3" id="text-6-3">




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;T&#38480;&#23450;&#20026;&#23454;&#29616;&#20102;Comparable&#25509;&#21475;&#21644;Serializable&#25509;&#21475;</span>
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span> &amp; Serializable&gt; T min(<span style="color: #228b22;">T</span>[] <span style="color: #a0522d;">a</span>){
    ...
}
</pre>

<ul>
<li>用逗号分隔类型变量,用&amp;分隔限定类型
</li>
<li>限定中最多有一个类,可以有多个接口
</li>
<li>如果限定中有一个类,它必须是限定类表中的第一个
</li>
</ul>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 类型擦除</h3>
<div class="outline-text-3" id="text-6-4">

<p>虚拟机没有泛型类型对象,所有对象都属于普通类.因此在程序编译时需要对泛型类型对象进行转换,即类型擦除.
</p><ul>
<li>无论何时定义一个泛型类型,都自动提供了一个相应的原始类型
</li>
<li>原始类型的名字就是删去类型参数后的泛型类型名
</li>
<li>擦除类型变量,并替换为限定类型(无限定类型的变量用Object)
</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#28304;&#20195;&#30721;</span>
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>&lt;T,<span style="color: #228b22;">U</span>,<span style="color: #228b22;">W</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>,<span style="color: #228b22;">V</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>&amp;Serializable&gt;{
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">T</span> <span style="color: #a0522d;">first</span>;
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">U</span> <span style="color: #a0522d;">second</span>;
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">W</span> <span style="color: #a0522d;">third</span>;
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">V</span> <span style="color: #a0522d;">fourth</span>;
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36716;&#25442;&#21518;</span>
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>{           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21407;&#22987;&#31867;&#22411;&#21517;&#23601;&#26159;MyClass</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Object</span> <span style="color: #a0522d;">first</span>;        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25830;&#38500;&#20102;&#31867;&#22411;&#21464;&#37327;T,&#26367;&#25442;&#20026;&#20102;Object</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Object</span> <span style="color: #a0522d;">second</span>;       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25830;&#38500;&#20102;&#31867;&#22411;&#21464;&#37327;U,&#26367;&#25442;&#20026;&#20102;Object</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Comparable</span> <span style="color: #a0522d;">third</span>;    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25830;&#38500;&#20102;&#31867;&#22411;&#21464;&#37327;W,&#26367;&#25442;&#20026;&#20102;&#38480;&#23450;&#31867;&#22411;Comparable</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Comparable</span> <span style="color: #a0522d;">fourth</span>;   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25830;&#38500;&#20102;&#31867;&#22411;&#21464;&#37327;V,&#26367;&#25442;&#20026;&#20102;&#31532;&#19968;&#20010;&#38480;&#23450;&#31867;&#22411;Comparable</span>
}
</pre>

<ul>
<li>当程序调用泛型方法时,编译器插入强制类型转换
</li>
</ul>




<pre class="src src-java">Pair&lt;Employee&gt; buddies = ...;
<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#31867;&#22411;&#25830;&#38500;&#21518;,getFirst&#30340;&#36820;&#22238;&#31867;&#22411;&#23558;&#26159;Object,&#32534;&#35793;&#22120;&#33258;&#21160;&#25554;&#20837;Employee&#24378;&#21046;&#31867;&#22411;&#36716;&#25442;</span>
<span style="color: #b22222;">  &#32534;&#35793;&#22120;&#25226;&#36825;&#20010;&#26041;&#27861;&#35843;&#29992;&#32763;&#35793;&#20026;&#20004;&#26465;&#34394;&#25311;&#26426;&#25351;&#20196;</span>
<span style="color: #b22222;">  1. &#23545;&#21407;&#22987;&#26041;&#27861;Pair.getFirst&#30340;&#35843;&#29992;</span>
<span style="color: #b22222;">  2. &#23558;&#36820;&#22238;&#30340;Object&#31867;&#22411;&#24378;&#21046;&#36716;&#25442;&#20026;Employee&#31867;&#22411;</span>
<span style="color: #b22222;">*/</span>
<span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">buddy</span> = buddies.getFirst();   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#26041;&#27861;&#36820;&#22238;&#31867;&#22411;&#24378;&#21046;&#36716;&#25442;</span>
<span style="color: #228b22;">Employee</span> <span style="color: #a0522d;">buddy</span> = buddies.first;        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23646;&#24615;&#31867;&#22411;&#24378;&#21046;&#36716;&#25442;</span>
</pre>

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 约束与局限</h3>
<div class="outline-text-3" id="text-6-5">

<p>以下的限制大都是由类型擦除引起的
</p><ul>
<li>不能用基本类型实例化类型参数
</li>
<li>运行时类型查询只适用于原始类型
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">if</span>(a <span style="color: #a020f0;">instanceof</span> Pair&lt;String&gt;)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#25928;&#20110;</span>
<span style="color: #a020f0;">if</span>(a <span style="color: #a020f0;">instanceof</span> Pair)  <span style="color: #b22222;">//</span><span style="color: #b22222;">Pair&#26159;Pair&lt;String&gt;&#30340;&#21407;&#22987;&#31867;&#22411;</span>
</pre>

<ul>
<li>不能抛出也不能捕获泛型类型实例
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Throwable</span>&gt; <span style="color: #228b22;">void</span> doWork(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>)
{
    <span style="color: #a020f0;">try</span>{
        ...
    }
    <span style="color: #a020f0;">catch</span>(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">e</span>){    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38169;&#35823;!!</span>
        ...
    }
}
<span style="color: #b22222;">/* </span><span style="color: #b22222;">&#21487;&#20197;&#22312;&#24322;&#24120;&#22768;&#26126;&#20013;&#20351;&#29992;&#38480;&#23450;&#31867;&#22411; */</span>
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Throwable</span>&gt; <span style="color: #228b22;">void</span> doWork(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>)
{
    <span style="color: #a020f0;">try</span>{
        ...
    }
    <span style="color: #a020f0;">catch</span>(<span style="color: #228b22;">Throwable</span> <span style="color: #a0522d;">e</span>){
        ...
    }
}
</pre>

<ul>
<li>参数类型的数组不合法
</li>
<li>不能实例化类型变量
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">new</span> <span style="color: #228b22;">T</span>(...)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38169;&#35823;!!</span>
<span style="color: #a020f0;">new</span> <span style="color: #228b22;">T</span>[...]  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#38169;&#35823;!!</span>
</pre>

<ul>
<li>不能在静态域或方法中引用类型变量
</li>
</ul>

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 泛型类型的继承规则</h3>
<div class="outline-text-3" id="text-6-6">

<ul>
<li>假设Manager类继承了Employee类
</li>
<li>ArrayList&lt;T&gt;实现了List&lt;T&gt;
</li>
<li>ArrayList&lt;Manager&gt;与ArrayList&lt;Employee&gt;没有任何继承关系
</li>
<li>ArrayList&lt;Manager&gt;类型的对象可以被List&lt;Manager&gt;类型引用
</li>
</ul>

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> 通配符类型</h3>
<div class="outline-text-3" id="text-6-7">

<ul>
<li>&lt;? extends Class/Interface&gt; 表示类型参数是Class/Interface的子类
</li>
<li>&lt;? super Class/Interface&gt; 表示类型参数是Class/Interface的超类
</li>
<li>带有超类型限定的通配符可以向泛型对象写入
</li>
<li>带有子类型限定的通配符可以从泛型对象读取
</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">/*</span><span style="color: #b22222;">Pair&lt;? extends Employee&gt;&#30340;setFirst&#26041;&#27861;&#19981;&#33021;&#34987;&#35843;&#29992;</span>
<span style="color: #b22222;">  &#22240;&#20026;&#32534;&#35793;&#22120;&#21482;&#30693;&#36947;&#38656;&#35201;&#26576;&#20010;Employee&#30340;&#23376;&#31867;&#22411;,&#20294;&#19981;&#30693;&#36947;&#20855;&#20307;&#26159;&#20160;&#20040;&#31867;&#22411;</span>
<span style="color: #b22222;">*/</span>
? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Employee</span> getFirst()
<span style="color: #228b22;">void</span> setFirst(? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Employee</span>)

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#32534;&#35793;&#22120;&#19981;&#30693;&#36947;setFirst&#26041;&#27861;&#30340;&#30830;&#20999;&#31867;&#22411;,&#20294;&#26159;&#21487;&#20197;&#20256;&#20837;&#20219;&#24847;Manager&#30340;&#23545;&#35937;&#21450;&#23376;&#31867;&#30340;&#23545;&#35937;</span>
<span style="color: #b22222;">  &#36825;&#26679;&#21487;&#20197;&#20445;&#35777;&#19968;&#20010;&#26356;&#20855;&#20307;&#30340;&#23545;&#35937;&#36171;&#20540;&#32473;&#20102;&#19968;&#20010;&#26356;&#25277;&#35937;&#30340;&#23545;&#35937;</span>
<span style="color: #b22222;">  &#22914;&#26524;&#35843;&#29992;getFirst,&#36820;&#22238;&#23545;&#35937;&#23558;&#19981;&#20250;&#24471;&#21040;&#20445;&#35777;,&#21482;&#33021;&#25226;&#23427;&#36171;&#32473;&#19968;&#20010;Object&#31867;&#22411;</span>
<span style="color: #b22222;">*/</span>
<span style="color: #228b22;">void</span> setFirst(? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">Manager</span>)
? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">Manager</span> getFirst()
</pre>

</div>
</div>

</div>
