src/java核心技术.org
** 集合接口
+ java集合类库将接口与实现分离
+ 在java类库中,集合类的基本接口是Collection接口
#+BEGIN_SRC java
public interface Collection<E>
{
    boolean add(E element);
    Iterator<E> iterator();
}
#+END_SRC
+ add方法用于向集合中添加元素,如果添加元素确实改变了集合,就返回true,否则返回false
+ iterator方法用于返回一个实现了Iterator接口的对象
+ Iterator接口包含3个方法
  1. next. 通过反复调用next,可以逐个访问集合中的元素
  2. hasNext. 道道集合末尾,next将抛出NoSuchElementException,因此,需要调用next之前调用hasNext方法
  3. remove. remove方法将删除上次调用next方法时返回的元素.如果调用remove之前没有调用next将是不合法的.
#+BEGIN_SRC java
public interface Iterator<E>
{
    E next();
    boolean hasNext();
    void remove();
}
#+END_SRC
+ for each循环可以与任何实现了Iterable接口的对象一起工作,Collection接口扩展了Iterable接口,因此对于标准类库中的任何集合都可以使用for each循环
#+BEGIN_SRC java
public interface Iterable<E>
{
    Iterator<E> iterator();
}
#+END_SRC
+ 如果实现Collection接口,需要实现很多方法是一件很烦人的事,java类库提供了AbstractCollection,它将size和iterator抽象化了,但提供了其他方法.
#+BEGIN_SRC java
java.util.Collection<E>

Iterator<E> iterator             //返回一个迭代器
int size()                       //返回元素个数
boolean isEmpty()                //判断集合是否为空
boolean contains(Object obj)     //判断集合中是否包含obj
boolean add(Object element)      //将一个元素添加到集合中
boolean remove(Object obj)       //从集合中删除obj
void clear()                     //清空集合
Object[] toArray()               //返回这个集合的对象数组
<T> T[] toArray(T[] arrayToFill) //返回这个集合的对象数组
//判断集合中是否包含other中的所有元素
boolean containsAll(Collection<?> other)
//从集合中删除所有与other集合中的元素不同的元素
boolean retainAll(Collection<?> other)
//从集合中删除other集合中存在的所有元素
boolean removeAll(Collection<?> other)
//将other集合中的所有元素添加到集合中
boolean addAll(Collection<? extends E> other)
#+END_SRC
** 具体的集合
