html/java核心技术.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 集合</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 集合接口</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>java集合类库将接口与实现分离
</li>
<li>在java类库中,集合类的基本接口是Collection接口
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Collection</span>&lt;E&gt;
{
    <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">add</span>(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>);
    Iterator&lt;E&gt; iterator();
}
</pre>

<ul>
<li>add方法用于向集合中添加元素,如果添加元素确实改变了集合,就返回true,否则返回false
</li>
<li>iterator方法用于返回一个实现了Iterator接口的对象
</li>
<li>Iterator接口包含3个方法
<ol>
<li>next. 通过反复调用next,可以逐个访问集合中的元素
</li>
<li>hasNext. 道道集合末尾,next将抛出NoSuchElementException,因此,需要调用next之前调用hasNext方法
</li>
<li>remove. remove方法将删除上次调用next方法时返回的元素.如果调用remove之前没有调用next将是不合法的.
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Iterator</span>&lt;E&gt;
{
    <span style="color: #228b22;">E</span> <span style="color: #a0522d;">next</span>();
    <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">hasNext</span>();
    <span style="color: #228b22;">void</span> <span style="color: #a0522d;">remove</span>();
}
</pre>

<ul>
<li>for each循环可以与任何实现了Iterable接口的对象一起工作,Collection接口扩展了Iterable接口,因此对于标准类库中的任何集合都可以使用for each循环
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Iterable</span>&lt;E&gt;
{
    Iterator&lt;E&gt; iterator();
}
</pre>

<ul>
<li>如果实现Collection接口,需要实现很多方法是一件很烦人的事,java类库提供了AbstractCollection,它将size和iterator抽象化了,但提供了其他方法.
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.Collection&lt;E&gt;

Iterator&lt;E&gt; iterator             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#36845;&#20195;&#22120;</span>
<span style="color: #228b22;">int</span> size()                       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#20803;&#32032;&#20010;&#25968;</span>
<span style="color: #228b22;">boolean</span> isEmpty()                <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21028;&#26029;&#38598;&#21512;&#26159;&#21542;&#20026;&#31354;</span>
<span style="color: #228b22;">boolean</span> contains(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">obj</span>)     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21028;&#26029;&#38598;&#21512;&#20013;&#26159;&#21542;&#21253;&#21547;obj</span>
<span style="color: #228b22;">boolean</span> add(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">element</span>)      <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#19968;&#20010;&#20803;&#32032;&#28155;&#21152;&#21040;&#38598;&#21512;&#20013;</span>
<span style="color: #228b22;">boolean</span> remove(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">obj</span>)       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;&#38598;&#21512;&#20013;&#21024;&#38500;obj</span>
<span style="color: #228b22;">void</span> clear()                     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#28165;&#31354;&#38598;&#21512;</span>
Object[] toArray()               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#38598;&#21512;&#30340;&#23545;&#35937;&#25968;&#32452;</span>
&lt;T&gt; T[] toArray(<span style="color: #228b22;">T</span>[] <span style="color: #a0522d;">arrayToFill</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#38598;&#21512;&#30340;&#23545;&#35937;&#25968;&#32452;</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21028;&#26029;&#38598;&#21512;&#20013;&#26159;&#21542;&#21253;&#21547;other&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
<span style="color: #228b22;">boolean</span> containsAll(Collection&lt;?&gt; other)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;&#38598;&#21512;&#20013;&#21024;&#38500;&#25152;&#26377;&#19982;other&#38598;&#21512;&#20013;&#30340;&#20803;&#32032;&#19981;&#21516;&#30340;&#20803;&#32032;</span>
<span style="color: #228b22;">boolean</span> retainAll(Collection&lt;?&gt; other)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;&#38598;&#21512;&#20013;&#21024;&#38500;other&#38598;&#21512;&#20013;&#23384;&#22312;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
<span style="color: #228b22;">boolean</span> removeAll(Collection&lt;?&gt; other)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;other&#38598;&#21512;&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#38598;&#21512;&#20013;</span>
<span style="color: #228b22;">boolean</span> addAll(Collection&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; other)
</pre>

</div>

</div>
