src/java核心技术.org
*** 链表
+ java中,所有链表实际上都是双向链接的
+ 有两种访问元素的协议:一种是用迭代器,另一种使用get和set方法随机地访问,后者不适用于链表
#+BEGIN_SRC java
List<String> staff = new LinkedList<String>(); //LinkedList实现了List
staff.add("zoe");
staff.add("chao");
Iterator iter = staff.iterator();
...
#+END_SRC
#+BEGIN_SRC java
java.util.List<E>

ListIterator<E> listIterator()           //返回列表迭代器
ListIterator<E> listIterator(int index)  //返回列表迭代器
void add(int i, E element)               //在给定位置添加元素
E remove(int i)                          //删除指定位置元素
E get(int i)                             //获取指定位置元素
E set(int i)                             //设置指定位置元素
int indexOf(Object element)              //指定元素第一次出现的位置
int lastIndexOf(Object element)          //指定元素最后一次出现的位置
//将集合中所有元素添加到指定位置
void addAll(int i, Collection<? extends E> elements)
#+END_SRC
#+BEGIN_SRC java
java.util.ListIterator<E>

void add(E newElement) //在当前位置添加一个元素                  
void set(E newElement) //用新元素取代next或previous上次访问的元素
boolean hasPrevious()  //是否还有反向迭代可供访问的元素          
E previous()           //前一个对象                              
int nextIndex()        //下一次调用next方法时将返回的元素的索引  
int previousIndex()    //下一次调用previous方法时将返回的元素的索引
#+END_SRC
#+BEGIN_SRC java
java.util.LinkedList<E>

//构造空链表                                  
LinkedList()
//构造一个链表,并将集合中所有元素添加到这个链表
LinkedList(Collection<? extends E> elements

void addFirst(E element)  //将某个元素添加到列表的头部
void addLast(E element)   //将某个元素添加到列表的尾部
E getFirst()              //返回列表头部
E getLast()               //返回列表尾部
E removeFirst()           //删除并返回列表头部
E removeLast()            //删除并返回列表尾部
#+END_SRC
*** 数组列表
ArrayList类实现了List接口,ArrayList封装了一个动态再分配的对象数组
*** 散列集
+ 散列表为每个对象计算一个整数,称散列码
+ 散列表用链表数组实现,每个列表被称为桶
+ 元素在表中的位置是 散列码%桶的总数
  1. 如果此位置没有其他元素,直接插入即可
  2. 如果有其他元素,需要用新对象与桶中的所有对象进行比较,查看这个对象是否已经存在
+ 如果散列表太满,就需要再散列,创建一个桶数更多的表,并将所有元素插入到这个新表中,装填因子决定何时对散列表进行再散列.如果装填因子是0.75,当表中超过75%的位置已经填入元素,就会进行在散列.
+ java集合类库提供了HashSet类,它的实现给予散列表,可以用add添加元素,contains方法已被重新定义,用于快速产看是否拥有某个元素
#+BEGIN_SRC java
java.util.HashSet<E>

//构造一个空散列集
HashSet()
//构造一个散列集,并将集合中的所有元素添加到这个散列集中
HashSet(Collection<? extends E> elements)
//构造一个空的散列集,指定桶数
HashSet(int initialCapacity)
//构造一个空的散列集,指定桶数和装填因子
HashSet(int initialCapacity,float loadFactor)
#+END_SRC
*** 树集
+ TreeSet相对HashSet有所改进,树集是一个有序集合,可以以任意顺序将元素插入到集合中,对集合进行遍历时,每个值将自动按排序后的顺序呈现
+ 当前的实现使用的是红黑树
+ 每次将一个元素添加到树中时,都被放置在正确的排序位置上,将一个元素添加到树集中要比添加到散列集中慢
#+BEGIN_SRC java
java.util.TreeSet<E>

//构造空树集
TreeSet()
//构造一个树集,并将集合中的所有元素添加到树集中
TreeSet(Collection<? extends E> elements)
//构造一个树集,并用指定的比较器对其中的元素排序
TreeSet(Comparator<? super E> c)
/*构造一个树集,将有序集中的所有元素添加到这个树集中,
并使用与给定有序集相同的元素比较器*/
TreeSet(SortedSet<? extends E> elements)
#+END_SRC
