html/java核心技术.html

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 具体的集合</h3>
<div class="outline-text-3" id="text-7-2">


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> 链表</h4>
<div class="outline-text-4" id="text-7-2-1">

<ul>
<li>java中,所有链表实际上都是双向链接的
</li>
<li>有两种访问元素的协议:一种是用迭代器,另一种使用get和set方法随机地访问,后者不适用于链表
</li>
</ul>




<pre class="src src-java">List&lt;String&gt; staff = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">LinkedList</span>&lt;String&gt;(); <span style="color: #b22222;">//</span><span style="color: #b22222;">LinkedList&#23454;&#29616;&#20102;List</span>
staff.add(<span style="color: #8b2252;">"zoe"</span>);
staff.add(<span style="color: #8b2252;">"chao"</span>);
<span style="color: #228b22;">Iterator</span> <span style="color: #a0522d;">iter</span> = staff.iterator();
...
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.List&lt;E&gt;

ListIterator&lt;E&gt; listIterator()           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21015;&#34920;&#36845;&#20195;&#22120;</span>
ListIterator&lt;E&gt; listIterator(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">index</span>)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21015;&#34920;&#36845;&#20195;&#22120;</span>
<span style="color: #228b22;">void</span> add(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#32473;&#23450;&#20301;&#32622;&#28155;&#21152;&#20803;&#32032;</span>
E remove(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>)                          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#25351;&#23450;&#20301;&#32622;&#20803;&#32032;</span>
E get(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>)                             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#21462;&#25351;&#23450;&#20301;&#32622;&#20803;&#32032;</span>
E set(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>)                             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35774;&#32622;&#25351;&#23450;&#20301;&#32622;&#20803;&#32032;</span>
<span style="color: #228b22;">int</span> indexOf(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">element</span>)              <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25351;&#23450;&#20803;&#32032;&#31532;&#19968;&#27425;&#20986;&#29616;&#30340;&#20301;&#32622;</span>
<span style="color: #228b22;">int</span> lastIndexOf(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">element</span>)          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#25351;&#23450;&#20803;&#32032;&#26368;&#21518;&#19968;&#27425;&#20986;&#29616;&#30340;&#20301;&#32622;</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#38598;&#21512;&#20013;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#25351;&#23450;&#20301;&#32622;</span>
<span style="color: #228b22;">void</span> addAll(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, Collection&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; elements)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.ListIterator&lt;E&gt;

<span style="color: #228b22;">void</span> add(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">newElement</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#24403;&#21069;&#20301;&#32622;&#28155;&#21152;&#19968;&#20010;&#20803;&#32032;                  </span>
<span style="color: #228b22;">void</span> set(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">newElement</span>) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#26032;&#20803;&#32032;&#21462;&#20195;next&#25110;previous&#19978;&#27425;&#35775;&#38382;&#30340;&#20803;&#32032;</span>
<span style="color: #228b22;">boolean</span> hasPrevious()  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#26159;&#21542;&#36824;&#26377;&#21453;&#21521;&#36845;&#20195;&#21487;&#20379;&#35775;&#38382;&#30340;&#20803;&#32032;          </span>
E previous()           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21069;&#19968;&#20010;&#23545;&#35937;                              </span>
<span style="color: #228b22;">int</span> nextIndex()        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#19979;&#19968;&#27425;&#35843;&#29992;next&#26041;&#27861;&#26102;&#23558;&#36820;&#22238;&#30340;&#20803;&#32032;&#30340;&#32034;&#24341;  </span>
<span style="color: #228b22;">int</span> previousIndex()    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#19979;&#19968;&#27425;&#35843;&#29992;previous&#26041;&#27861;&#26102;&#23558;&#36820;&#22238;&#30340;&#20803;&#32032;&#30340;&#32034;&#24341;</span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.LinkedList&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#31354;&#38142;&#34920;                                  </span>
LinkedList()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#38142;&#34920;,&#24182;&#23558;&#38598;&#21512;&#20013;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#36825;&#20010;&#38142;&#34920;</span>
LinkedList(Collection&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; elements

<span style="color: #228b22;">void</span> addFirst(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#26576;&#20010;&#20803;&#32032;&#28155;&#21152;&#21040;&#21015;&#34920;&#30340;&#22836;&#37096;</span>
<span style="color: #228b22;">void</span> addLast(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)   <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#26576;&#20010;&#20803;&#32032;&#28155;&#21152;&#21040;&#21015;&#34920;&#30340;&#23614;&#37096;</span>
E getFirst()              <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21015;&#34920;&#22836;&#37096;</span>
E getLast()               <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#21015;&#34920;&#23614;&#37096;</span>
E removeFirst()           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#24182;&#36820;&#22238;&#21015;&#34920;&#22836;&#37096;</span>
E removeLast()            <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#24182;&#36820;&#22238;&#21015;&#34920;&#23614;&#37096;</span>
</pre>

</div>

</div>

<div id="outline-container-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> 数组列表</h4>
<div class="outline-text-4" id="text-7-2-2">

<p>ArrayList类实现了List接口,ArrayList封装了一个动态再分配的对象数组
</p></div>

</div>

<div id="outline-container-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> 散列集</h4>
<div class="outline-text-4" id="text-7-2-3">

<ul>
<li>散列表为每个对象计算一个整数,称散列码
</li>
<li>散列表用链表数组实现,每个列表被称为桶
</li>
<li>元素在表中的位置是 散列码%桶的总数
<ol>
<li>如果此位置没有其他元素,直接插入即可
</li>
<li>如果有其他元素,需要用新对象与桶中的所有对象进行比较,查看这个对象是否已经存在
</li>
</ol>

</li>
<li>如果散列表太满,就需要再散列,创建一个桶数更多的表,并将所有元素插入到这个新表中,装填因子决定何时对散列表进行再散列.如果装填因子是0.75,当表中超过75%的位置已经填入元素,就会进行在散列.
</li>
<li>java集合类库提供了HashSet类,它的实现给予散列表,可以用add添加元素,contains方法已被重新定义,用于快速产看是否拥有某个元素
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.HashSet&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#31354;&#25955;&#21015;&#38598;</span>
HashSet()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#25955;&#21015;&#38598;,&#24182;&#23558;&#38598;&#21512;&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#36825;&#20010;&#25955;&#21015;&#38598;&#20013;</span>
HashSet(Collection&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; elements)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#31354;&#30340;&#25955;&#21015;&#38598;,&#25351;&#23450;&#26742;&#25968;</span>
HashSet(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#31354;&#30340;&#25955;&#21015;&#38598;,&#25351;&#23450;&#26742;&#25968;&#21644;&#35013;&#22635;&#22240;&#23376;</span>
HashSet(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>,<span style="color: #228b22;">float</span> <span style="color: #a0522d;">loadFactor</span>)
</pre>

</div>

</div>

<div id="outline-container-7-2-4" class="outline-4">
<h4 id="sec-7-2-4"><span class="section-number-4">7.2.4</span> 树集</h4>
<div class="outline-text-4" id="text-7-2-4">

<ul>
<li>TreeSet相对HashSet有所改进,树集是一个有序集合,可以以任意顺序将元素插入到集合中,对集合进行遍历时,每个值将自动按排序后的顺序呈现
</li>
<li>当前的实现使用的是红黑树
</li>
<li>每次将一个元素添加到树中时,都被放置在正确的排序位置上,将一个元素添加到树集中要比添加到散列集中慢
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.TreeSet&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#31354;&#26641;&#38598;</span>
TreeSet()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#26641;&#38598;,&#24182;&#23558;&#38598;&#21512;&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#26641;&#38598;&#20013;</span>
TreeSet(Collection&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; elements)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#26641;&#38598;,&#24182;&#29992;&#25351;&#23450;&#30340;&#27604;&#36739;&#22120;&#23545;&#20854;&#20013;&#30340;&#20803;&#32032;&#25490;&#24207;</span>
TreeSet(Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">E</span>&gt; c)
<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#26641;&#38598;,&#23558;&#26377;&#24207;&#38598;&#20013;&#30340;&#25152;&#26377;&#20803;&#32032;&#28155;&#21152;&#21040;&#36825;&#20010;&#26641;&#38598;&#20013;,</span>
<span style="color: #b22222;">&#24182;&#20351;&#29992;&#19982;&#32473;&#23450;&#26377;&#24207;&#38598;&#30456;&#21516;&#30340;&#20803;&#32032;&#27604;&#36739;&#22120;*/</span>
TreeSet(SortedSet&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; elements)
</pre>

<ul>
<li id="sec-7-2-4-1">对象的比较<br/>
<ul>
