src/java核心技术.org
**** 对象的比较
+ 树集假定插入的元素实现了Comparable接口,接口定义了compareTo方法,a.compareTo(b),如果a与b相等,返回0,如果a位于b之前,返回负值,如果a位于b之后,返回正值
#+BEGIN_SRC java
public interface Comparable<T>
{
    int compareTo(T other);
}
#+END_SRC
+ 如没有实现Comparable接口,可以将Comparator对象传递给TreeSet构造器,来告诉树集使用不同的比较方法
#+BEGIN_SRC java
public interface Comparator<T>
{
    int compare(T a, T b);
}
#+END_SRC
#+BEGIN_SRC java
class ItemComparator implements Comparator<Item>
{
    public int compare(Item a, Item b){...}
}

ItemComparator comp = new ItemComparator();
SortedSet<Item> sortByDescription = new TreeSet<Item>(comp);
#+END_SRC
#+BEGIN_SRC java
java.util.SortedSet<E>

Comparator<? super E> comparator() //返回用于对元素警醒排序的比较器 
E frist()                          //返回有序集中最小的元素         
E last()                           //返回有序集中最大的元素         
#+END_SRC
*** 队列与双端队列
+ 队列可以在尾部添加一个元素,在头部删除一个元素
+ 双端队列可以在头部和尾部同时添加或删除元素
+ ArrayDeque和LinkedList类实现了Deque接口,并且提供了双端队列
#+BEGIN_SRC java
java.util.Queue<E>

//在尾部插入元素,如果队列满了,抛出IllegalStateException
boolean add(E element)
//在尾部插入元素,如果队列满了,返回false
boolean offer(E element) 

//删除并返回头部元素,如果队列是空,抛出NoSuchElementException
E remove()
//删除并返回头部元素,如果队列是空,返回false
E poll()

//返回头部元素,但不删除,如果队列是空,抛出NoSuchElementException
E element()
//返回头部元素,但不删除,如果队列是空,返回false
E peek()
#+END_SRC
#+BEGIN_SRC java
java.util.Deque<E>

void addFirst(E element)      
void addLast(E element)       
boolean offerFirst(E element) 
boolean offerlast(E element)  
E removeFirst()               
E removeLast()                
E pollFirst()                 
E pollLast()                  
E getFirst()                  
E getLast()                   
E peekFirst()                 
E peekLast()                  
#+END_SRC
*** 优先级队列
+ 优先级队列中的元素可以按照任意的顺序插入,但无论何时调用remove方法,总会获得当前优先级队列中的最小元素
+ 优先级队列使用了堆
+ 与TreeSet一样,优先级队列既可以保存实现了Comparable接口的对象,也可以保存在构造器中提供比较器的对象
#+BEGIN_SRC java
//构造优先级队列
PriorityQueue()
PriorityQueue(int initialCapacity)

//构造优先级队列,并用指定的比较器对元素进行排序
PriorityQueue(int initialCapacity,Comparator<? super E> c)
#+END_SRC
