html/java核心技术.html
<li>树集假定插入的元素实现了Comparable接口,接口定义了compareTo方法,a.compareTo(b),如果a与b相等,返回0,如果a位于b之前,返回负值,如果a位于b之后,返回正值
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Comparable</span>&lt;T&gt;
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">compareTo</span>(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">other</span>);
}
</pre>

<ul>
<li>如没有实现Comparable接口,可以将Comparator对象传递给TreeSet构造器,来告诉树集使用不同的比较方法
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">interface</span> <span style="color: #228b22;">Comparator</span>&lt;T&gt;
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">compare</span>(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">b</span>);
}
</pre>


<pre class="src src-java"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">ItemComparator</span> <span style="color: #a020f0;">implements</span> <span style="color: #228b22;">Comparator</span>&lt;Item&gt;
{
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">compare</span>(<span style="color: #228b22;">Item</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">Item</span> <span style="color: #a0522d;">b</span>){...}
}

<span style="color: #228b22;">ItemComparator</span> <span style="color: #a0522d;">comp</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ItemComparator</span>();
SortedSet&lt;Item&gt; sortByDescription = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">TreeSet</span>&lt;Item&gt;(comp);
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.SortedSet&lt;E&gt;

Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">E</span>&gt; comparator() <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#29992;&#20110;&#23545;&#20803;&#32032;&#36827;&#34892;&#25490;&#24207;&#30340;&#27604;&#36739;&#22120; </span>
E frist()                          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26377;&#24207;&#38598;&#20013;&#26368;&#23567;&#30340;&#20803;&#32032;         </span>
E last()                           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26377;&#24207;&#38598;&#20013;&#26368;&#22823;&#30340;&#20803;&#32032;         </span>
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-7-2-5" class="outline-4">
<h4 id="sec-7-2-5"><span class="section-number-4">7.2.5</span> 队列与双端队列</h4>
<div class="outline-text-4" id="text-7-2-5">

<ul>
<li>队列可以在尾部添加一个元素,在头部删除一个元素
</li>
<li>双端队列可以在头部和尾部同时添加或删除元素
</li>
<li>ArrayDeque和LinkedList类实现了Deque接口,并且提供了双端队列
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.Queue&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#23614;&#37096;&#25554;&#20837;&#20803;&#32032;,&#22914;&#26524;&#38431;&#21015;&#28385;&#20102;,&#25243;&#20986;IllegalStateException</span>
<span style="color: #228b22;">boolean</span> add(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22312;&#23614;&#37096;&#25554;&#20837;&#20803;&#32032;,&#22914;&#26524;&#38431;&#21015;&#28385;&#20102;,&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> offer(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>) 

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#24182;&#36820;&#22238;&#22836;&#37096;&#20803;&#32032;,&#22914;&#26524;&#38431;&#21015;&#26159;&#31354;,&#25243;&#20986;NoSuchElementException</span>
E remove()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21024;&#38500;&#24182;&#36820;&#22238;&#22836;&#37096;&#20803;&#32032;,&#22914;&#26524;&#38431;&#21015;&#26159;&#31354;,&#36820;&#22238;false</span>
E poll()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#22836;&#37096;&#20803;&#32032;,&#20294;&#19981;&#21024;&#38500;,&#22914;&#26524;&#38431;&#21015;&#26159;&#31354;,&#25243;&#20986;NoSuchElementException</span>
E element()
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#22836;&#37096;&#20803;&#32032;,&#20294;&#19981;&#21024;&#38500;,&#22914;&#26524;&#38431;&#21015;&#26159;&#31354;,&#36820;&#22238;false</span>
E peek()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.Deque&lt;E&gt;

<span style="color: #228b22;">void</span> addFirst(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)      
<span style="color: #228b22;">void</span> addLast(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)       
<span style="color: #228b22;">boolean</span> offerFirst(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>) 
<span style="color: #228b22;">boolean</span> offerlast(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)  
E removeFirst()               
E removeLast()                
E pollFirst()                 
E pollLast()                  
E getFirst()                  
E getLast()                   
E peekFirst()                 
E peekLast()                  
</pre>

</div>

</div>

<div id="outline-container-7-2-6" class="outline-4">
<h4 id="sec-7-2-6"><span class="section-number-4">7.2.6</span> 优先级队列</h4>
<div class="outline-text-4" id="text-7-2-6">

<ul>
<li>优先级队列中的元素可以按照任意的顺序插入,但无论何时调用remove方法,总会获得当前优先级队列中的最小元素
</li>
<li>优先级队列使用了堆
</li>
<li>与TreeSet一样,优先级队列既可以保存实现了Comparable接口的对象,也可以保存在构造器中提供比较器的对象
</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#20248;&#20808;&#32423;&#38431;&#21015;</span>
PriorityQueue()
PriorityQueue(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#20248;&#20808;&#32423;&#38431;&#21015;,&#24182;&#29992;&#25351;&#23450;&#30340;&#27604;&#36739;&#22120;&#23545;&#20803;&#32032;&#36827;&#34892;&#25490;&#24207;</span>
PriorityQueue(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>,Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">E</span>&gt; c)
</pre>

</div>

</div>
