src/java核心技术.org
*** 映射表
+ 映射表用来存放键值对
+ java类库为映射表提供了两个通用实现,这两个类都实现了Map接口
  1. HashMap 对键进行散列
  2. TreeMap 用键的整体顺序对元素进行排序
#+BEGIN_SRC java
java.util.Map<K,V>

V get(K key)                                    //获取键对应的值,没有则返回null     
V put(K key, V value)                           //将键值对插入到映射表中            
V putAll(Map<? extends K, ? extends V> entries) //将指定映射表中的条目插入到映射表中
boolean containsKey(Object key)                 //映射表中是否已经有指定键          
boolean containsValue(Object value)             //映射表中是否已经有指定值          
Set<Map.Entry<K,V>> entrySet()                  //返回映射表中的键值对              
Set<K> keySet()                                 //返回映射表中的键                  
Collection<V> values()                          //返回映射表中的值                  
#+END_SRC
#+BEGIN_SRC java
java.util.Map.Entry<K,V>

K getKey()              // 返回这个条目的键 
V getValue()            // 返回这个条目的值 
V setValue(V nuewValue) // 设置新值,并返回旧值
#+END_SRC
#+BEGIN_SRC java
java.util.HashMap<K,V>

//构造散列映射表
HashMap()

//构造散列映射表,指定容量
HashMap(int initialCapacity)

//构造散列映射表,指定容量,指定装填因子
HashMap(int initialCapacity,float loadFactor)
#+END_SRC
#+BEGIN_SRC java
java.util.TreeMap<K,V>

//构造树映射表,指定比较器
TreeMap(Comparator<? super K> c)

//构造树映射表,将指定映射表中的所有条目添加到树映射表中
TreeMap(Map<? extends K,? extends V> entries)

//构造树映射表,将指定有序映射表中的所有条目添加到树映射表中,并使用其比较器 
TreeMap(SortedMap<? extends K,? extends V> entries)
#+END_SRC
#+BEGIN_SRC java
java.util.SortedMap<K,V>

Comparator<? super K> comparator() //返回比较器          
K firstKey()                       //返回映射表中最小元素
K lastKey()                        //返回映射表中最大元素
#+END_SRC
** 集合框架
*** 集合框架的接口
#+BEGIN_EXAMPLE
+ Iterable
  - Collection
    - List
    - Set
      - SorteSet
	- NavigableSet
    - Queue
      - Deque
+ Map
  - SortedMap
    - NavigableMap
+ Iterator
  - ListIterator
+ RandomAccess
#+END_EXAMPLE
+ RandomAccess接口没有任何方法,但可以用来检测一个特定的集合是否支持高效的随机访问. ArrayList类和Vector类都实现了RandomAccess接口.
+ ListIterator接口定义了add,previous等方法
+ SortedSet和SortedMap接口暴露了用于排序的比较器对象
+ NavigableSet和NavigableMap包含了几个用于在有序集和映射表中查找和遍历的方法.TreeSet和TreeMap类实现了这个接口.

*** 集合框架的类
#+BEGIN_EXAMPLE
+ AbstractCollection
  - AbstractList
    - AbstractSequentialList
      - LinkedList
    - ArrayList
  - AbstractSet
    - HashSet
    - TreeSet
  - AbstractQueue
    - PriorityQueue
  - ArrayDeque
+ AbstractMap
  - HashMap
  - TreeMap
#+END_EXAMPLE
*** 视图
调用某方法时,返回的不是集合类型的对象,而是某个实现了框架接口的类对象,称为视图
**** 轻量级集包装器
Arrays类的静态方法asList可以将数组包装为List
#+BEGIN_SRC java
Card[] card = new Card[52];
//返回的对象不是ArrayList,而是List
List<Card> cardlist = Arrays.asList(cardDeck);
#+END_SRC
+ 任何改变数组大小的方法都会抛出UnsupportedOperationException异常
**** 子范围
可以为集合简历子范围视图
#+BEGIN_SRC java
List group2 = staff.subList(10,20);  //取[10,20)范围的元素
#+END_SRC
+ 可以将任何操作应用于子范围,且能反映到原列表
+ 对于有序集和有序映射表,可以使用排序顺序建立子范围
#+BEGIN_SRC java
SortedSet<E> subSet(E from, E to);
SortedSet<E> headSet(E to);
SortedSet<E> tailSet(E from);

SortedMap<E> subMap(K from, K to);
SortedMap<E> headMap(K to);
SortedMap<E> tailMap(K from);
#+END_SRC
**** 不可修改的视图
+ 可以使用下面6种方法获得不可修改的视图
#+BEGIN_EXAMPLE
1. Collections.unmodifiableCollection
2. Collections.unmodifiableList
3. Collections.unmodifiableSet
4. Collections.unmodifiableSortedSet
5. Collections.unmodifiableMap
6. Collections.unmodifiableSortedMap
#+END_EXAMPLE
+ Collections.unmodifiableList将返回一个实现List接口的类对象,所有更改器方法已经被重新定义为抛出一个unsupportedOperationException异常
**** 同步视图
+ 如果多个线程访问集合,必须确保集合不会被意外破坏
+ 类库设计者使用视图机制来确保常规集合的线程安全,而不是实现线程安全的集合类
+ 如Collections类的静态方法synchronizedMap可以将任何一个映射表转换成具有同步访问方法的Map
#+BEGIN_SRC java
Map<String, Employee> map = Collections.
           synchronizedMap(new HashMap<String,Employee>());
#+END_SRC
