html/java核心技术.html

<div id="outline-container-7-2-7" class="outline-4">
<h4 id="sec-7-2-7"><span class="section-number-4">7.2.7</span> 映射表</h4>
<div class="outline-text-4" id="text-7-2-7">

<ul>
<li>映射表用来存放键值对
</li>
<li>java类库为映射表提供了两个通用实现,这两个类都实现了Map接口
<ol>
<li>HashMap 对键进行散列
</li>
<li>TreeMap 用键的整体顺序对元素进行排序
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.Map&lt;K,V&gt;

V get(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>)                                    <span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#21462;&#38190;&#23545;&#24212;&#30340;&#20540;,&#27809;&#26377;&#21017;&#36820;&#22238;null     </span>
V put(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">value</span>)                           <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#38190;&#20540;&#23545;&#25554;&#20837;&#21040;&#26144;&#23556;&#34920;&#20013;            </span>
V putAll(Map&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">K</span>, ? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">V</span>&gt; entries) <span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#25351;&#23450;&#26144;&#23556;&#34920;&#20013;&#30340;&#26465;&#30446;&#25554;&#20837;&#21040;&#26144;&#23556;&#34920;&#20013;</span>
<span style="color: #228b22;">boolean</span> containsKey(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">key</span>)                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#26144;&#23556;&#34920;&#20013;&#26159;&#21542;&#24050;&#32463;&#26377;&#25351;&#23450;&#38190;          </span>
<span style="color: #228b22;">boolean</span> containsValue(<span style="color: #228b22;">Object</span> <span style="color: #a0522d;">value</span>)             <span style="color: #b22222;">//</span><span style="color: #b22222;">&#26144;&#23556;&#34920;&#20013;&#26159;&#21542;&#24050;&#32463;&#26377;&#25351;&#23450;&#20540;          </span>
Set&lt;<span style="color: #008b8b;">Map</span>.Entry&lt;K,V&gt;&gt; entrySet()                  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26144;&#23556;&#34920;&#20013;&#30340;&#38190;&#20540;&#23545;              </span>
Set&lt;K&gt; keySet()                                 <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26144;&#23556;&#34920;&#20013;&#30340;&#38190;                  </span>
Collection&lt;V&gt; values()                          <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26144;&#23556;&#34920;&#20013;&#30340;&#20540;                  </span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">Map</span>.Entry&lt;K,V&gt;

K getKey()              <span style="color: #b22222;">// </span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#26465;&#30446;&#30340;&#38190; </span>
V getValue()            <span style="color: #b22222;">// </span><span style="color: #b22222;">&#36820;&#22238;&#36825;&#20010;&#26465;&#30446;&#30340;&#20540; </span>
V setValue(<span style="color: #228b22;">V</span> <span style="color: #a0522d;">nuewValue</span>) <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35774;&#32622;&#26032;&#20540;,&#24182;&#36820;&#22238;&#26087;&#20540;</span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.HashMap&lt;K,V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#25955;&#21015;&#26144;&#23556;&#34920;</span>
HashMap()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#25955;&#21015;&#26144;&#23556;&#34920;,&#25351;&#23450;&#23481;&#37327;</span>
HashMap(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#25955;&#21015;&#26144;&#23556;&#34920;,&#25351;&#23450;&#23481;&#37327;,&#25351;&#23450;&#35013;&#22635;&#22240;&#23376;</span>
HashMap(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>,<span style="color: #228b22;">float</span> <span style="color: #a0522d;">loadFactor</span>)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.TreeMap&lt;K,V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#26641;&#26144;&#23556;&#34920;,&#25351;&#23450;&#27604;&#36739;&#22120;</span>
TreeMap(Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">K</span>&gt; c)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#26641;&#26144;&#23556;&#34920;,&#23558;&#25351;&#23450;&#26144;&#23556;&#34920;&#20013;&#30340;&#25152;&#26377;&#26465;&#30446;&#28155;&#21152;&#21040;&#26641;&#26144;&#23556;&#34920;&#20013;</span>
TreeMap(Map&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">K</span>,? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">V</span>&gt; entries)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#26641;&#26144;&#23556;&#34920;,&#23558;&#25351;&#23450;&#26377;&#24207;&#26144;&#23556;&#34920;&#20013;&#30340;&#25152;&#26377;&#26465;&#30446;&#28155;&#21152;&#21040;&#26641;&#26144;&#23556;&#34920;&#20013;,&#24182;&#20351;&#29992;&#20854;&#27604;&#36739;&#22120; </span>
TreeMap(SortedMap&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">K</span>,? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">V</span>&gt; entries)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.SortedMap&lt;K,V&gt;

Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">K</span>&gt; comparator() <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#27604;&#36739;&#22120;          </span>
K firstKey()                       <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26144;&#23556;&#34920;&#20013;&#26368;&#23567;&#20803;&#32032;</span>
K lastKey()                        <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#26144;&#23556;&#34920;&#20013;&#26368;&#22823;&#20803;&#32032;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 集合框架</h3>
<div class="outline-text-3" id="text-7-3">


</div>

<div id="outline-container-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> 集合框架的接口</h4>
<div class="outline-text-4" id="text-7-3-1">




<pre class="example">+ Iterable
  - Collection
    - List
    - Set
      - SorteSet
        - NavigableSet
    - Queue
      - Deque
+ Map
  - SortedMap
    - NavigableMap
+ Iterator
  - ListIterator
+ RandomAccess
</pre>

<ul>
<li>RandomAccess接口没有任何方法,但可以用来检测一个特定的集合是否支持高效的随机访问. ArrayList类和Vector类都实现了RandomAccess接口.
</li>
<li>ListIterator接口定义了add,previous等方法
</li>
<li>SortedSet和SortedMap接口暴露了用于排序的比较器对象
</li>
<li>NavigableSet和NavigableMap包含了几个用于在有序集和映射表中查找和遍历的方法.TreeSet和TreeMap类实现了这个接口.
</li>
</ul>


</div>

</div>

<div id="outline-container-7-3-2" class="outline-4">
<h4 id="sec-7-3-2"><span class="section-number-4">7.3.2</span> 集合框架的类</h4>
<div class="outline-text-4" id="text-7-3-2">




<pre class="example">+ AbstractCollection
  - AbstractList
    - AbstractSequentialList
      - LinkedList
    - ArrayList
  - AbstractSet
    - HashSet
    - TreeSet
  - AbstractQueue
    - PriorityQueue
  - ArrayDeque
+ AbstractMap
  - HashMap
  - TreeMap
</pre>

</div>

</div>

<div id="outline-container-7-3-3" class="outline-4">
<h4 id="sec-7-3-3"><span class="section-number-4">7.3.3</span> 视图</h4>
<div class="outline-text-4" id="text-7-3-3">

<p>调用某方法时,返回的不是集合类型的对象,而是某个实现了框架接口的类对象,称为视图
</p><ul>
<li id="sec-7-3-3-1">轻量级集包装器<br/>
Arrays类的静态方法asList可以将数组包装为List



<pre class="src src-java"><span style="color: #228b22;">Card</span>[] <span style="color: #a0522d;">card</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Card</span>[52];
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#30340;&#23545;&#35937;&#19981;&#26159;ArrayList,&#32780;&#26159;List</span>
List&lt;Card&gt; cardlist = Arrays.asList(cardDeck);
</pre>

<ul>
<li>任何改变数组大小的方法都会抛出UnsupportedOperationException异常
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-7-3-3-2">子范围<br/>
可以为集合建立子范围视图



<pre class="src src-java"><span style="color: #228b22;">List</span> <span style="color: #a0522d;">group2</span> = staff.subList(10,20);  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21462;[10,20)&#33539;&#22260;&#30340;&#20803;&#32032;</span>
</pre>

<ul>
<li>可以将任何操作应用于子范围,且能反映到原列表
</li>
<li>对于有序集和有序映射表,可以使用排序顺序建立子范围
</li>
</ul>




<pre class="src src-java">SortedSet&lt;E&gt; subSet(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">from</span>, <span style="color: #228b22;">E</span> <span style="color: #a0522d;">to</span>);
SortedSet&lt;E&gt; headSet(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">to</span>);
SortedSet&lt;E&gt; tailSet(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">from</span>);

SortedMap&lt;E&gt; subMap(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">from</span>, <span style="color: #228b22;">K</span> <span style="color: #a0522d;">to</span>);
SortedMap&lt;E&gt; headMap(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">to</span>);
SortedMap&lt;E&gt; tailMap(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">from</span>);
</pre>

</li>
</ul>
<ul>
<li id="sec-7-3-3-3">不可修改的视图<br/>
<ul>
<li>可以使用下面6种方法获得不可修改的视图
</li>
</ul>




<pre class="example">1. Collections.unmodifiableCollection
2. Collections.unmodifiableList
3. Collections.unmodifiableSet
4. Collections.unmodifiableSortedSet
5. Collections.unmodifiableMap
6. Collections.unmodifiableSortedMap
</pre>

<ul>
<li>Collections.unmodifiableList将返回一个实现List接口的类对象,所有更改器方法已经被重新定义为抛出一个unsupportedOperationException异常
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-7-3-3-4">同步视图<br/>
<ul>
<li>如果多个线程访问集合,必须确保集合不会被意外破坏
</li>
<li>类库设计者使用视图机制来确保常规集合的线程安全,而不是实现线程安全的集合类
</li>
<li>如Collections类的静态方法synchronizedMap可以将任何一个映射表转换成具有同步访问方法的Map
</li>
</ul>




<pre class="src src-java">Map&lt;String, Employee&gt; map = Collections.
           synchronizedMap(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">HashMap</span>&lt;String,Employee&gt;());
</pre>

</li>
</ul>
</div>

</div>
