src/java核心技术.org
*** 集合与数组之间的转换
#+BEGIN_SRC java
String[] values = ...;
HashSet<String> staff = new HashSet<String>(Arrays.asList(values));

Object[] values = staff.toArray(); //只能产生一个对象数组,不能使用类型转换
String[] values = (String[])staff.toArray(); //error!

String[] values = staff.toArray(new String[0]); //解决的办法
#+END_SRC
** 算法
*** 排序和混排
#+BEGIN_SRC java
java.util.Collections

//使用稳定的排序算法对列表中的元素进行稳定排序,时间复杂度是O(nlogn)
static <T extends Comparable<? super T>> void sort(List<T> elements)
static <T> void sort(List<T> elements, Comparator<? super T> c)

//随机地打乱列表中的元素
static void shuffle(List<?> elements)
static void shuffle(List<?> elements, Random r)

//返回一个比较器,它是Camparable接口的compareTo方法规定的顺序的逆序
static <T> Comparator<T> reverseOrder()

//返回一个比较器,它是comp规定的顺序的逆序
static <T> Comparator<T> reverseOrder(Comparator<T> comp)
#+END_SRC
+ java中的排序,直接将所有元素转入一个数组,并使用一种归并排序的变体对数组进行排序,然后将排序后的序列复制会列表
+ 归并排序的一个主要优点是:稳定
+ 需要排序的列表必须是可修改的,不必是可以改变大小的
+ 如果列表支持set,则是可修改的;如果列表支持add和remove,则是可改变大小的
*** 二分查找
#+BEGIN_SRC java
java.util.Collections

/*从有序列表中搜索一个键,
若元素扩展了AbstractSequentialList类,将采用线性搜索,否则采用二分查找
如果列表中不存在这个键,将返回负值i,
这种情况下,应该将这个键插入到列表索引-i-1位置上,以保持列表的有序性*/
static <T extends Comparable<? super T>> int binarySearch(List<T> elements, T key)
static <T> int binarySearch(List<T> elements, T key, Comparator<? super T> c)
#+END_SRC
+ 集合必须是排好序的,否则将返回错误的答案
*** 简单算法
#+BEGIN_SRC java
java.util.Collections

//返回集合中最小/大的元素
static <T extends Comparable<? super T>> T min(Collection<T> elements)
static <T extends Comparable<? super T>> T max(Collection<T> elements)
static <T> T min(Collection<T> elements, Comparator<? super T> c)
static <T> T max(Collection<T> elements, Comparator<? super T> c)

//将元列表中所有元素复制到目标列表的相应位置上
static <T> void copy(List<? super T> to, List<T> from)

//将列表中所有位置设置为相同的值
static <T> void fill(List<? super T> l, T value)

//将所有的值添加到集合中
static <T> boolean addAll(Collection<? super T> c, T... values)

//用newValue替换所有值为oldValue的元素
static <T> boolean replaceAll(List<T> l, T oldValue, T newValue)

//返回l中第一个或最后一个等于s子列表的索引,若不存在返回-1
static int indexOfSubList(List<?> l, List<?> s)
static int lastIndexOfSubList(List<?> l, List<?> s)

//交换给定偏移量的两个元素
static void swap(List<?> l, int i, int j)

//逆置列表中元素的顺序
static void reverse(List<?> l)

//旋转列表中的元素,将i移动到(i+d)%l.size()
static void rotate(List<?> l, int d)

//返回c中与对象o相同的元素个数
static int frequency(Collection<?> c, Object o)

//如果两个集合没有共同元素,返回true
boolean disjoint(Collection<?> c2, Collection<?> c2)
#+END_SRC
* 多线程
