html/java核心技术.html

<div id="outline-container-7-3-4" class="outline-4">
<h4 id="sec-7-3-4"><span class="section-number-4">7.3.4</span> 集合与数组之间的转换</h4>
<div class="outline-text-4" id="text-7-3-4">




<pre class="src src-java"><span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">values</span> = ...;
HashSet&lt;String&gt; staff = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">HashSet</span>&lt;String&gt;(Arrays.asList(values));

<span style="color: #228b22;">Object</span>[] <span style="color: #a0522d;">values</span> = staff.toArray(); <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21482;&#33021;&#20135;&#29983;&#19968;&#20010;&#23545;&#35937;&#25968;&#32452;,&#19981;&#33021;&#20351;&#29992;&#31867;&#22411;&#36716;&#25442;</span>
<span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">values</span> = (<span style="color: #228b22;">String</span>[])staff.toArray(); <span style="color: #b22222;">//</span><span style="color: #b22222;">error!</span>

<span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">values</span> = staff.toArray(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">String</span>[0]); <span style="color: #b22222;">//</span><span style="color: #b22222;">&#35299;&#20915;&#30340;&#21150;&#27861;</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 算法</h3>
<div class="outline-text-3" id="text-7-4">


</div>

<div id="outline-container-7-4-1" class="outline-4">
<h4 id="sec-7-4-1"><span class="section-number-4">7.4.1</span> 排序和混排</h4>
<div class="outline-text-4" id="text-7-4-1">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Collections</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20351;&#29992;&#31283;&#23450;&#30340;&#25490;&#24207;&#31639;&#27861;&#23545;&#21015;&#34920;&#20013;&#30340;&#20803;&#32032;&#36827;&#34892;&#31283;&#23450;&#25490;&#24207;,&#26102;&#38388;&#22797;&#26434;&#24230;&#26159;O(nlogn)</span>
<span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt;&gt; <span style="color: #228b22;">void</span> sort(List&lt;T&gt; elements)
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">void</span> sort(List&lt;T&gt; elements, Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; c)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#38543;&#26426;&#22320;&#25171;&#20081;&#21015;&#34920;&#20013;&#30340;&#20803;&#32032;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> shuffle(List&lt;?&gt; elements)
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> shuffle(List&lt;?&gt; elements, <span style="color: #228b22;">Random</span> <span style="color: #a0522d;">r</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#27604;&#36739;&#22120;,&#23427;&#26159;Camparable&#25509;&#21475;&#30340;compareTo&#26041;&#27861;&#35268;&#23450;&#30340;&#39034;&#24207;&#30340;&#36870;&#24207;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; Comparator&lt;T&gt; reverseOrder()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#27604;&#36739;&#22120;,&#23427;&#26159;comp&#35268;&#23450;&#30340;&#39034;&#24207;&#30340;&#36870;&#24207;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; Comparator&lt;T&gt; reverseOrder(Comparator&lt;T&gt; comp)
</pre>

<ul>
<li>java中的排序,直接将所有元素转入一个数组,并使用一种归并排序的变体对数组进行排序,然后将排序后的序列复制会列表
</li>
<li>归并排序的一个主要优点是:稳定
</li>
<li>需要排序的列表必须是可修改的,不必是可以改变大小的
</li>
<li>如果列表支持set,则是可修改的;如果列表支持add和remove,则是可改变大小的
</li>
</ul>

</div>

</div>

<div id="outline-container-7-4-2" class="outline-4">
<h4 id="sec-7-4-2"><span class="section-number-4">7.4.2</span> 二分查找</h4>
<div class="outline-text-4" id="text-7-4-2">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Collections</span>

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#20174;&#26377;&#24207;&#21015;&#34920;&#20013;&#25628;&#32034;&#19968;&#20010;&#38190;,</span>
<span style="color: #b22222;">&#33509;&#20803;&#32032;&#25193;&#23637;&#20102;AbstractSequentialList&#31867;,&#23558;&#37319;&#29992;&#32447;&#24615;&#25628;&#32034;,&#21542;&#21017;&#37319;&#29992;&#20108;&#20998;&#26597;&#25214;</span>
<span style="color: #b22222;">&#22914;&#26524;&#21015;&#34920;&#20013;&#19981;&#23384;&#22312;&#36825;&#20010;&#38190;,&#23558;&#36820;&#22238;&#36127;&#20540;i,</span>
<span style="color: #b22222;">&#36825;&#31181;&#24773;&#20917;&#19979;,&#24212;&#35813;&#23558;&#36825;&#20010;&#38190;&#25554;&#20837;&#21040;&#21015;&#34920;&#32034;&#24341;-i-1&#20301;&#32622;&#19978;,&#20197;&#20445;&#25345;&#21015;&#34920;&#30340;&#26377;&#24207;&#24615;*/</span>
<span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt;&gt; <span style="color: #228b22;">int</span> binarySearch
                                             (
                                             List&lt;T&gt; elements, 
                                             <span style="color: #228b22;">T</span> <span style="color: #a0522d;">key</span>
                                             )
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">int</span> binarySearch(List&lt;T&gt; elements, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">key</span>, Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; c)
</pre>

<ul>
<li>集合必须是排好序的,否则将返回错误的答案
</li>
</ul>

</div>

</div>

<div id="outline-container-7-4-3" class="outline-4">
<h4 id="sec-7-4-3"><span class="section-number-4">7.4.3</span> 简单算法</h4>
<div class="outline-text-4" id="text-7-4-3">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #228b22;">Collections</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#38598;&#21512;&#20013;&#26368;&#23567;/&#22823;&#30340;&#20803;&#32032;</span>
<span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt;&gt; T min(Collection&lt;T&gt; elements)
<span style="color: #a020f0;">static</span> &lt;T <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">Comparable</span>&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt;&gt; T max(Collection&lt;T&gt; elements)
<span style="color: #a020f0;">static</span> &lt;T&gt; T min(Collection&lt;T&gt; elements, Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; c)
<span style="color: #a020f0;">static</span> &lt;T&gt; T max(Collection&lt;T&gt; elements, Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; c)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#20803;&#21015;&#34920;&#20013;&#25152;&#26377;&#20803;&#32032;&#22797;&#21046;&#21040;&#30446;&#26631;&#21015;&#34920;&#30340;&#30456;&#24212;&#20301;&#32622;&#19978;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">void</span> copy(List&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; to, List&lt;T&gt; from)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#21015;&#34920;&#20013;&#25152;&#26377;&#20301;&#32622;&#35774;&#32622;&#20026;&#30456;&#21516;&#30340;&#20540;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">void</span> fill(List&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; l, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">value</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#25152;&#26377;&#30340;&#20540;&#28155;&#21152;&#21040;&#38598;&#21512;&#20013;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">boolean</span> addAll(Collection&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">T</span>&gt; c, <span style="color: #228b22;">T</span>... <span style="color: #a0522d;">values</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;newValue&#26367;&#25442;&#25152;&#26377;&#20540;&#20026;oldValue&#30340;&#20803;&#32032;</span>
<span style="color: #a020f0;">static</span> &lt;T&gt; <span style="color: #228b22;">boolean</span> replaceAll(List&lt;T&gt; l, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">oldValue</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">newValue</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;l&#20013;&#31532;&#19968;&#20010;&#25110;&#26368;&#21518;&#19968;&#20010;&#31561;&#20110;s&#23376;&#21015;&#34920;&#30340;&#32034;&#24341;,&#33509;&#19981;&#23384;&#22312;&#36820;&#22238;-1</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> indexOfSubList(List&lt;?&gt; l, List&lt;?&gt; s)
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> lastIndexOfSubList(List&lt;?&gt; l, List&lt;?&gt; s)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20132;&#25442;&#32473;&#23450;&#20559;&#31227;&#37327;&#30340;&#20004;&#20010;&#20803;&#32032;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> swap(List&lt;?&gt; l, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36870;&#32622;&#21015;&#34920;&#20013;&#20803;&#32032;&#30340;&#39034;&#24207;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> reverse(List&lt;?&gt; l)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26059;&#36716;&#21015;&#34920;&#20013;&#30340;&#20803;&#32032;,&#23558;i&#31227;&#21160;&#21040;(i+d)%l.size()</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> rotate(List&lt;?&gt; l, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">d</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;c&#20013;&#19982;&#23545;&#35937;o&#30456;&#21516;&#30340;&#20803;&#32032;&#20010;&#25968;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> frequency(Collection&lt;?&gt; c, <span style="color: #228b22;">Object</span> <span style="color: #a0522d;">o</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#20004;&#20010;&#38598;&#21512;&#27809;&#26377;&#20849;&#21516;&#20803;&#32032;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> disjoint(Collection&lt;?&gt; c2, Collection&lt;?&gt; c2)
</pre>

</div>
</div>
</div>

</div>
