src/java核心技术.org
** 线程概念
+ 多进程与多线程的区别
  1. 每个进程拥有自己的一套变量,而线程则共享数据
  2. 线程之间通信比进程之间通信更有效,更容易
  3. 线程比进程更"轻量级",创建,撤销一个线程比进程的开销小的多
+ 在一个单独的线程中执行一个任务的步骤
#+BEGIN_SRC java
//将任务代码移到实现了Runnable接口的类的run方法中
class MyRunnable implements Runnable
{
    public void run(){
        ...
    }
}
//创建一个类对象
Runnable r = new MyRunnable();
//由Runnable创建一个Thread对象
Thread t = new Thread(r);
//启动线程
t.start();
#+END_SRC
+ 不要调用Thread类或Runnable对象的run方法,直接调用run方法只会执行同一个线程中的任务,而不会启动新线程,应该调用Thread.start方法
** 中断线程
+ 线程终止的情况
  1. 线程的run方法执行方法体中最后一条语句后返回
  2. 出现了在方法中没有捕获的异常
+ stop方法和suspend方法已被弃用
*** interrupt方法
+ interrupt方法可以用来请求终止线程
+ 对一个线程调用interrupt方法时,线程的 /中断状态/ 将被置位
+ 可以通过Threa.currentThread.isInterruppted方法判断中断状态是否被置位
+ 线程被阻塞时无法检测中断状态,将会产生InterruptedException异常
#+BEGIN_SRC java
java.lang.Thread

//向线程发送中断请求,线程的中断状态置位,如果线程被阻塞,将抛出InterruptedException异常
void interrupt()

//测试当前线程是否被中断,并复位中断状态
static boolean interrupted()

//测试当前线程是否被中断,不会复位中断状态
boolean isInterrupted()

//返回代表当前执行线程的Thread对象
static Thread currentThread()
#+END_SRC
** 线程状态
+ 线程有6种状态
  1. new 当用new操作符创建一个新线程时,状态是new
  2. runnable 当调用start方法,状态是runnable(注意,一个可runnable的线程可能正在运行,也可能没有运行,是否正在运行取决于调度器的调度)
  3. blocked 当线程试图获得一个正被其他线程持有的对象锁,状态是blocked
  4. waiting 当线程等待另一个线程通知调度器一个条件时,状态是waiting(如wait和join方法)
  5. timed waiting 当线程调用了有超时参数的方法时,状态是timed waiting(如Thread.sleep方法)
  6. terminated 当线程正常退出自然死亡时,或者因为一个没有捕获的异常意外死亡时,状态是terminated
#+BEGIN_SRC java
java.lang.Thread

//等待指定的线程死亡
void join()

//等待指定的线程死亡或者经过指定的毫秒数
void join(long millis)

//得到这一线程的状态
Thread.State getState()
#+END_SRC
** 线程属性
*** 线程优先级
+ 默认情况下,一个线程继承其父线程的优先级
+ 可以用setPriority设置线程优先级
#+BEGIN_SRC java
java.lang.Thread

//设置线程的优先级,优先级必须在Thread.MIN_PRIORITY与Thread.MAX_PRIORITY之间
void setPriority(int newPriority)

//线程的最小(1),默认(5),最高优先级(10)
static int MIN_PRIORITY
static int MAX_PRIORITY
static int NORM_PRIORITY

//导致当前执行线程让步执行权
static void yield()
#+END_SRC
*** 守护线程
+ 守护线程的用途是为其他线程提供服务
+ 当只剩下守护线程时,虚拟机就退出了
#+BEGIN_SRC java
java.lang.Thread

//标志该线程为守护线程或用户线程,必须在线程启动之前调用
void setDaemon(boolean isDaemon)
#+END_SRC
** 同步
*** 锁对象
+ 用ReentrantLock保护代码块的基本结构如下
#+BEGIN_SRC java
myLock.lock();
try{
    ...
}
finally{
    myLock.unlock();
}
#+END_SRC
+ 这一结构确保任何时刻只有一个线程进入临界区
+ 一旦一个线程封锁了锁对象,当其他线程调用lock时,将被阻塞,直到第一个线程释放锁对象
+ 锁是可重入的,一个线程可以重复获得已经持有的锁,锁会保持一个计数器来跟踪lock方法的嵌套调用,当计数器变为0时线程释放锁.
#+BEGIN_SRC java
java.util.concurrent.locks.Lock

//获取锁
void lock()

//释放锁
void unlock()
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.locks.ReentrantLock

//构建一个可重入锁
ReentrantLock()

//构建一个带有公平策略的可重入锁,一个公平锁偏爱等待时间最长的线程
ReentrantLock(boolean fair)
#+END_SRC
*** 条件对象
+ 可以用newCondition方法获得一个条件对象
+ 条件对象调用await方法时,当前线程被阻塞,并放弃锁,直到另一个线程调用同一条件对象的signalAll方法
+ signalAll方法调用会重新激活因为这一条件而等待的所有线程,它们再次成为runnable状态
+ 它们中的某个将获得该锁并从被阻塞的地方继续执行
+ 另一个方法signal,则会随机解除等待集合中的某个线程的阻塞状态
#+BEGIN_SRC java
java.util.concurrent.locks.Lock

//返回一个与该锁相关的条件对象
Condition newCondition()
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.locks.Condition

//将线程放到条件的等待集合中
void await()

//解除该条件等待集合中的素有线程的阻塞状态
void signalAll()

//从该条件的等待集中随机地选择一个线程,解除其阻塞状态
void signal()
#+END_SRC
