html/java核心技术.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 多线程</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 线程概念</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>多进程与多线程的区别
<ol>
<li>每个进程拥有自己的一套变量,而线程则共享数据
</li>
<li>线程之间通信比进程之间通信更有效,更容易
</li>
<li>线程比进程更"轻量级",创建,撤销一个线程比进程的开销小的多
</li>
</ol>

</li>
<li>在一个单独的线程中执行一个任务的步骤
</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#20219;&#21153;&#20195;&#30721;&#31227;&#21040;&#23454;&#29616;&#20102;Runnable&#25509;&#21475;&#30340;&#31867;&#30340;run&#26041;&#27861;&#20013;</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyRunnable</span> <span style="color: #a020f0;">implements</span> <span style="color: #228b22;">Runnable</span>
{
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">run</span>(){
        ...
    }
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21019;&#24314;&#19968;&#20010;&#31867;&#23545;&#35937;</span>
<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">r</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">MyRunnable</span>();
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#30001;Runnable&#21019;&#24314;&#19968;&#20010;Thread&#23545;&#35937;</span>
<span style="color: #228b22;">Thread</span> <span style="color: #a0522d;">t</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Thread</span>(r);
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21551;&#21160;&#32447;&#31243;</span>
t.start();
</pre>

<ul>
<li>不要调用Thread类或Runnable对象的run方法,直接调用run方法只会执行同一个线程中的任务,而不会启动新线程,应该调用Thread.start方法
</li>
</ul>

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 中断线程</h3>
<div class="outline-text-3" id="text-8-2">

<ul>
<li>线程终止的情况
<ol>
<li>线程的run方法执行方法体中最后一条语句后返回
</li>
<li>出现了在方法中没有捕获的异常
</li>
</ol>

</li>
<li>stop方法和suspend方法已被弃用
</li>
</ul>


</div>

<div id="outline-container-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> interrupt方法</h4>
<div class="outline-text-4" id="text-8-2-1">

<ul>
<li>interrupt方法可以用来请求终止线程
</li>
<li>对一个线程调用interrupt方法时,线程的 <i>中断状态</i> 将被置位
</li>
<li>可以通过Thread.currentThread.isInterruppted方法判断中断状态是否被置位
</li>
<li>线程被阻塞时无法检测中断状态,将会产生InterruptedException异常
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Thread

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#21521;&#32447;&#31243;&#21457;&#36865;&#20013;&#26029;&#35831;&#27714;,&#32447;&#31243;&#30340;&#20013;&#26029;&#29366;&#24577;&#32622;&#20301;,&#22914;&#26524;&#32447;&#31243;&#34987;&#38459;&#22622;,&#23558;&#25243;&#20986;InterruptedException&#24322;&#24120;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">interrupt</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#27979;&#35797;&#24403;&#21069;&#32447;&#31243;&#26159;&#21542;&#34987;&#20013;&#26029;,&#24182;&#22797;&#20301;&#20013;&#26029;&#29366;&#24577;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">boolean</span> interrupted()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#27979;&#35797;&#24403;&#21069;&#32447;&#31243;&#26159;&#21542;&#34987;&#20013;&#26029;,&#19981;&#20250;&#22797;&#20301;&#20013;&#26029;&#29366;&#24577;</span>
<span style="color: #228b22;">boolean</span> isInterrupted()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#20195;&#34920;&#24403;&#21069;&#25191;&#34892;&#32447;&#31243;&#30340;Thread&#23545;&#35937;</span>
<span style="color: #a020f0;">static</span> Thread currentThread()
</pre>

</div>
</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 线程状态</h3>
<div class="outline-text-3" id="text-8-3">

<ul>
<li>线程有6种状态
<ol>
<li>new 当用new操作符创建一个新线程时,状态是new
</li>
<li>runnable 当调用start方法,状态是runnable(注意,一个可runnable的线程可能正在运行,也可能没有运行,是否正在运行取决于调度器的调度)
</li>
<li>blocked 当线程试图获得一个正被其他线程持有的对象锁,状态是blocked
</li>
<li>waiting 当线程等待另一个线程通知调度器一个条件时,状态是waiting(如wait和join方法)
</li>
<li>timed waiting 当线程调用了有超时参数的方法时,状态是timed waiting(如Thread.sleep方法)
</li>
<li>terminated 当线程正常退出自然死亡时,或者因为一个没有捕获的异常意外死亡时,状态是terminated
</li>
</ol>

</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Thread

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#25351;&#23450;&#30340;&#32447;&#31243;&#27515;&#20129;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">join</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#25351;&#23450;&#30340;&#32447;&#31243;&#27515;&#20129;&#25110;&#32773;&#32463;&#36807;&#25351;&#23450;&#30340;&#27627;&#31186;&#25968;</span>
<span style="color: #228b22;">void</span> join(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">millis</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#24471;&#21040;&#36825;&#19968;&#32447;&#31243;&#30340;&#29366;&#24577;</span>
<span style="color: #008b8b;">Thread</span>.State getState()
</pre>

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 线程属性</h3>
<div class="outline-text-3" id="text-8-4">


</div>

<div id="outline-container-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> 线程优先级</h4>
<div class="outline-text-4" id="text-8-4-1">

<ul>
<li>默认情况下,一个线程继承其父线程的优先级
</li>
<li>可以用setPriority设置线程优先级
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Thread

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35774;&#32622;&#32447;&#31243;&#30340;&#20248;&#20808;&#32423;,&#20248;&#20808;&#32423;&#24517;&#39035;&#22312;Thread.MIN_PRIORITY&#19982;Thread.MAX_PRIORITY&#20043;&#38388;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">setPriority</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">newPriority</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#32447;&#31243;&#30340;&#26368;&#23567;(1),&#40664;&#35748;(5),&#26368;&#39640;&#20248;&#20808;&#32423;(10)</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> MIN_PRIORITY
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> MAX_PRIORITY
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> NORM_PRIORITY

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23548;&#33268;&#24403;&#21069;&#25191;&#34892;&#32447;&#31243;&#35753;&#27493;&#25191;&#34892;&#26435;</span>
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> yield()
</pre>

</div>

</div>

<div id="outline-container-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> 守护线程</h4>
<div class="outline-text-4" id="text-8-4-2">

<ul>
<li>守护线程的用途是为其他线程提供服务
</li>
<li>当只剩下守护线程时,虚拟机就退出了
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Thread

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26631;&#24535;&#35813;&#32447;&#31243;&#20026;&#23432;&#25252;&#32447;&#31243;&#25110;&#29992;&#25143;&#32447;&#31243;,&#24517;&#39035;&#22312;&#32447;&#31243;&#21551;&#21160;&#20043;&#21069;&#35843;&#29992;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">setDaemon</span>(<span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">isDaemon</span>)
</pre>

</div>
</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 同步</h3>
<div class="outline-text-3" id="text-8-5">


</div>

<div id="outline-container-8-5-1" class="outline-4">
<h4 id="sec-8-5-1"><span class="section-number-4">8.5.1</span> 锁对象</h4>
<div class="outline-text-4" id="text-8-5-1">

<ul>
<li>用ReentrantLock保护代码块的基本结构如下
</li>
</ul>




<pre class="src src-java">myLock.lock();
<span style="color: #a020f0;">try</span>{
    ...
}
<span style="color: #a020f0;">finally</span>{
    myLock.unlock();
}
</pre>

<ul>
<li>这一结构确保任何时刻只有一个线程进入临界区
</li>
<li>一旦一个线程封锁了锁对象,当其他线程调用lock时,将被阻塞,直到第一个线程释放锁对象
</li>
<li>锁是可重入的,一个线程可以重复获得已经持有的锁,锁会保持一个计数器来跟踪lock方法的嵌套调用,当计数器变为0时线程释放锁.
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.Lock

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#21462;&#38145;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">lock</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#37322;&#25918;&#38145;</span>
<span style="color: #228b22;">void</span> unlock()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.<span style="color: #228b22;">ReentrantLock</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#24314;&#19968;&#20010;&#21487;&#37325;&#20837;&#38145;</span>
<span style="color: #0000ff;">ReentrantLock</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#24314;&#19968;&#20010;&#24102;&#26377;&#20844;&#24179;&#31574;&#30053;&#30340;&#21487;&#37325;&#20837;&#38145;,&#19968;&#20010;&#20844;&#24179;&#38145;&#20559;&#29233;&#31561;&#24453;&#26102;&#38388;&#26368;&#38271;&#30340;&#32447;&#31243;</span>
ReentrantLock(<span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">fair</span>)
</pre>

</div>

</div>

<div id="outline-container-8-5-2" class="outline-4">
<h4 id="sec-8-5-2"><span class="section-number-4">8.5.2</span> 条件对象</h4>
<div class="outline-text-4" id="text-8-5-2">

<ul>
<li>可以用newCondition方法获得一个条件对象
</li>
<li>条件对象调用await方法时,当前线程被阻塞,并放弃锁,直到另一个线程调用同一条件对象的signalAll方法
</li>
<li>signalAll方法调用会重新激活因为这一条件而等待的所有线程,它们再次成为runnable状态
</li>
<li>它们中的某个将获得该锁并从被阻塞的地方继续执行
</li>
<li>另一个方法signal,则会随机解除等待集合中的某个线程的阻塞状态
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.Lock

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#19982;&#35813;&#38145;&#30456;&#20851;&#30340;&#26465;&#20214;&#23545;&#35937;</span>
<span style="color: #228b22;">Condition</span> <span style="color: #0000ff;">newCondition</span>()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.Condition

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23558;&#32447;&#31243;&#25918;&#21040;&#26465;&#20214;&#30340;&#31561;&#24453;&#38598;&#21512;&#20013;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">await</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35299;&#38500;&#35813;&#26465;&#20214;&#31561;&#24453;&#38598;&#21512;&#20013;&#30340;&#25152;&#26377;&#32447;&#31243;&#30340;&#38459;&#22622;&#29366;&#24577;</span>
<span style="color: #228b22;">void</span> signalAll()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20174;&#35813;&#26465;&#20214;&#30340;&#31561;&#24453;&#38598;&#20013;&#38543;&#26426;&#22320;&#36873;&#25321;&#19968;&#20010;&#32447;&#31243;,&#35299;&#38500;&#20854;&#38459;&#22622;&#29366;&#24577;</span>
<span style="color: #228b22;">void</span> signal()
</pre>

</div>

</div>
