src/java核心技术.org
*** synchronized关键字
+ 每个对象都有一个内部锁
+ 如果一个方法用synchronized关键字声明,将使用对象的内部锁
#+BEGIN_SRC java
public synchronized void method(){
    ...
}
//等价于
public void method(){
    this.intrinsicLock.lock();
    try{
        ...
    }
    fanally{
        this.intrinsicLock.unlock();
    }
}
#+END_SRC
+ 内部对象锁只提供一个条件对象,wait方法添加一个线程到等待集合中,notifyAll/notify方法解除等待线程的阻塞状态
#+BEGIN_SRC java
java.lang.Object

//解除那些在该对象上调用wait方法的线程的阻塞状态
void notifyAll()

//随机选择一个在该对象上调用wait方法的线程,解除其阻塞状态
void notify()

//导致线程进入等待状态
void wait()
void wait(long millis)
void wait(long millis, int nanos)
#+END_SRC
*** 同步阻塞
#+BEGIN_SRC java
synchronized(obj){
    ...
}
#+END_SRC
*** valatile域
+ 使用现代处理器,多个线程对实例域的访问可能会导致出错
+ 但有时仅仅为了读写一个或两个实例域就使用同步,显得开销过大了
+ volatile关键字为实例域的同步访问提供了一种免锁机制
+ 如果声明一个域为volatile,那么编译器和虚拟机就知道该域是可能被另一个线程并发更新的
*** 锁测试与超时
tryLock方法视图申请一个锁,在成功获得锁后返回true,否则,立即返回false.
#+BEGIN_SRC java
if(myLock.tryLock()){
    try{
        ...
    }
    finally{
        myLock.unlock();
    }
}
else
    //do something else
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.locks.Lock

//尝试获得锁而没有发生阻塞,如果成功返回true
boolean tryLock()

//尝试获得锁,阻塞时间不会超过给定的值,如果成功返回true
boolean tryLock(long time, TimeUint unit)
#+END_SRC
*** 读写锁
+ 有时,可能会有很多线程读对象,而很少线程写对象
+ 读写锁允许对读者线程共享访问,而写者线程依然互斥访问.步骤
#+BEGIN_SRC java
//1. 构造一个ReentrantReadWriteLock对象
private ReentrantReadWriteLock rwl = new ReentrantReadWriteLock();
//2.抽取读锁和写锁
private Lock readLock = rwl.readLock();
private Lock writeLock = rwl.writeLock();
//3.对所有访问者加读锁
public double get()
{
    readLock.lock();
    try{...}
    finally{readLock.unlock();}
}
//4.对所有修改者加写锁
public void set(...){
    writeLock.lock();
    try{...}
    finally{writeLock.unlock();}    
}
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.locks.ReentrantReadWriteLock

//得到一个可以被多个读操作共用的读锁
Lock readLock()

//得到一个写锁,排斥所有其他的读操作和写操作
Lock writeLock()
#+END_SRC
** 阻塞队列
+ 对于许多线程问题,可以通过使用一个或多个队列以优雅且安全的方式将其形式化
+ 生产者线程向队列插入元素
+ 消费者线程则取出元素
+ 使用队列可以安全地从一个线程向另一个线程传递数据
#+BEGIN_SRC java
java.util.concurrent.BlockingQueue<E>

//添加元素,必要时阻塞
void put(E element)

//移除并返回头元素,必要时阻塞
E take()

//添加元素,成功则返回true,必要是阻塞,直至元素已经被添加或超时
boolean offer(E element, long time, TimeUnit unit)

//移除并返回头元素,必要时阻塞,直至元素可用或超时,失败是返回null
E poll(long time, TimeUnit unit)
#+END_SRC
** 线程安全的集合
