html/java核心技术.html

<div id="outline-container-8-5-3" class="outline-4">
<h4 id="sec-8-5-3"><span class="section-number-4">8.5.3</span> synchronized关键字</h4>
<div class="outline-text-4" id="text-8-5-3">

<ul>
<li>每个对象都有一个内部锁
</li>
<li>如果一个方法用synchronized关键字声明,将使用对象的内部锁
</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">synchronized</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">method</span>(){
    ...
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#20215;&#20110;</span>
<span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">method</span>(){
    <span style="color: #a020f0;">this</span>.intrinsicLock.lock();
    <span style="color: #a020f0;">try</span>{
        ...
    }
    fanally{
        <span style="color: #a020f0;">this</span>.intrinsicLock.unlock();
    }
}
</pre>

<ul>
<li>内部对象锁只提供一个条件对象,wait方法添加一个线程到等待集合中,notifyAll/notify方法解除等待线程的阻塞状态
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">lang</span>.Object

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#35299;&#38500;&#37027;&#20123;&#22312;&#35813;&#23545;&#35937;&#19978;&#35843;&#29992;wait&#26041;&#27861;&#30340;&#32447;&#31243;&#30340;&#38459;&#22622;&#29366;&#24577;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">notifyAll</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#22312;&#35813;&#23545;&#35937;&#19978;&#35843;&#29992;wait&#26041;&#27861;&#30340;&#32447;&#31243;,&#35299;&#38500;&#20854;&#38459;&#22622;&#29366;&#24577;</span>
<span style="color: #228b22;">void</span> notify()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23548;&#33268;&#32447;&#31243;&#36827;&#20837;&#31561;&#24453;&#29366;&#24577;</span>
<span style="color: #228b22;">void</span> wait()
<span style="color: #228b22;">void</span> wait(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">millis</span>)
<span style="color: #228b22;">void</span> wait(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">millis</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">nanos</span>)
</pre>

</div>

</div>

<div id="outline-container-8-5-4" class="outline-4">
<h4 id="sec-8-5-4"><span class="section-number-4">8.5.4</span> 同步阻塞</h4>
<div class="outline-text-4" id="text-8-5-4">




<pre class="src src-java"><span style="color: #a020f0;">synchronized</span>(obj){
    ...
}
</pre>

</div>

</div>

<div id="outline-container-8-5-5" class="outline-4">
<h4 id="sec-8-5-5"><span class="section-number-4">8.5.5</span> valatile域</h4>
<div class="outline-text-4" id="text-8-5-5">

<ul>
<li>使用现代处理器,多个线程对实例域的访问可能会导致出错
</li>
<li>但有时仅仅为了读写一个或两个实例域就使用同步,显得开销过大了
</li>
<li>volatile关键字为实例域的同步访问提供了一种免锁机制
</li>
<li>如果声明一个域为volatile,那么编译器和虚拟机就知道该域是可能被另一个线程并发更新的
</li>
</ul>

</div>

</div>

<div id="outline-container-8-5-6" class="outline-4">
<h4 id="sec-8-5-6"><span class="section-number-4">8.5.6</span> 锁测试与超时</h4>
<div class="outline-text-4" id="text-8-5-6">

<p>tryLock方法试图申请一个锁,在成功获得锁后返回true,否则,立即返回false.
</p>


<pre class="src src-java"><span style="color: #a020f0;">if</span>(myLock.tryLock()){
    <span style="color: #a020f0;">try</span>{
        ...
    }
    <span style="color: #a020f0;">finally</span>{
        myLock.unlock();
    }
}
<span style="color: #a020f0;">else</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">do something else</span>
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.Lock

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23581;&#35797;&#33719;&#24471;&#38145;&#32780;&#27809;&#26377;&#21457;&#29983;&#38459;&#22622;,&#22914;&#26524;&#25104;&#21151;&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> <span style="color: #0000ff;">tryLock</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23581;&#35797;&#33719;&#24471;&#38145;,&#38459;&#22622;&#26102;&#38388;&#19981;&#20250;&#36229;&#36807;&#32473;&#23450;&#30340;&#20540;,&#22914;&#26524;&#25104;&#21151;&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> tryLock(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUint</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>

</div>

<div id="outline-container-8-5-7" class="outline-4">
<h4 id="sec-8-5-7"><span class="section-number-4">8.5.7</span> 读写锁</h4>
<div class="outline-text-4" id="text-8-5-7">

<ul>
<li>有时,可能会有很多线程读对象,而很少线程写对象
</li>
<li>读写锁允许对读者线程共享访问,而写者线程依然互斥访问.步骤
</li>
</ul>




<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">1. &#26500;&#36896;&#19968;&#20010;ReentrantReadWriteLock&#23545;&#35937;</span>
<span style="color: #a020f0;">private</span> <span style="color: #228b22;">ReentrantReadWriteLock</span> <span style="color: #a0522d;">rwl</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ReentrantReadWriteLock</span>();
<span style="color: #b22222;">//</span><span style="color: #b22222;">2.&#25277;&#21462;&#35835;&#38145;&#21644;&#20889;&#38145;</span>
<span style="color: #a020f0;">private</span> <span style="color: #228b22;">Lock</span> <span style="color: #a0522d;">readLock</span> = rwl.readLock();
<span style="color: #a020f0;">private</span> <span style="color: #228b22;">Lock</span> <span style="color: #a0522d;">writeLock</span> = rwl.writeLock();
<span style="color: #b22222;">//</span><span style="color: #b22222;">3.&#23545;&#25152;&#26377;&#35775;&#38382;&#32773;&#21152;&#35835;&#38145;</span>
<span style="color: #a020f0;">public</span> <span style="color: #228b22;">double</span> <span style="color: #0000ff;">get</span>()
{
    readLock.lock();
    <span style="color: #a020f0;">try</span>{...}
    <span style="color: #a020f0;">finally</span>{readLock.unlock();}
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">4.&#23545;&#25152;&#26377;&#20462;&#25913;&#32773;&#21152;&#20889;&#38145;</span>
<span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">set</span>(...){
    writeLock.lock();
    <span style="color: #a020f0;">try</span>{...}
    <span style="color: #a020f0;">finally</span>{writeLock.unlock();}    
}
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #008b8b;">locks</span>.ReentrantReadWriteLock

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#24471;&#21040;&#19968;&#20010;&#21487;&#20197;&#34987;&#22810;&#20010;&#35835;&#25805;&#20316;&#20849;&#29992;&#30340;&#35835;&#38145;</span>
<span style="color: #228b22;">Lock</span> <span style="color: #0000ff;">readLock</span>()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#24471;&#21040;&#19968;&#20010;&#20889;&#38145;,&#25490;&#26021;&#25152;&#26377;&#20854;&#20182;&#30340;&#35835;&#25805;&#20316;&#21644;&#20889;&#25805;&#20316;</span>
Lock writeLock()
</pre>

</div>
</div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 阻塞队列</h3>
<div class="outline-text-3" id="text-8-6">

<ul>
<li>对于许多线程问题,可以通过使用一个或多个队列以优雅且安全的方式将其形式化
</li>
<li>生产者线程向队列插入元素
</li>
<li>消费者线程则取出元素
</li>
<li>使用队列可以安全地从一个线程向另一个线程传递数据
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.BlockingQueue&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#28155;&#21152;&#20803;&#32032;,&#24517;&#35201;&#26102;&#38459;&#22622;</span>
<span style="color: #228b22;">void</span> put(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31227;&#38500;&#24182;&#36820;&#22238;&#22836;&#20803;&#32032;,&#24517;&#35201;&#26102;&#38459;&#22622;</span>
E take()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#28155;&#21152;&#20803;&#32032;,&#25104;&#21151;&#21017;&#36820;&#22238;true,&#24517;&#35201;&#26102;&#38459;&#22622;,&#30452;&#33267;&#20803;&#32032;&#24050;&#32463;&#34987;&#28155;&#21152;&#25110;&#36229;&#26102;</span>
<span style="color: #228b22;">boolean</span> offer(<span style="color: #228b22;">E</span> <span style="color: #a0522d;">element</span>, <span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31227;&#38500;&#24182;&#36820;&#22238;&#22836;&#20803;&#32032;,&#24517;&#35201;&#26102;&#38459;&#22622;,&#30452;&#33267;&#20803;&#32032;&#21487;&#29992;&#25110;&#36229;&#26102;,&#22833;&#36133;&#26159;&#36820;&#22238;null</span>
E poll(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>

</div>
