src/java核心技术.org
*** 映射,集合和队列
java.util.concurrent包提供了映射,有序集合和队列的高效实现
+ 映射表
#+BEGIN_SRC java
java.util.concurrent.ConcurrentHashMap<K,V>

/*构造一个可以被多线程安全访问的散列映射表
参数 initialCapacity 初始容量 
参数 loadFactor 负载因子 
参数 concurrencyLevel并发写线程的估计数目*/
ConcurrentHashMap<K,V>()
ConcurrentHashMap<K,V>(int initialCapacity)
ConcurrentHashMap<K,V>(int initialCapacity, 
                       float loadFactor, 
                       int concurrencyLevel)

//如果映射表中没有指定的key,则插入key和value,并返回null.否则返回与key关联的value
V putIfAbsent(K key, V value)

//如果映射表中有指定的key,删除key和value并返回true,否则返回false
boolean remove(K key, V value)

//如果指定的key与oldValue向关联,用它与newValue关联,否则返回false
boolean replace(K key, V oldValue, V newValue)
#+END_SRC
+ 有序映射表
#+BEGIN_SRC java
java.util.concurrent.ConcurrentSkipListMap<K,V>

/*构造一个可以被多线程安全访问的有序映射表
第一个构造器要求键实现Comparable接口*/
ConcurrentSkipListMap<K,V>()
ConcurrentHashMap<K,V>(Comparator<? super K> comp)

//如果映射表中没有指定的key,则插入key和value,并返回null.否则返回与key关联的value
V putIfAbsent(K key, V value)

//如果映射表中有指定的key,删除key和value并返回true,否则返回false
boolean remove(K key, V value)

//如果指定的key与oldValue向关联,用它与newValue关联,否则返回false
boolean replace(K key, V oldValue, V newValue)
#+END_SRC
+ 队列(非阻塞)
#+BEGIN_SRC java
java.util.concurrent.ConcurrentLinkedQueue<E>

//构造一个可以被多线程安全访问的无边界非阻塞队列
ConcurrentLinkedQueue<E>()
#+END_SRC
+ 有序集合
#+BEGIN_SRC java
java.util.concurrent.ConcurrentLinkedQueue<E>

//构造一个可以被多线程安全访问的有序集合,第一个构造器要求元素实现Comparable接口
ConcurrentSkipListSet<E>()
ConcurrentSkipListSet<E>(Comparator<? super E> comp)
#+END_SRC
*** 写数组的拷贝
+ CopyOnWriteArrayList和CopyOnWriteArraySet是线程安全的集合
+ 所有的修改线程对底层数组进行复制
+ 当构建一个迭代器时,它包含一个对当前数组的引用,即使数组后来被修改了,迭代器仍然引用旧数组
** Callable与Future
+ Runnable封装一个异步运行的任务
+ Callable接口与Runnable类似,但是有返回值
#+BEGIN_SRC java
java.util.concurrent.Callable<V>

//运行一个将产生结果的任务
V call()
#+END_SRC
+ Future保存异步计算的结果
#+BEGIN_SRC java
java.util.concurrent.Future<V>

//获取结果,若没有结果可用,则阻塞直到得到结果或超时
V get()
V get(long time, TimeUnit unit)

//尝试取消任务的运行,如果任务已经开始且mayInterrupt为true,任务会被中断.
//如果成功执行了取消操作,返回true
boolean cancel(boolean mayInterrupt)

//如果任务在完成前被取消了,返回true
boolean isCancelled()

//如果任务结束,无论是否正常结束,返回true
boolean isDone
#+END_SRC
+ FutureTask包装器将Callable转换成Future和Runnable
#+BEGIN_SRC java
java.util.concurrent.FutureTask<V>

//构造一个既是Future<V>又是Runnable的对象
FutureTask(Callable<V> task)
FutureTask(Callable<V> task, V result)
#+END_SRC
#+BEGIN_SRC java
//应用举例
Callable<Integer> myComputation = ...;
FutureTask<Integer> task = new FutureTask<Integer>(myComputation);
Thread t = new Thread(task);  //it's Runnable
t.start();
...
Integer result = task.get();  //it's Future
#+END_SRC
** 执行器
