html/java核心技术.html

<div id="outline-container-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> 线程安全的集合</h3>
<div class="outline-text-3" id="text-8-7">


</div>

<div id="outline-container-8-7-1" class="outline-4">
<h4 id="sec-8-7-1"><span class="section-number-4">8.7.1</span> 映射,集合和队列</h4>
<div class="outline-text-4" id="text-8-7-1">

<p>java.util.concurrent包提供了映射,有序集合和队列的高效实现
</p><ul>
<li>映射表
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.ConcurrentHashMap&lt;K,V&gt;

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#21487;&#20197;&#34987;&#22810;&#32447;&#31243;&#23433;&#20840;&#35775;&#38382;&#30340;&#25955;&#21015;&#26144;&#23556;&#34920;</span>
<span style="color: #b22222;">&#21442;&#25968; initialCapacity &#21021;&#22987;&#23481;&#37327; </span>
<span style="color: #b22222;">&#21442;&#25968; loadFactor &#36127;&#36733;&#22240;&#23376; </span>
<span style="color: #b22222;">&#21442;&#25968; concurrencyLevel&#24182;&#21457;&#20889;&#32447;&#31243;&#30340;&#20272;&#35745;&#25968;&#30446;*/</span>
ConcurrentHashMap&lt;K,V&gt;()
ConcurrentHashMap&lt;K,V&gt;(<span style="color: #228b22;">int</span> initialCapacity)
ConcurrentHashMap&lt;K,V&gt;(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">initialCapacity</span>, 
                       <span style="color: #228b22;">float</span> <span style="color: #a0522d;">loadFactor</span>, 
                       <span style="color: #228b22;">int</span> <span style="color: #a0522d;">concurrencyLevel</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#26144;&#23556;&#34920;&#20013;&#27809;&#26377;&#25351;&#23450;&#30340;key,&#21017;&#25554;&#20837;key&#21644;value,&#24182;&#36820;&#22238;null.&#21542;&#21017;&#36820;&#22238;&#19982;key&#20851;&#32852;&#30340;value</span>
V putIfAbsent(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">value</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#26144;&#23556;&#34920;&#20013;&#26377;&#25351;&#23450;&#30340;key,&#21024;&#38500;key&#21644;value&#24182;&#36820;&#22238;true,&#21542;&#21017;&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> remove(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">value</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#25351;&#23450;&#30340;key&#19982;oldValue&#21521;&#20851;&#32852;,&#29992;&#23427;&#19982;newValue&#20851;&#32852;,&#21542;&#21017;&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> replace(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">oldValue</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">newValue</span>)
</pre>

<ul>
<li>有序映射表
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.ConcurrentSkipListMap&lt;K,V&gt;

<span style="color: #b22222;">/*</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#21487;&#20197;&#34987;&#22810;&#32447;&#31243;&#23433;&#20840;&#35775;&#38382;&#30340;&#26377;&#24207;&#26144;&#23556;&#34920;</span>
<span style="color: #b22222;">&#31532;&#19968;&#20010;&#26500;&#36896;&#22120;&#35201;&#27714;&#38190;&#23454;&#29616;Comparable&#25509;&#21475;*/</span>
ConcurrentSkipListMap&lt;K,V&gt;()
ConcurrentHashMap&lt;K,V&gt;(Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">K</span>&gt; comp)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#26144;&#23556;&#34920;&#20013;&#27809;&#26377;&#25351;&#23450;&#30340;key,&#21017;&#25554;&#20837;key&#21644;value,&#24182;&#36820;&#22238;null.&#21542;&#21017;&#36820;&#22238;&#19982;key&#20851;&#32852;&#30340;value</span>
V putIfAbsent(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">value</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#26144;&#23556;&#34920;&#20013;&#26377;&#25351;&#23450;&#30340;key,&#21024;&#38500;key&#21644;value&#24182;&#36820;&#22238;true,&#21542;&#21017;&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> remove(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">value</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#25351;&#23450;&#30340;key&#19982;oldValue&#21521;&#20851;&#32852;,&#29992;&#23427;&#19982;newValue&#20851;&#32852;,&#21542;&#21017;&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> replace(<span style="color: #228b22;">K</span> <span style="color: #a0522d;">key</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">oldValue</span>, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">newValue</span>)
</pre>

<ul>
<li>队列(非阻塞)
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.ConcurrentLinkedQueue&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#21487;&#20197;&#34987;&#22810;&#32447;&#31243;&#23433;&#20840;&#35775;&#38382;&#30340;&#26080;&#36793;&#30028;&#38750;&#38459;&#22622;&#38431;&#21015;</span>
ConcurrentLinkedQueue&lt;E&gt;()
</pre>

<ul>
<li>有序集合
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.ConcurrentLinkedQueue&lt;E&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#21487;&#20197;&#34987;&#22810;&#32447;&#31243;&#23433;&#20840;&#35775;&#38382;&#30340;&#26377;&#24207;&#38598;&#21512;,&#31532;&#19968;&#20010;&#26500;&#36896;&#22120;&#35201;&#27714;&#20803;&#32032;&#23454;&#29616;Comparable&#25509;&#21475;</span>
ConcurrentSkipListSet&lt;E&gt;()
ConcurrentSkipListSet&lt;E&gt;(Comparator&lt;? <span style="color: #a020f0;">super</span> <span style="color: #228b22;">E</span>&gt; comp)
</pre>

</div>

</div>

<div id="outline-container-8-7-2" class="outline-4">
<h4 id="sec-8-7-2"><span class="section-number-4">8.7.2</span> 写数组的拷贝</h4>
<div class="outline-text-4" id="text-8-7-2">

<ul>
<li>CopyOnWriteArrayList和CopyOnWriteArraySet是线程安全的集合
</li>
<li>所有的修改线程对底层数组进行复制
</li>
<li>当构建一个迭代器时,它包含一个对当前数组的引用,即使数组后来被修改了,迭代器仍然引用旧数组
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> Callable与Future</h3>
<div class="outline-text-3" id="text-8-8">

<ul>
<li>Runnable封装一个异步运行的任务
</li>
<li>Callable接口与Runnable类似,但是有返回值
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.Callable&lt;V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36816;&#34892;&#19968;&#20010;&#23558;&#20135;&#29983;&#32467;&#26524;&#30340;&#20219;&#21153;</span>
V call()
</pre>

<ul>
<li>Future保存异步计算的结果
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.Future&lt;V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#33719;&#21462;&#32467;&#26524;,&#33509;&#27809;&#26377;&#32467;&#26524;&#21487;&#29992;,&#21017;&#38459;&#22622;&#30452;&#21040;&#24471;&#21040;&#32467;&#26524;&#25110;&#36229;&#26102;</span>
V get()
V get(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23581;&#35797;&#21462;&#28040;&#20219;&#21153;&#30340;&#36816;&#34892;,&#22914;&#26524;&#20219;&#21153;&#24050;&#32463;&#24320;&#22987;&#19988;mayInterrupt&#20026;true,&#20219;&#21153;&#20250;&#34987;&#20013;&#26029;.</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#25104;&#21151;&#25191;&#34892;&#20102;&#21462;&#28040;&#25805;&#20316;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> cancel(<span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">mayInterrupt</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#20219;&#21153;&#22312;&#23436;&#25104;&#21069;&#34987;&#21462;&#28040;&#20102;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> isCancelled()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#22914;&#26524;&#20219;&#21153;&#32467;&#26463;,&#26080;&#35770;&#26159;&#21542;&#27491;&#24120;&#32467;&#26463;,&#36820;&#22238;true</span>
<span style="color: #228b22;">boolean</span> isDone
</pre>

<ul>
<li>FutureTask包装器将Callable转换成Future和Runnable
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.FutureTask&lt;V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#26082;&#26159;Future&lt;V&gt;&#21448;&#26159;Runnable&#30340;&#23545;&#35937;</span>
FutureTask(Callable&lt;V&gt; task)
FutureTask(Callable&lt;V&gt; task, <span style="color: #228b22;">V</span> <span style="color: #a0522d;">result</span>)
</pre>


<pre class="src src-java"><span style="color: #b22222;">//</span><span style="color: #b22222;">&#24212;&#29992;&#20030;&#20363;</span>
Callable&lt;Integer&gt; myComputation = ...;
FutureTask&lt;Integer&gt; task = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">FutureTask</span>&lt;Integer&gt;(myComputation);
<span style="color: #228b22;">Thread</span> <span style="color: #a0522d;">t</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Thread</span>(task);  <span style="color: #b22222;">//</span><span style="color: #b22222;">it's Runnable</span>
t.start();
...
Integer result = task.get();  <span style="color: #b22222;">//</span><span style="color: #b22222;">it's Future</span>
</pre>

</div>

</div>
