src/java核心技术.org
*** 线程池
使用线程池的步骤
1. 调用Executors类中的静态方法newCachedThreadPool或newFixeThreadPool
2. 调用submit提交Runnable或Callable对象
3. 如果想取消任务,或产看任务状态,就要保存好submit返回的Future对象
4. 当不再提交任务时,调用shutdown
#+BEGIN_SRC java
java.util.concurrent.Executors

//返回一个线程池,参数指定线程数
ExecutorService newFixedThreadPool(int threads)

//返回一个带缓存的线程池,该池在必要时创建线程,线程空闲60之后终止
ExecutorService newCachedThreadPool()

//返回一个执行器,它在一个单一的线程中一次执行各个任务
ExecutorService newSingleThreadExecutor()
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.ExecutorService

//提交指定的任务取执行
Future<T> submit(Callable<T> task)
Future<T> submit(Runnable task, T result)   //get方法在完成时返回指定的result对象
Future<?> submit(Runnable task)             //get方法在完成时返回null

//关闭服务,会先完成已经提交的任务而不再接收新的任务
void shutdown()
#+END_SRC
*** 预订执行
#+BEGIN_SRC java
java.util.concurrent.Executors

//返回一个线程池,参数指定线程数
ScheduledExecutorService newScheduledThreadPool(int threads)

//返回一个执行器,在一个单独线程中调度任务
ScheduledExecutorService newSingleThreadScheduledExecutor()
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.ScheduledExecutorService

//预订在指定的时间之后执行任务
ScheduledFuture<V> schedule(Callable<V> task, 
                            long time,
                            TimeUnit unit)
ScheduledFuture<?> schedule(Runnable task, 
                            long time,
                            TimeUnit unit)

//预订在初始的延迟结束后,周期性地运行指定任务,周期为period
ScheduledFuture<?> scheduleAtFixedRate(Runnable task,
                                       long initialDelay, 
                                       long period,
                                       TimeUnit unit)

//预订在初始的延迟结束后,周期性地运行指定任务,上一次调用结束和下一次调用开始之间有固定延迟
ScheduledFuture<?> scheduleWithFixedDelay(Runnable task,
                                          long initialDelay,
                                          long delay,
                                          TimeUnit unit)
#+END_SRC
*** 控制任务组
执行器除了可以作为线程池使用,还可以用来控制一组相关任务
+ invokeAny同时运行多个任务,而只返回最先完成的任务的结果.
+ invokeAll同时运行多个任务,返回一个Future列表
#+BEGIN_SRC java
List<Callable<T>> tasks = ...;
List<Future<T>> results = executor.invokeAll(tasks);
for(Future<T> result:results)
    ...
#+END_SRC
+ invokeAll的缺陷在于如果第一个任务恰巧花去了很多时间,则可能不得不进行等待
+ ExecutorCompletionService解决了这个问题,其take方法将返回一个已完成的结果
#+BEGIN_SRC java
ExecutorCompletionService service = new ExecutorCompletionService(executor);
for(Callable<T> task:tasks) service.submit(task);
for(int i=0;i<tasks.size();i++)
    processFuther(service.take().get());
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.ExecutorService

//执行给定的任务,返回其中一个任务的结果
T invokeAny(Collection<Callable<T>> tasks)
T invokeAny(Collection<Callable<T>> tasks, long timeout, TimeUnit unit)

//执行给定的任务,返回所有任务的结果
List<Future<T>> invokeAll(Collection<Callable<T>> tasks)
List<Future<T>> invokeAll(Collection<Callable<T>> tasks, 
                          long timeout, TimeUnit unit)
#+END_SRC
#+BEGIN_SRC java
java.util.concurrent.ExecutorCompletionService

//构造一个执行器完成服务来收集给定执行器的结果
ExecutorCompletionService(Executor e)

//提交一个任务给底层的执行器
Future<T> submit(Callable<T> task)
Future<T> submit(Runnable task, T result)

//移除下一个已完成的结果,如果没有则阻塞
Future<T> take()

//移除下一个已完成的结果,如果没有则返回null
Future<T> poll()
Future<T> poll(long time, TimeUnit unit)
#+END_SRC
** 同步器
java预置符合某些行为模式的库类,如果有一个相互合作的线程满足这些行为模式之一,那么应该直接重用合适的库类,而不要试图提供手工的锁与条件的集合
