html/java核心技术.html

<div id="outline-container-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> 执行器</h3>
<div class="outline-text-3" id="text-8-9">


</div>

<div id="outline-container-8-9-1" class="outline-4">
<h4 id="sec-8-9-1"><span class="section-number-4">8.9.1</span> 线程池</h4>
<div class="outline-text-4" id="text-8-9-1">

<p>使用线程池的步骤
</p><ol>
<li>调用Executors类中的静态方法newCachedThreadPool或newFixeThreadPool
</li>
<li>调用submit提交Runnable或Callable对象
</li>
<li>如果想取消任务,或产看任务状态,就要保存好submit返回的Future对象
</li>
<li>当不再提交任务时,调用shutdown
</li>
</ol>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.Executors

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#32447;&#31243;&#27744;,&#21442;&#25968;&#25351;&#23450;&#32447;&#31243;&#25968;</span>
<span style="color: #228b22;">ExecutorService</span> <span style="color: #0000ff;">newFixedThreadPool</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">threads</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#24102;&#32531;&#23384;&#30340;&#32447;&#31243;&#27744;,&#35813;&#27744;&#22312;&#24517;&#35201;&#26102;&#21019;&#24314;&#32447;&#31243;,&#32447;&#31243;&#31354;&#38386;60&#31186;&#20043;&#21518;&#32456;&#27490;</span>
ExecutorService newCachedThreadPool()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#25191;&#34892;&#22120;,&#23427;&#22312;&#19968;&#20010;&#21333;&#19968;&#30340;&#32447;&#31243;&#20013;&#20381;&#27425;&#25191;&#34892;&#21508;&#20010;&#20219;&#21153;</span>
ExecutorService newSingleThreadExecutor()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">ExecutorService</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25552;&#20132;&#25351;&#23450;&#30340;&#20219;&#21153;&#21462;&#25191;&#34892;</span>
<span style="color: #0000ff;">Future</span>&lt;T&gt; submit(Callable&lt;T&gt; task)
Future&lt;T&gt; submit(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">result</span>)   <span style="color: #b22222;">//</span><span style="color: #b22222;">get&#26041;&#27861;&#22312;&#23436;&#25104;&#26102;&#36820;&#22238;&#25351;&#23450;&#30340;result&#23545;&#35937;</span>
Future&lt;?&gt; submit(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>)             <span style="color: #b22222;">//</span><span style="color: #b22222;">get&#26041;&#27861;&#22312;&#23436;&#25104;&#26102;&#36820;&#22238;null</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#20851;&#38381;&#26381;&#21153;,&#20250;&#20808;&#23436;&#25104;&#24050;&#32463;&#25552;&#20132;&#30340;&#20219;&#21153;&#32780;&#19981;&#20877;&#25509;&#25910;&#26032;&#30340;&#20219;&#21153;</span>
<span style="color: #228b22;">void</span> shutdown()
</pre>

</div>

</div>

<div id="outline-container-8-9-2" class="outline-4">
<h4 id="sec-8-9-2"><span class="section-number-4">8.9.2</span> 预订执行</h4>
<div class="outline-text-4" id="text-8-9-2">




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.Executors

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#32447;&#31243;&#27744;,&#21442;&#25968;&#25351;&#23450;&#32447;&#31243;&#25968;</span>
<span style="color: #228b22;">ScheduledExecutorService</span> <span style="color: #0000ff;">newScheduledThreadPool</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">threads</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#25191;&#34892;&#22120;,&#22312;&#19968;&#20010;&#21333;&#29420;&#32447;&#31243;&#20013;&#35843;&#24230;&#20219;&#21153;</span>
ScheduledExecutorService newSingleThreadScheduledExecutor()
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">ScheduledExecutorService</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#39044;&#35746;&#22312;&#25351;&#23450;&#30340;&#26102;&#38388;&#20043;&#21518;&#25191;&#34892;&#20219;&#21153;</span>
<span style="color: #0000ff;">ScheduledFuture</span>&lt;V&gt; schedule(Callable&lt;V&gt; task, 
                            <span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>,
                            <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
ScheduledFuture&lt;?&gt; schedule(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>, 
                            <span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>,
                            <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#39044;&#35746;&#22312;&#21021;&#22987;&#30340;&#24310;&#36831;&#32467;&#26463;&#21518;,&#21608;&#26399;&#24615;&#22320;&#36816;&#34892;&#25351;&#23450;&#20219;&#21153;,&#21608;&#26399;&#20026;period</span>
ScheduledFuture&lt;?&gt; scheduleAtFixedRate(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>,
                                       <span style="color: #228b22;">long</span> <span style="color: #a0522d;">initialDelay</span>, 
                                       <span style="color: #228b22;">long</span> <span style="color: #a0522d;">period</span>,
                                       <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#39044;&#35746;&#22312;&#21021;&#22987;&#30340;&#24310;&#36831;&#32467;&#26463;&#21518;,&#21608;&#26399;&#24615;&#22320;&#36816;&#34892;&#25351;&#23450;&#20219;&#21153;,&#19978;&#19968;&#27425;&#35843;&#29992;&#32467;&#26463;&#21644;&#19979;&#19968;&#27425;&#35843;&#29992;&#24320;&#22987;&#20043;&#38388;&#26377;&#22266;&#23450;&#24310;&#36831;</span>
ScheduledFuture&lt;?&gt; scheduleWithFixedDelay(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>,
                                          <span style="color: #228b22;">long</span> <span style="color: #a0522d;">initialDelay</span>,
                                          <span style="color: #228b22;">long</span> <span style="color: #a0522d;">delay</span>,
                                          <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>

</div>

<div id="outline-container-8-9-3" class="outline-4">
<h4 id="sec-8-9-3"><span class="section-number-4">8.9.3</span> 控制任务组</h4>
<div class="outline-text-4" id="text-8-9-3">

<p>执行器除了可以作为线程池使用,还可以用来控制一组相关任务
</p><ul>
<li>invokeAny同时运行多个任务,而只返回最先完成的任务的结果.
</li>
<li>invokeAll同时运行多个任务,返回一个Future列表
</li>
</ul>




<pre class="src src-java">List&lt;Callable&lt;T&gt;&gt; tasks = ...;
List&lt;Future&lt;T&gt;&gt; results = executor.invokeAll(tasks);
<span style="color: #a020f0;">for</span>(Future&lt;T&gt; result:results)
    ...
</pre>

<ul>
<li>invokeAll的缺陷在于如果第一个任务恰巧花去了很多时间,则可能不得不进行等待
</li>
<li>ExecutorCompletionService解决了这个问题,其take方法将返回一个已完成的结果
</li>
</ul>




<pre class="src src-java"><span style="color: #228b22;">ExecutorCompletionService</span> <span style="color: #a0522d;">service</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ExecutorCompletionService</span>(executor);
<span style="color: #a020f0;">for</span>(Callable&lt;T&gt; task:tasks) service.submit(task);
<span style="color: #a020f0;">for</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0;i&lt;tasks.size();i++)
    processFuther(service.take().get());
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.ExecutorService

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25191;&#34892;&#32473;&#23450;&#30340;&#20219;&#21153;,&#36820;&#22238;&#20854;&#20013;&#19968;&#20010;&#20219;&#21153;&#30340;&#32467;&#26524;</span>
<span style="color: #228b22;">T</span> <span style="color: #0000ff;">invokeAny</span>(Collection&lt;Callable&lt;T&gt;&gt; tasks)
T invokeAny(Collection&lt;Callable&lt;T&gt;&gt; tasks, <span style="color: #228b22;">long</span> <span style="color: #a0522d;">timeout</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25191;&#34892;&#32473;&#23450;&#30340;&#20219;&#21153;,&#36820;&#22238;&#25152;&#26377;&#20219;&#21153;&#30340;&#32467;&#26524;</span>
List&lt;Future&lt;T&gt;&gt; invokeAll(Collection&lt;Callable&lt;T&gt;&gt; tasks)
List&lt;Future&lt;T&gt;&gt; invokeAll(Collection&lt;Callable&lt;T&gt;&gt; tasks, 
                          <span style="color: #228b22;">long</span> <span style="color: #a0522d;">timeout</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">ExecutorCompletionService</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#36896;&#19968;&#20010;&#25191;&#34892;&#22120;&#23436;&#25104;&#26381;&#21153;&#26469;&#25910;&#38598;&#32473;&#23450;&#25191;&#34892;&#22120;&#30340;&#32467;&#26524;</span>
<span style="color: #0000ff;">ExecutorCompletionService</span>(<span style="color: #228b22;">Executor</span> <span style="color: #a0522d;">e</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#25552;&#20132;&#19968;&#20010;&#20219;&#21153;&#32473;&#24213;&#23618;&#30340;&#25191;&#34892;&#22120;</span>
Future&lt;T&gt; submit(Callable&lt;T&gt; task)
Future&lt;T&gt; submit(<span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">task</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">result</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31227;&#38500;&#19979;&#19968;&#20010;&#24050;&#23436;&#25104;&#30340;&#32467;&#26524;,&#22914;&#26524;&#27809;&#26377;&#21017;&#38459;&#22622;</span>
Future&lt;T&gt; take()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31227;&#38500;&#19979;&#19968;&#20010;&#24050;&#23436;&#25104;&#30340;&#32467;&#26524;,&#22914;&#26524;&#27809;&#26377;&#21017;&#36820;&#22238;null</span>
Future&lt;T&gt; poll()
Future&lt;T&gt; poll(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>
</div>

</div>

<div id="outline-container-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> 同步器</h3>
<div class="outline-text-3" id="text-8-10">

<p>java预置符合某些行为模式的库类,如果有一个相互合作的线程满足这些行为模式之一,那么应该直接重用合适的库类,而不要试图提供手工的锁与条件的集合
</p>
</div>
