src/java核心技术.org
*** 信号量
+ 一个信号量管理固定数目的许可,线程通过acquire请求许可,通过调用release释放许可
+ 许可数目是固定的,由此限定了通过的线程数量
+ 许可不是必须由获取它的线程释放
+ 事实上,任何线程都可以释放任意数目的许可
+ 如果释放的许可多于可用许可的最大数目,信号量指示被设置为可用许可的最大数目
#+BEGIN_SRC java
java.util.concurrent.Semaphore

//用给定的许可数目为最大值构建一个信号量
Semaphore(int permits)
Semaphore(int permits, boolean fair)

//等待获得一个许可
void acquire()

//尝试获得一个许可,如果没有可用的许可,返回false
boolean tryAcquire()

//尝试在给定时间内获得一个许可,如果没有可用的许可,返回false
boolean tryAcquire(long time, TimeUnit unit)

//释放一个许可
void release()
#+END_SRC
*** 倒计时门栓
+ 倒计时门栓让一个线程集等待直到计数变为0
+ 倒计时门栓是一次性的,一旦计数为0,就不能再重用了
#+BEGIN_SRC java
java.util.concurrent.CountDownLatch

//用给定计数构建一个倒计时门栓
CountdownLatch(int count)

//等待门栓的计数降为零
void await()

//等待门栓的计数降为零或者超时,如果计数为0返回true,如果超时返回false
boolean awati(long time, TimeUnit unit)

//递减门栓的计数值
public void countDown()
#+END_SRC
*** 障栅
+ 适用于大量线程运行在一次计算的不同部分,当所有部分都准备好时,再把结果组合在一起
+ 当一个线程完成了它的那部分任务后,让它运行到障栅处,一旦所有线程都达到了这个障栅,障栅就撤销,线程就可以继续运行
+ 障栅在所有等待线程被释放后可被重用
#+BEGIN_SRC java
java.util.concurrent.CyclicBarrier

//构建一个线程数目是parties的循环障栅,当所有线程都在障栅上调用await后,执行barierAction
CyclicBarrier(int parties)
CyclicBarrier(int parties, Runnable barrierAction)

//等待直到所有线程在障栅上调用await或者时间超时,成功时返回这个线程的序号
int await()
int await(long time, TimeUnit unit)
#+END_SRC
*** 交换器
当两个线程在同一个数据缓冲区的两个实例上工作时,可以使用交换器,
典型的情况是一个线程向缓冲区填入数据,另一个线程消耗这些数据,当他们都完成以后,相互交换缓冲区
#+BEGIN_SRC java
java.util.concurrent.Exchanger<V>

//阻塞直到另一个线程调用这个方法,然后,其他线程交换item,并返回其他线程的item
V exchange(V item)
V exchange(V item, long time, TimeUnit unit)
#+END_SRC
*** 同步队列
同步队列是一种将生产者与消费者线程配对的机制.
当一个线程调用put方法时,将会阻塞直到另一个线程调用take方法为止.
当一个线程调用take方法时,将会阻塞直到另一个线程调用put方法为止.
与Exchanger的情况不同,数据传递是单向的,从生产者到消费者.
#+BEGIN_SRC java
java.util.concurrent.SynchronousQueue<V>

//构建一个允许线程提交item的同步队列.如果fair是true,队列优先照顾等待了最长时间的线程
SynchronousQueue()
SynchronousQueue(boolean fair)

//阻塞直到另一个线程调用take来获取item
void put(V item)

//阻塞直到另一个线程调用put,返回另一个线程提供的item
V take()
#+END_SRC
