html/java核心技术.html

<div id="outline-container-8-10-1" class="outline-4">
<h4 id="sec-8-10-1"><span class="section-number-4">8.10.1</span> 信号量</h4>
<div class="outline-text-4" id="text-8-10-1">

<ul>
<li>一个信号量管理固定数目的许可,线程通过acquire请求许可,通过调用release释放许可
</li>
<li>许可数目是固定的,由此限定了通过的线程数量
</li>
<li>许可不是必须由获取它的线程释放
</li>
<li>事实上,任何线程都可以释放任意数目的许可
</li>
<li>如果释放的许可多于可用许可的最大数目,信号量指示被设置为可用许可的最大数目
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">Semaphore</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#32473;&#23450;&#30340;&#35768;&#21487;&#25968;&#30446;&#20026;&#26368;&#22823;&#20540;&#26500;&#24314;&#19968;&#20010;&#20449;&#21495;&#37327;</span>
<span style="color: #0000ff;">Semaphore</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">permits</span>)
Semaphore(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">permits</span>, <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">fair</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#33719;&#24471;&#19968;&#20010;&#35768;&#21487;</span>
<span style="color: #228b22;">void</span> acquire()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23581;&#35797;&#33719;&#24471;&#19968;&#20010;&#35768;&#21487;,&#22914;&#26524;&#27809;&#26377;&#21487;&#29992;&#30340;&#35768;&#21487;,&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> tryAcquire()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#23581;&#35797;&#22312;&#32473;&#23450;&#26102;&#38388;&#20869;&#33719;&#24471;&#19968;&#20010;&#35768;&#21487;,&#22914;&#26524;&#27809;&#26377;&#21487;&#29992;&#30340;&#35768;&#21487;,&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> tryAcquire(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#37322;&#25918;&#19968;&#20010;&#35768;&#21487;</span>
<span style="color: #228b22;">void</span> release()
</pre>

</div>

</div>

<div id="outline-container-8-10-2" class="outline-4">
<h4 id="sec-8-10-2"><span class="section-number-4">8.10.2</span> 倒计时门栓</h4>
<div class="outline-text-4" id="text-8-10-2">

<ul>
<li>倒计时门栓让一个线程集等待直到计数变为0
</li>
<li>倒计时门栓是一次性的,一旦计数为0,就不能再重用了
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">CountDownLatch</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#32473;&#23450;&#35745;&#25968;&#26500;&#24314;&#19968;&#20010;&#20498;&#35745;&#26102;&#38376;&#26643;</span>
<span style="color: #0000ff;">CountdownLatch</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">count</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#38376;&#26643;&#30340;&#35745;&#25968;&#38477;&#20026;&#38646;</span>
<span style="color: #228b22;">void</span> await()

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#38376;&#26643;&#30340;&#35745;&#25968;&#38477;&#20026;&#38646;&#25110;&#32773;&#36229;&#26102;,&#22914;&#26524;&#35745;&#25968;&#20026;0&#36820;&#22238;true,&#22914;&#26524;&#36229;&#26102;&#36820;&#22238;false</span>
<span style="color: #228b22;">boolean</span> await(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#36882;&#20943;&#38376;&#26643;&#30340;&#35745;&#25968;&#20540;</span>
<span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> countDown()
</pre>

</div>

</div>

<div id="outline-container-8-10-3" class="outline-4">
<h4 id="sec-8-10-3"><span class="section-number-4">8.10.3</span> 障栅</h4>
<div class="outline-text-4" id="text-8-10-3">

<ul>
<li>适用于大量线程运行在一次计算的不同部分,当所有部分都准备好时,再把结果组合在一起
</li>
<li>当一个线程完成了它的那部分任务后,让它运行到障栅处,一旦所有线程都达到了这个障栅,障栅就撤销,线程就可以继续运行
</li>
<li>障栅在所有等待线程被释放后可被重用
</li>
</ul>




<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.<span style="color: #228b22;">CyclicBarrier</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#24314;&#19968;&#20010;&#32447;&#31243;&#25968;&#30446;&#26159;parties&#30340;&#24490;&#29615;&#38556;&#26629;,&#24403;&#25152;&#26377;&#32447;&#31243;&#37117;&#22312;&#38556;&#26629;&#19978;&#35843;&#29992;await&#21518;,&#25191;&#34892;barierAction</span>
<span style="color: #0000ff;">CyclicBarrier</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">parties</span>)
CyclicBarrier(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">parties</span>, <span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">barrierAction</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31561;&#24453;&#30452;&#21040;&#25152;&#26377;&#32447;&#31243;&#22312;&#38556;&#26629;&#19978;&#35843;&#29992;await&#25110;&#32773;&#26102;&#38388;&#36229;&#26102;,&#25104;&#21151;&#26102;&#36820;&#22238;&#36825;&#20010;&#32447;&#31243;&#30340;&#24207;&#21495;</span>
<span style="color: #228b22;">int</span> await()
<span style="color: #228b22;">int</span> await(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>

</div>

<div id="outline-container-8-10-4" class="outline-4">
<h4 id="sec-8-10-4"><span class="section-number-4">8.10.4</span> 交换器</h4>
<div class="outline-text-4" id="text-8-10-4">

<p>当两个线程在同一个数据缓冲区的两个实例上工作时,可以使用交换器,
典型的情况是一个线程向缓冲区填入数据,另一个线程消耗这些数据,当他们都完成以后,相互交换缓冲区
</p>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.Exchanger&lt;V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#38459;&#22622;&#30452;&#21040;&#21478;&#19968;&#20010;&#32447;&#31243;&#35843;&#29992;&#36825;&#20010;&#26041;&#27861;,&#28982;&#21518;,&#20854;&#20182;&#32447;&#31243;&#20132;&#25442;item,&#24182;&#36820;&#22238;&#20854;&#20182;&#32447;&#31243;&#30340;item</span>
V exchange(<span style="color: #228b22;">V</span> <span style="color: #a0522d;">item</span>)
V exchange(<span style="color: #228b22;">V</span> <span style="color: #a0522d;">item</span>, <span style="color: #228b22;">long</span> <span style="color: #a0522d;">time</span>, <span style="color: #228b22;">TimeUnit</span> <span style="color: #a0522d;">unit</span>)
</pre>

</div>

</div>

<div id="outline-container-8-10-5" class="outline-4">
<h4 id="sec-8-10-5"><span class="section-number-4">8.10.5</span> 同步队列</h4>
<div class="outline-text-4" id="text-8-10-5">

<p>同步队列是一种将生产者与消费者线程配对的机制.
当一个线程调用put方法时,将会阻塞直到另一个线程调用take方法为止.
当一个线程调用take方法时,将会阻塞直到另一个线程调用put方法为止.
与Exchanger的情况不同,数据传递是单向的,从生产者到消费者.
</p>


<pre class="src src-java"><span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">util</span>.<span style="color: #008b8b;">concurrent</span>.SynchronousQueue&lt;V&gt;

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#26500;&#24314;&#19968;&#20010;&#20801;&#35768;&#32447;&#31243;&#25552;&#20132;item&#30340;&#21516;&#27493;&#38431;&#21015;.&#22914;&#26524;fair&#26159;true,&#38431;&#21015;&#20248;&#20808;&#29031;&#39038;&#31561;&#24453;&#20102;&#26368;&#38271;&#26102;&#38388;&#30340;&#32447;&#31243;</span>
SynchronousQueue()
SynchronousQueue(<span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">fair</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#38459;&#22622;&#30452;&#21040;&#21478;&#19968;&#20010;&#32447;&#31243;&#35843;&#29992;take&#26469;&#33719;&#21462;item</span>
<span style="color: #228b22;">void</span> put(<span style="color: #228b22;">V</span> <span style="color: #a0522d;">item</span>)

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#38459;&#22622;&#30452;&#21040;&#21478;&#19968;&#20010;&#32447;&#31243;&#35843;&#29992;put,&#36820;&#22238;&#21478;&#19968;&#20010;&#32447;&#31243;&#25552;&#20379;&#30340;item</span>
V take()
</pre>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-07T20:28+0800</p>
<p class="author">Author: 王超</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
